[NoCoverage] Block removal mutation
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:18:5
     private readonly IWebRequest _webRequest;
 
     public GetUserActionFilter(IWebRequest webRequest)
-    {
-        _webRequest = webRequest;
-    }
+    {}
 
     public void OnActionExecuting(ActionExecutingContext context)

[NoCoverage] Statement mutation
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:29:42
 
         string token = ExtractTokenFromHeaders(headers);
 
-        if (string.IsNullOrEmpty(token)) throw new AccessDeniedException("CommonAccessDeniedException");
+        if (string.IsNullOrEmpty(token)) ;
 
         JwtSecurityTokenHandler tokenHandler = new JwtSecurityTokenHandler();

[NoCoverage] Negate expression
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:29:13
 
         string token = ExtractTokenFromHeaders(headers);
 
-        if (string.IsNullOrEmpty(token)) throw new AccessDeniedException("CommonAccessDeniedException");
+        if (!(string.IsNullOrEmpty(token))) throw new AccessDeniedException("CommonAccessDeniedException");
 
         JwtSecurityTokenHandler tokenHandler = new JwtSecurityTokenHandler();

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:34:33
         JwtSecurityTokenHandler tokenHandler = new JwtSecurityTokenHandler();
         JwtSecurityToken jwtToken = tokenHandler.ReadToken(token) as JwtSecurityToken;
 
-        _webRequest.ClientUid = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "azp")?.Value;
+        _webRequest.ClientUid = jwtToken?.Claims.First(claim => claim.Type == "azp")?.Value;
         _webRequest.Username = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "name")?.Value;
         _webRequest.Email = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "email")?.Value;

[NoCoverage] Equality mutation
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:34:74
         JwtSecurityTokenHandler tokenHandler = new JwtSecurityTokenHandler();
         JwtSecurityToken jwtToken = tokenHandler.ReadToken(token) as JwtSecurityToken;
 
-        _webRequest.ClientUid = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "azp")?.Value;
+        _webRequest.ClientUid = jwtToken?.Claims.FirstOrDefault(claim => claim.Type != "azp")?.Value;
         _webRequest.Username = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "name")?.Value;
         _webRequest.Email = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "email")?.Value;

[NoCoverage] Equality mutation
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:35:73
         JwtSecurityToken jwtToken = tokenHandler.ReadToken(token) as JwtSecurityToken;
 
         _webRequest.ClientUid = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "azp")?.Value;
-        _webRequest.Username = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "name")?.Value;
+        _webRequest.Username = jwtToken?.Claims.FirstOrDefault(claim => claim.Type != "name")?.Value;
         _webRequest.Email = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "email")?.Value;
     }

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:35:32
         JwtSecurityToken jwtToken = tokenHandler.ReadToken(token) as JwtSecurityToken;
 
         _webRequest.ClientUid = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "azp")?.Value;
-        _webRequest.Username = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "name")?.Value;
+        _webRequest.Username = jwtToken?.Claims.First(claim => claim.Type == "name")?.Value;
         _webRequest.Email = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "email")?.Value;
     }

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:36:29
 
         _webRequest.ClientUid = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "azp")?.Value;
         _webRequest.Username = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "name")?.Value;
-        _webRequest.Email = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "email")?.Value;
+        _webRequest.Email = jwtToken?.Claims.First(claim => claim.Type == "email")?.Value;
     }
 

[NoCoverage] Equality mutation
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:36:70
 
         _webRequest.ClientUid = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "azp")?.Value;
         _webRequest.Username = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "name")?.Value;
-        _webRequest.Email = jwtToken?.Claims.FirstOrDefault(claim => claim.Type == "email")?.Value;
+        _webRequest.Email = jwtToken?.Claims.FirstOrDefault(claim => claim.Type != "email")?.Value;
     }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:45:13
 
     private static string ExtractTokenFromHeaders(IHeaderDictionary headers)
     {   
-        if (!headers.TryGetValue("authorization", out StringValues authorization)) return null;
+        if (headers.TryGetValue("authorization", out StringValues authorization)) return null;
         string[] parts = authorization.ToString().Split(' ');
         

[NoCoverage] Logical mutation
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:48:16
         if (!headers.TryGetValue("authorization", out StringValues authorization)) return null;
         string[] parts = authorization.ToString().Split(' ');
         
-        return parts is {Length: 2} && parts[0] == "Bearer" ? parts[1] : null;
+        return parts is {Length: 2} || parts[0] == "Bearer" ? parts[1] : null;
     }
 }

[NoCoverage] Equality mutation
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:48:40
         if (!headers.TryGetValue("authorization", out StringValues authorization)) return null;
         string[] parts = authorization.ToString().Split(' ');
         
-        return parts is {Length: 2} && parts[0] == "Bearer" ? parts[1] : null;
+        return parts is {Length: 2} && parts[0] != "Bearer" ? parts[1] : null;
     }
 }
