[Killed] Logical mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:14:16
 {
     public static bool IsPercentage(string input)
     {
-        return string.IsNullOrEmpty(input) || byte.TryParse(input, out byte percentage) && percentage <= 100;
+        return string.IsNullOrEmpty(input) && byte.TryParse(input, out byte percentage) && percentage <= 100;
     }
     
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsPercentage; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsPercentage; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsPercentage

[Killed] Logical mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:14:47
 {
     public static bool IsPercentage(string input)
     {
-        return string.IsNullOrEmpty(input) || byte.TryParse(input, out byte percentage) && percentage <= 100;
+        return string.IsNullOrEmpty(input) || byte.TryParse(input, out byte percentage) || percentage <= 100;
     }
     
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsPercentage; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsPercentage; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsPercentage

[Killed] Logical mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:19:16
     
     public static bool IsByte(string input)
     {
-        return string.IsNullOrEmpty(input) || byte.TryParse(input, out _);
+        return string.IsNullOrEmpty(input) && byte.TryParse(input, out _);
     }
     
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsByte; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsByte; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsByte

[Killed] String mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:19:16
     
     public static bool IsByte(string input)
     {
-        return string.IsNullOrEmpty(input) || byte.TryParse(input, out _);
+        return (input!="") || byte.TryParse(input, out _);
     }
     
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsByte; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsByte; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsByte

[Killed] Logical mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:24:16
     
     public static bool IsInteger(string input)
     {
-        return string.IsNullOrEmpty(input) || int.TryParse(input, out _);
+        return string.IsNullOrEmpty(input) && int.TryParse(input, out _);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsInteger; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsInteger; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsInteger

[Killed] Logical mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:29:16
 
     public static bool IsLong(string input)
     {
-        return string.IsNullOrEmpty(input) || long.TryParse(input, out _);
+        return string.IsNullOrEmpty(input) && long.TryParse(input, out _);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsLong; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsLong; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsLong

[Killed] Logical mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:34:16
 
     public static bool IsFloat(string input)
     {
-        return string.IsNullOrEmpty(input) || float.TryParse(input, out _);
+        return string.IsNullOrEmpty(input) && float.TryParse(input, out _);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsFloat; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsFloat; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsFloat

[Killed] String mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:34:16
 
     public static bool IsFloat(string input)
     {
-        return string.IsNullOrEmpty(input) || float.TryParse(input, out _);
+        return (input!=null) || float.TryParse(input, out _);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsFloat; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsFloat; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsFloat

[Killed] Logical mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:39:16
 
     public static bool IsDouble(string input)
     {
-        return string.IsNullOrEmpty(input) || double.TryParse(input, out _);
+        return string.IsNullOrEmpty(input) && double.TryParse(input, out _);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsDouble; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsDouble; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsDouble

[Killed] Logical mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:44:16
 
     public static bool IsValidUri(string link)
     {
-        return Uri.TryCreate(link, UriKind.Absolute, out Uri outUri)
-               && (outUri.Scheme == Uri.UriSchemeHttp || outUri.Scheme == Uri.UriSchemeHttps);
+        return Uri.TryCreate(link, UriKind.Absolute, out Uri outUri)
+               || (outUri.Scheme == Uri.UriSchemeHttp || outUri.Scheme == Uri.UriSchemeHttps);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsAValidUrl; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsAValidUrl; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsAValidUrl

[Killed] Logical mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:45:20
     public static bool IsValidUri(string link)
     {
         return Uri.TryCreate(link, UriKind.Absolute, out Uri outUri)
-               && (outUri.Scheme == Uri.UriSchemeHttp || outUri.Scheme == Uri.UriSchemeHttps);
+               && (outUri.Scheme == Uri.UriSchemeHttp && outUri.Scheme == Uri.UriSchemeHttps);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsAValidUrl; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsAValidUrl

[Killed] Equality mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:45:58
     public static bool IsValidUri(string link)
     {
         return Uri.TryCreate(link, UriKind.Absolute, out Uri outUri)
-               && (outUri.Scheme == Uri.UriSchemeHttp || outUri.Scheme == Uri.UriSchemeHttps);
+               && (outUri.Scheme == Uri.UriSchemeHttp || outUri.Scheme != Uri.UriSchemeHttps);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsAValidUrl; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsAValidUrl; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsAValidUrl

[Killed] Equality mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:51:31
     public static bool HasDuplicatedValues<T>(IEnumerable<T> elements)
     {
         IEnumerable<T> duplicates = elements.GroupBy(element => element)
-            .Where(element => element.Count() > 1)
+            .Where(element => element.Count() >= 1)
             .Select(element => element.Key);
         return duplicates.Any();
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateDuplicityOverAnObjectEnumerable

[Killed] Equality mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:51:31
     public static bool HasDuplicatedValues<T>(IEnumerable<T> elements)
     {
         IEnumerable<T> duplicates = elements.GroupBy(element => element)
-            .Where(element => element.Count() > 1)
+            .Where(element => element.Count() < 1)
             .Select(element => element.Key);
         return duplicates.Any();
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateDuplicityOverAnObjectEnumerable

[Killed] Block removal mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:57:5
     }
 
     public static bool IsValidEnumOf<T>(string candidate) where T : Enumeration<T>
-    {
-        return Enumeration<T>.GetByName(candidate).HasValue();
-    }
+    {}
 
     public static bool BeEmptyOrAValidDate(string dateTimeIso8601)
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnEnumeration

[Killed] Logical mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:65:16
     {
         IFormatProvider culture = CultureInfo.InvariantCulture;
         const DateTimeStyles styles = DateTimeStyles.AllowWhiteSpaces | DateTimeStyles.AssumeLocal;
-        return string.IsNullOrWhiteSpace(dateTimeIso8601) || DateTime.TryParse(dateTimeIso8601, culture, styles, out _);
+        return string.IsNullOrWhiteSpace(dateTimeIso8601) && DateTime.TryParse(dateTimeIso8601, culture, styles, out _);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateADate; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateADate; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateADate

[Killed] String mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:65:16
     {
         IFormatProvider culture = CultureInfo.InvariantCulture;
         const DateTimeStyles styles = DateTimeStyles.AllowWhiteSpaces | DateTimeStyles.AssumeLocal;
-        return string.IsNullOrWhiteSpace(dateTimeIso8601) || DateTime.TryParse(dateTimeIso8601, culture, styles, out _);
+        return (dateTimeIso8601.Trim()!="") || DateTime.TryParse(dateTimeIso8601, culture, styles, out _);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateADate; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateADate

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:72:13
     {
         try
         {
-            JsonDocument.Parse(input);
+            ;
         }
         catch (Exception)
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAJson; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAJson; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAJson

[Killed] Equality mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:88:51
         {
             JSchema schema = JSchema.Parse(input);
 
-            return schema.Properties.Count > 0 && schema.Required.Count > 0 && schema.Type.HasValue;
+            return schema.Properties.Count > 0 && schema.Required.Count < 0 && schema.Type.HasValue;
         }
         catch (Exception)
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllRequiredSchemaFields; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllRequiredSchemaFields

[Killed] Equality mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:88:51
         {
             JSchema schema = JSchema.Parse(input);
 
-            return schema.Properties.Count > 0 && schema.Required.Count > 0 && schema.Type.HasValue;
+            return schema.Properties.Count > 0 && schema.Required.Count >= 0 && schema.Type.HasValue;
         }
         catch (Exception)
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllRequiredSchemaFields; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllRequiredSchemaFields

[Killed] Block removal mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:101:9
     public static bool HaveAllPropertiesTyped(string input)
     {
         try
-        {
-            JSchema schema = JSchema.Parse(input);
-
-            return SchemaHasAllPropertiesTyped(schema.Properties);
-        }
+        {}
         catch (Exception)
         {
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllPropertiesTyped

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:118:17
     {
         foreach ((_, JSchema value) in properties.Select(property => (property.Key, property.Value)))
         {
-            if (!value.Type.HasValue) return false;
+            if (value.Type.HasValue) return false;
             if (!SchemaHasAllPropertiesTyped(value.Properties)) return false;
         }
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllPropertiesTyped; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllPropertiesTyped

[Killed] Boolean mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:118:46
     {
         foreach ((_, JSchema value) in properties.Select(property => (property.Key, property.Value)))
         {
-            if (!value.Type.HasValue) return false;
+            if (!value.Type.HasValue) return true;
             if (!SchemaHasAllPropertiesTyped(value.Properties)) return false;
         }
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllPropertiesTyped; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllPropertiesTyped

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:119:17
         foreach ((_, JSchema value) in properties.Select(property => (property.Key, property.Value)))
         {
             if (!value.Type.HasValue) return false;
-            if (!SchemaHasAllPropertiesTyped(value.Properties)) return false;
+            if (SchemaHasAllPropertiesTyped(value.Properties)) return false;
         }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllPropertiesTyped; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllPropertiesTyped

[Killed] Boolean mutation
querystring-composer-api-netcore/Core/Commons/ArgumentChecker.cs:119:72
         foreach ((_, JSchema value) in properties.Select(property => (property.Key, property.Value)))
         {
             if (!value.Type.HasValue) return false;
-            if (!SchemaHasAllPropertiesTyped(value.Properties)) return false;
+            if (!SchemaHasAllPropertiesTyped(value.Properties)) return true;
         }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllPropertiesTyped
