[Killed] Equality mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:11:25
 {
     public static T CheckNull<T>([AllowNull] T input, string parameterName, string message = null)
     {
-        return input is not null ? input : throw CreateArgumentNullException(parameterName, message);
+        return input is null ? input : throw CreateArgumentNullException(parameterName, message);
     }
 
killedBy: UnitTest.Core.Domains.ServiceResolverInjectionTest.FailToCreateAnInstanceIfServiceResolverIsNotSupplied; UnitTest.Core.Domains.ServiceResolverInjectionTest.FailToCreateAnInstanceIfServiceResolverIsNotSupplied; UnitTest.Core.Domains.ServiceResolverInjectionTest.FailToCreateAnInstanceIfServiceResolverIsNotSupplied

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:16:16
 
     public static string CheckEmpty([AllowNull] string input, string parameterName, string message = null)
     {
-        return !string.IsNullOrWhiteSpace(input) ? input : throw CreateArgumentException(parameterName, message);
+        return string.IsNullOrWhiteSpace(input) ? input : throw CreateArgumentException(parameterName, message);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAStringParameterIfItIsNull; UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateAStringParameterIfItIsNotNull; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAStringParameterIfItIsNullWithCustomMessage

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:21:13
 
     public static IReadOnlyCollection<T> CheckNullOrEmpty<T>(IReadOnlyCollection<T> input, string parameterName, string message = null)
     {
-        if (input is not null && input.Count > 0) return input;
+        if (!(input is not null && input.Count > 0)) return input;
 
         if (input is null) throw CreateArgumentNullException(parameterName, message);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsEmpty; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsNull; UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateAnObjectListParameterIfItIsNotNull

[Killed] Equality mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:21:22
 
     public static IReadOnlyCollection<T> CheckNullOrEmpty<T>(IReadOnlyCollection<T> input, string parameterName, string message = null)
     {
-        if (input is not null && input.Count > 0) return input;
+        if (input is null && input.Count > 0) return input;
 
         if (input is null) throw CreateArgumentNullException(parameterName, message);
killedBy: UnitTest.Core.Commons.Paging.PageRequestTest.SuccessfulToInstantiatePageRequestIfParametersAreValid

[Killed] Equality mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:23:22
     {
         if (input is not null && input.Count > 0) return input;
 
-        if (input is null) throw CreateArgumentNullException(parameterName, message);
+        if (input is not null) throw CreateArgumentNullException(parameterName, message);
 
         throw CreateArgumentException(parameterName, message);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsEmpty; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsNull

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:23:28
     {
         if (input is not null && input.Count > 0) return input;
 
-        if (input is null) throw CreateArgumentNullException(parameterName, message);
+        if (input is null) ;
 
         throw CreateArgumentException(parameterName, message);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsNull

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:25:9
 
         if (input is null) throw CreateArgumentNullException(parameterName, message);
 
-        throw CreateArgumentException(parameterName, message);
+        ;
     }
 
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsEmpty

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:30:13
 
     public static void CheckNegative(int input, string parameterName, string message)
     {
-        if (input >= 0) return;
+        if (!(input >= 0)) return;
         string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative. (Parameter '{parameterName}')" : message;
         throw CreateArgumentException(parameterName, exceptionMessage);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateNegativeParameters

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:30:25
 
     public static void CheckNegative(int input, string parameterName, string message)
     {
-        if (input >= 0) return;
+        if (input >= 0) ;
         string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative. (Parameter '{parameterName}')" : message;
         throw CreateArgumentException(parameterName, exceptionMessage);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateNegativeParameters

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:31:35
     public static void CheckNegative(int input, string parameterName, string message)
     {
         if (input >= 0) return;
-        string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative. (Parameter '{parameterName}')" : message;
+        string exceptionMessage = !(string.IsNullOrEmpty(message) ) ? $"Value cannot be negative. (Parameter '{parameterName}')" : message;
         throw CreateArgumentException(parameterName, exceptionMessage);
     }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParametersWithCustomMessage

[Killed] String mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:31:35
     public static void CheckNegative(int input, string parameterName, string message)
     {
         if (input >= 0) return;
-        string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative. (Parameter '{parameterName}')" : message;
+        string exceptionMessage = (message!=null) ? $"Value cannot be negative. (Parameter '{parameterName}')" : message;
         throw CreateArgumentException(parameterName, exceptionMessage);
     }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParametersWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParametersWithCustomMessage

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:32:9
     {
         if (input >= 0) return;
         string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative. (Parameter '{parameterName}')" : message;
-        throw CreateArgumentException(parameterName, exceptionMessage);
+        ;
     }
 
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParametersWithCustomMessage

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:37:24
 
     public static void CheckNegativeOrZero(int input, string parameterName, string message)
     {
-        if (input > 0) return;
+        if (input > 0) ;
         string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative or equals to zero. (Parameter '{parameterName}')" : message;
         throw CreateArgumentException(parameterName, exceptionMessage);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrEqualsToZeroParameterWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrEqualsToZeroParameterWithCustomMessage

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:37:13
 
     public static void CheckNegativeOrZero(int input, string parameterName, string message)
     {
-        if (input > 0) return;
+        if (!(input > 0)) return;
         string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative or equals to zero. (Parameter '{parameterName}')" : message;
         throw CreateArgumentException(parameterName, exceptionMessage);
killedBy: UnitTest.Core.Commons.Paging.PageRequestTest.FailToInstantiatePageRequestIfSortIsNull; UnitTest.Core.Commons.Paging.PageRequestTest.SuccessfulToInstantiatePageRequestIfParametersAreValid; UnitTest.Core.Commons.Paging.PageRequestTest.FailToInstantiatePageRequestIfPageSizeIsLessThanOne

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:38:35
     public static void CheckNegativeOrZero(int input, string parameterName, string message)
     {
         if (input > 0) return;
-        string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative or equals to zero. (Parameter '{parameterName}')" : message;
+        string exceptionMessage = !(string.IsNullOrEmpty(message) ) ? $"Value cannot be negative or equals to zero. (Parameter '{parameterName}')" : message;
         throw CreateArgumentException(parameterName, exceptionMessage);
     }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrEqualsToZeroParameter; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrEqualsToZeroParameter; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrEqualsToZeroParameter

[Killed] String mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:38:35
     public static void CheckNegativeOrZero(int input, string parameterName, string message)
     {
         if (input > 0) return;
-        string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative or equals to zero. (Parameter '{parameterName}')" : message;
+        string exceptionMessage = (message!=null) ? $"Value cannot be negative or equals to zero. (Parameter '{parameterName}')" : message;
         throw CreateArgumentException(parameterName, exceptionMessage);
     }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrZeroParametersWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrZeroParametersWithCustomMessage

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:39:9
     {
         if (input > 0) return;
         string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative or equals to zero. (Parameter '{parameterName}')" : message;
-        throw CreateArgumentException(parameterName, exceptionMessage);
+        ;
     }
 
killedBy: UnitTest.Core.Commons.Paging.PageRequestTest.FailToInstantiatePageRequestIfPageSizeIsLessThanOne

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:44:16
 
     private static ArgumentNullException CreateArgumentNullException(string parameterName, string message)
     {
-        return string.IsNullOrEmpty(message) ? new ArgumentNullException(parameterName) : new ArgumentNullException(message, (Exception) null!);
+        return !(string.IsNullOrEmpty(message) ) ? new ArgumentNullException(parameterName) : new ArgumentNullException(message, (Exception) null!);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsNull; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectParameterIfItIsNull; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectParameterIfItIsNullWithCustomMessage

[Killed] String mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:44:16
 
     private static ArgumentNullException CreateArgumentNullException(string parameterName, string message)
     {
-        return string.IsNullOrEmpty(message) ? new ArgumentNullException(parameterName) : new ArgumentNullException(message, (Exception) null!);
+        return (message!=null) ? new ArgumentNullException(parameterName) : new ArgumentNullException(message, (Exception) null!);
     }
 
killedBy: UnitTest.Core.Domains.ServiceResolverInjectionTest.FailToCreateAnInstanceIfServiceResolverIsNotSupplied; UnitTest.Core.Domains.ServiceResolverInjectionTest.FailToCreateAnInstanceIfServiceResolverIsNotSupplied; UnitTest.Core.Domains.ServiceResolverInjectionTest.FailToCreateAnInstanceIfServiceResolverIsNotSupplied

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:49:16
 
     private static ArgumentException CreateArgumentException(string parameterName, string message)
     {
-        return string.IsNullOrEmpty(message)
+        return !(string.IsNullOrEmpty(message)
+)
             ? new ArgumentException($"Value cannot be null or empty. (Parameter '{parameterName}')")
             : new ArgumentException(message, (Exception) null!);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsEmpty; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAStringParameterIfItIsNull

[Killed] String mutation
querystring-composer-api-netcore/Core/Commons/ArgumentValidator.cs:49:16
 
     private static ArgumentException CreateArgumentException(string parameterName, string message)
     {
-        return string.IsNullOrEmpty(message)
+        return (message!="")
             ? new ArgumentException($"Value cannot be null or empty. (Parameter '{parameterName}')")
             : new ArgumentException(message, (Exception) null!);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAStringParameterIfItIsNullWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParameters
