[Killed] Equality mutation
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:43:16
         if (!headers.TryGetValue("authorization", out StringValues authorization)) return null;
         string[] parts = authorization.ToString().Split(' ');
         
-        return parts is ["Bearer", _] ? parts[1] : null;
+        return parts is not ["Bearer", _] ? parts[1] : null;
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.Filters.GetUserActionFilterTests.FailToGetUserFromTokenWhenTokenIsEmpty; IntegrationTest.EntryPoint.WebApi.Commons.Filters.GetUserActionFilterTests.SuccessfulToGetUserFromToken

[Killed] Conditional (true) mutation
EntryPoint.WebApi/Commons/Filters/GetUserActionFilter.cs:43:16
         if (!headers.TryGetValue("authorization", out StringValues authorization)) return null;
         string[] parts = authorization.ToString().Split(' ');
         
-        return parts is ["Bearer", _] ? parts[1] : null;
+        return (true?parts[1] :null);
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.Filters.GetUserActionFilterTests.FailToGetUserFromTokenWhenTokenIsEmpty
