[Killed] Bitwise mutation
querystring-composer-api-netcore/Core/Commons/Enumeration.cs:18:24
     public static IEnumerable<T> GetAll()
     {
         FieldInfo[] fieldInfos = typeof(T)
-            .GetFields(BindingFlags.Public | BindingFlags.Static | BindingFlags.DeclaredOnly);
+            .GetFields(BindingFlags.Public & BindingFlags.Static | BindingFlags.DeclaredOnly);
 
         return fieldInfos
killedBy: UnitTest.Core.Commons.EnumerationTest.SuccessfulToGetAllEnumerationItems

[Killed] Bitwise mutation
querystring-composer-api-netcore/Core/Commons/Enumeration.cs:18:24
     public static IEnumerable<T> GetAll()
     {
         FieldInfo[] fieldInfos = typeof(T)
-            .GetFields(BindingFlags.Public | BindingFlags.Static | BindingFlags.DeclaredOnly);
+            .GetFields(BindingFlags.Public | BindingFlags.Static & BindingFlags.DeclaredOnly);
 
         return fieldInfos
killedBy: UnitTest.Core.Commons.EnumerationTest.SuccessfulToGetAllEnumerationItems

[Killed] Equality mutation
querystring-composer-api-netcore/Core/Commons/Enumeration.cs:27:13
 
     public static Optional<T> GetByName(string name)
     {
-        if (name == null) return Optional<T>.Empty();
+        if (name != null) return Optional<T>.Empty();
 
         FieldInfo[] fieldInfos = typeof(T)
killedBy: UnitTest.Core.Commons.EnumerationTest.SuccessfulToGetEnumerationItemByName; UnitTest.Core.Commons.EnumerationTest.SuccessfulToCompareEnumerationItems; UnitTest.Core.Commons.EnumerationTest.SuccessfulToCompareEnumerationItems

[Killed] Block removal mutation
querystring-composer-api-netcore/Core/Commons/Enumeration.cs:40:5
     }
 
     public bool Is(T enumeration)
-    {
-        return Name.Equals(enumeration.Name);
-    }
+    {}
 
     public bool IsNot(T enumeration)
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
querystring-composer-api-netcore/Core/Commons/Enumeration.cs:46:16
 
     public bool IsNot(T enumeration)
     {
-        return !Is(enumeration);
+        return Is(enumeration);
     }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually
