[Killed] Null coalescing mutation (remove left)
Core/Commons/Extensions/DictionaryExtensions.cs:12:16
 
     private static Dictionary<TKey, TValue> GetEmptyDictionary<TKey, TValue>()
     {
-        return EmptyObjectDictionary as Dictionary<TKey, TValue> ?? new Dictionary<TKey, TValue>();
+        return EmptyObjectDictionary as Dictionary<TKey, TValue>;
     }
 
killedBy: UnitTest.Core.Commons.Extensions.DictionaryExtensionsTest.SuccessfulToReturnsAnAppropriateTypeOfEmptyDictionary

[Survived] Null coalescing mutation (left to right)
Core/Commons/Extensions/DictionaryExtensions.cs:12:16
 
     private static Dictionary<TKey, TValue> GetEmptyDictionary<TKey, TValue>()
     {
-        return EmptyObjectDictionary as Dictionary<TKey, TValue> ?? new Dictionary<TKey, TValue>();
+        return new Dictionary<TKey, TValue>() ?? EmptyObjectDictionary as Dictionary<TKey, TValue>;
     }
 

[Killed] Block removal mutation
Core/Commons/Extensions/DictionaryExtensions.cs:16:5
     }
 
     public static IReadOnlyDictionary<TKey, TValue> Empty<TKey, TValue>()
-    {
-        return new ReadOnlyDictionary<TKey, TValue>(GetEmptyDictionary<TKey, TValue>());
-    }
+    {}
 
     /*
killedBy: UnitTest.Core.Commons.Extensions.DictionaryExtensionsTest.SuccessfulToReturnsAnAppropriateTypeOfEmptyDictionary

[Killed] Null coalescing mutation (remove left)
Core/Commons/Extensions/DictionaryExtensions.cs:25:16
      */
     public static IDictionary<TKey, TValue> AsEmptyIfNull<TKey, TValue>(this IDictionary<TKey, TValue> dictionary)
     {
-        return dictionary ?? new Dictionary<TKey, TValue>();
+        return dictionary;
     }
 }
killedBy: UnitTest.Core.Commons.Extensions.DictionaryExtensionsTest.SuccessfulToReturnsAnEmptyDictionaryIfTheDictionaryIsNull

[Survived] Null coalescing mutation (left to right)
Core/Commons/Extensions/DictionaryExtensions.cs:25:16
      */
     public static IDictionary<TKey, TValue> AsEmptyIfNull<TKey, TValue>(this IDictionary<TKey, TValue> dictionary)
     {
-        return dictionary ?? new Dictionary<TKey, TValue>();
+        return new Dictionary<TKey, TValue>() ?? dictionary;
     }
 }
