[Killed] Statement mutation
Core/Commons/Extensions/JsonExtensions.cs:21:9
     {
         using MemoryStream stream = new MemoryStream();
         Utf8JsonWriter writer = new Utf8JsonWriter(stream, jsonWriterOptions);
-        jsonDocument.WriteTo(writer);
+        ;
         writer.Flush();
         return Encoding.UTF8.GetString(stream.ToArray());
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToWriteJsonAsString; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToWriteJsonAsIndentedString

[Killed] Statement mutation
Core/Commons/Extensions/JsonExtensions.cs:22:9
         using MemoryStream stream = new MemoryStream();
         Utf8JsonWriter writer = new Utf8JsonWriter(stream, jsonWriterOptions);
         jsonDocument.WriteTo(writer);
-        writer.Flush();
+        ;
         return Encoding.UTF8.GetString(stream.ToArray());
     }
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToWriteJsonAsString; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToWriteJsonAsIndentedString

[Killed] Statement mutation
Core/Commons/Extensions/JsonExtensions.cs:32:13
 
         using (Utf8JsonWriter writer = new Utf8JsonWriter(bufferWriter))
         {
-            jsonElement.WriteTo(writer);
+            ;
         }
 
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToDeserializeJsonElement

[Killed] Negate expression
Core/Commons/Extensions/JsonExtensions.cs:40:16
 
     public static JsonElement SelectToken(this JsonElement jsonElement, string path)
     {
-        while (true)
+        while (!(true))
         {
             if (string.IsNullOrEmpty(path)) return jsonElement;
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Boolean mutation
Core/Commons/Extensions/JsonExtensions.cs:40:16
 
     public static JsonElement SelectToken(this JsonElement jsonElement, string path)
     {
-        while (true)
+        while (false)
         {
             if (string.IsNullOrEmpty(path)) return jsonElement;
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Negate expression
Core/Commons/Extensions/JsonExtensions.cs:42:17
     {
         while (true)
         {
-            if (string.IsNullOrEmpty(path)) return jsonElement;
+            if (!(string.IsNullOrEmpty(path))) return jsonElement;
             string propertyName = path.SubstringAfter(".").SubstringBefore(".");
             string indexAsString = propertyName.SubstringAfter("[").SubstringBefore("]");
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] String mutation
Core/Commons/Extensions/JsonExtensions.cs:42:17
     {
         while (true)
         {
-            if (string.IsNullOrEmpty(path)) return jsonElement;
+            if ((path!=null)) return jsonElement;
             string propertyName = path.SubstringAfter(".").SubstringBefore(".");
             string indexAsString = propertyName.SubstringAfter("[").SubstringBefore("]");
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] String mutation
Core/Commons/Extensions/JsonExtensions.cs:43:76
         while (true)
         {
             if (string.IsNullOrEmpty(path)) return jsonElement;
-            string propertyName = path.SubstringAfter(".").SubstringBefore(".");
+            string propertyName = path.SubstringAfter(".").SubstringBefore("");
             string indexAsString = propertyName.SubstringAfter("[").SubstringBefore("]");
             if (string.IsNullOrEmpty(indexAsString))
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Negate expression
Core/Commons/Extensions/JsonExtensions.cs:45:17
             if (string.IsNullOrEmpty(path)) return jsonElement;
             string propertyName = path.SubstringAfter(".").SubstringBefore(".");
             string indexAsString = propertyName.SubstringAfter("[").SubstringBefore("]");
-            if (string.IsNullOrEmpty(indexAsString))
+            if (!(string.IsNullOrEmpty(indexAsString)))
             {
                 jsonElement = jsonElement.GetProperty(propertyName);
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] String mutation
Core/Commons/Extensions/JsonExtensions.cs:45:17
             if (string.IsNullOrEmpty(path)) return jsonElement;
             string propertyName = path.SubstringAfter(".").SubstringBefore(".");
             string indexAsString = propertyName.SubstringAfter("[").SubstringBefore("]");
-            if (string.IsNullOrEmpty(indexAsString))
+            if ((indexAsString!=""))
             {
                 jsonElement = jsonElement.GetProperty(propertyName);
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Block removal mutation
Core/Commons/Extensions/JsonExtensions.cs:46:13
             string propertyName = path.SubstringAfter(".").SubstringBefore(".");
             string indexAsString = propertyName.SubstringAfter("[").SubstringBefore("]");
             if (string.IsNullOrEmpty(indexAsString))
-            {
-                jsonElement = jsonElement.GetProperty(propertyName);
-            }
+            {}
             else
             {
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectSpecificToken

[Killed] Block removal mutation
Core/Commons/Extensions/JsonExtensions.cs:50:13
                 jsonElement = jsonElement.GetProperty(propertyName);
             }
             else
-            {
-                int searchedIndex = Convert.ToInt32(indexAsString);
-                jsonElement = GetPropertyAtIndex(jsonElement, propertyName, searchedIndex);
-            }
+            {}
 
             path = path.SubstringAfter(propertyName);
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] String mutation
Core/Commons/Extensions/JsonExtensions.cs:61:65
 
     private static JsonElement GetPropertyAtIndex(JsonElement jsonElement, string propertyName, int searchedIndex)
     {
-        string arrayPropertyName = propertyName.SubstringBefore("[");
+        string arrayPropertyName = propertyName.SubstringBefore("");
         JsonElement.ArrayEnumerator arrayEnumerator = jsonElement.GetProperty(arrayPropertyName).EnumerateArray();
         int maxIndex = arrayEnumerator.Count() - 1;
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Arithmetic mutation
Core/Commons/Extensions/JsonExtensions.cs:63:24
     {
         string arrayPropertyName = propertyName.SubstringBefore("[");
         JsonElement.ArrayEnumerator arrayEnumerator = jsonElement.GetProperty(arrayPropertyName).EnumerateArray();
-        int maxIndex = arrayEnumerator.Count() - 1;
+        int maxIndex = arrayEnumerator.Count() + 1;
         ValidateSearchedIndex(searchedIndex, maxIndex, arrayPropertyName);
         return arrayEnumerator.ElementAt(searchedIndex);
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax

[Killed] Statement mutation
Core/Commons/Extensions/JsonExtensions.cs:64:9
         string arrayPropertyName = propertyName.SubstringBefore("[");
         JsonElement.ArrayEnumerator arrayEnumerator = jsonElement.GetProperty(arrayPropertyName).EnumerateArray();
         int maxIndex = arrayEnumerator.Count() - 1;
-        ValidateSearchedIndex(searchedIndex, maxIndex, arrayPropertyName);
+        ;
         return arrayEnumerator.ElementAt(searchedIndex);
     }
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero

[Killed] Equality mutation
Core/Commons/Extensions/JsonExtensions.cs:70:13
 
     private static void ValidateSearchedIndex(int searchedIndex, int maxIndex, string arrayPropertyName)
     {
-        if (searchedIndex < 0)
+        if (searchedIndex <= 0)
         {
             throw new ArgumentException($"The index {searchedIndex} is invalid.");
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Equality mutation
Core/Commons/Extensions/JsonExtensions.cs:70:13
 
     private static void ValidateSearchedIndex(int searchedIndex, int maxIndex, string arrayPropertyName)
     {
-        if (searchedIndex < 0)
+        if (searchedIndex > 0)
         {
             throw new ArgumentException($"The index {searchedIndex} is invalid.");
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero

[Killed] Statement mutation
Core/Commons/Extensions/JsonExtensions.cs:72:13
     {
         if (searchedIndex < 0)
         {
-            throw new ArgumentException($"The index {searchedIndex} is invalid.");
+            ;
         }
 
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero

[Killed] String mutation
Core/Commons/Extensions/JsonExtensions.cs:72:41
     {
         if (searchedIndex < 0)
         {
-            throw new ArgumentException($"The index {searchedIndex} is invalid.");
+            throw new ArgumentException($"");
         }
 
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero

[Killed] Equality mutation
Core/Commons/Extensions/JsonExtensions.cs:75:13
             throw new ArgumentException($"The index {searchedIndex} is invalid.");
         }
 
-        if (searchedIndex > maxIndex)
+        if (searchedIndex >= maxIndex)
         {
             throw new ArgumentException($"The index {searchedIndex} is out of range of '{arrayPropertyName}' array. The max index is {maxIndex}.");
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Negate expression
Core/Commons/Extensions/JsonExtensions.cs:75:13
             throw new ArgumentException($"The index {searchedIndex} is invalid.");
         }
 
-        if (searchedIndex > maxIndex)
+        if (!(searchedIndex > maxIndex))
         {
             throw new ArgumentException($"The index {searchedIndex} is out of range of '{arrayPropertyName}' array. The max index is {maxIndex}.");
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Statement mutation
Core/Commons/Extensions/JsonExtensions.cs:77:13
 
         if (searchedIndex > maxIndex)
         {
-            throw new ArgumentException($"The index {searchedIndex} is out of range of '{arrayPropertyName}' array. The max index is {maxIndex}.");
+            ;
         }
     }
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax

[Killed] String mutation
Core/Commons/Extensions/JsonExtensions.cs:77:41
 
         if (searchedIndex > maxIndex)
         {
-            throw new ArgumentException($"The index {searchedIndex} is out of range of '{arrayPropertyName}' array. The max index is {maxIndex}.");
+            throw new ArgumentException($"");
         }
     }
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax
