[Killed] Equality mutation
Core/Commons/Extensions/StringExtensions.cs:20:21
     */
     public static string SubstringBefore(this string text, string stopAt)
     {
-        if (text is null) return null;
+        if (text is not null) return null;
         if (stopAt is null) return text;
         int charLocation = text.IndexOf(stopAt, StringComparison.Ordinal);
killedBy: UnitTest.Core.Commons.TestCaseDisplayNameComplianceTest.SuccessfulToValidateIfMethodNameAndDisplayNameMatch; UnitTest.Core.Commons.TestCaseDisplayNameComplianceTest.SuccessfulToValidateIfMethodNameAndDisplayNameMatch

[Killed] Equality mutation
Core/Commons/Extensions/StringExtensions.cs:21:23
     public static string SubstringBefore(this string text, string stopAt)
     {
         if (text is null) return null;
-        if (stopAt is null) return text;
+        if (stopAt is not null) return text;
         int charLocation = text.IndexOf(stopAt, StringComparison.Ordinal);
         return charLocation == IndexNotFound ? text : text[..charLocation];
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheFirstSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheFirstSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheFirstSeparatorOccurrence

[Killed] Equality mutation
Core/Commons/Extensions/StringExtensions.cs:23:16
         if (text is null) return null;
         if (stopAt is null) return text;
         int charLocation = text.IndexOf(stopAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? text : text[..charLocation];
+        return charLocation != IndexNotFound ? text : text[..charLocation];
     }
 
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheFirstSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheFirstSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheFirstSeparatorOccurrence

[Killed] Equality mutation
Core/Commons/Extensions/StringExtensions.cs:39:16
         if (text is null) return null;
         if (stopAt is null) return text;
         int charLocation = text.LastIndexOf(stopAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? text : text[..charLocation];
+        return charLocation != IndexNotFound ? text : text[..charLocation];
     }
 
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheLastSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheLastSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheLastSeparatorOccurrence

[Killed] Logical mutation
Core/Commons/Extensions/StringExtensions.cs:51:13
     */
     public static string SubstringAfter(this string text, string startAt)
     {
-        if (string.IsNullOrEmpty(text) || (string.IsNullOrEmpty(startAt))) return text;
+        if (string.IsNullOrEmpty(text) && (string.IsNullOrEmpty(startAt))) return text;
         int charLocation = text.IndexOf(startAt, StringComparison.Ordinal);
         return charLocation == IndexNotFound ? string.Empty : text[(charLocation + startAt.Length)..];
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringAfterTheFirstSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringAfterTheFirstSeparatorOccurrence

[Killed] Negate expression
Core/Commons/Extensions/StringExtensions.cs:51:13
     */
     public static string SubstringAfter(this string text, string startAt)
     {
-        if (string.IsNullOrEmpty(text) || (string.IsNullOrEmpty(startAt))) return text;
+        if (!(string.IsNullOrEmpty(text) || (string.IsNullOrEmpty(startAt)))) return text;
         int charLocation = text.IndexOf(startAt, StringComparison.Ordinal);
         return charLocation == IndexNotFound ? string.Empty : text[(charLocation + startAt.Length)..];
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Equality mutation
Core/Commons/Extensions/StringExtensions.cs:53:16
     {
         if (string.IsNullOrEmpty(text) || (string.IsNullOrEmpty(startAt))) return text;
         int charLocation = text.IndexOf(startAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? string.Empty : text[(charLocation + startAt.Length)..];
+        return charLocation != IndexNotFound ? string.Empty : text[(charLocation + startAt.Length)..];
     }
 
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Arithmetic mutation
Core/Commons/Extensions/StringExtensions.cs:53:69
     {
         if (string.IsNullOrEmpty(text) || (string.IsNullOrEmpty(startAt))) return text;
         int charLocation = text.IndexOf(startAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? string.Empty : text[(charLocation + startAt.Length)..];
+        return charLocation == IndexNotFound ? string.Empty : text[(charLocation - startAt.Length)..];
     }
 
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Arithmetic mutation
Core/Commons/Extensions/StringExtensions.cs:67:69
     {
         if (string.IsNullOrEmpty(text) || (string.IsNullOrEmpty(startAt))) return text;
         int charLocation = text.LastIndexOf(startAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? string.Empty : text[(charLocation + startAt.Length)..];
+        return charLocation == IndexNotFound ? string.Empty : text[(charLocation - startAt.Length)..];
     }
 
killedBy: UnitTest.Core.Commons.TestCaseDisplayNameComplianceTest.SuccessfulToValidateIfMethodNameAndDisplayNameMatch; UnitTest.Core.Commons.TestCaseDisplayNameComplianceTest.SuccessfulToValidateIfMethodNameAndDisplayNameMatch

[Killed] Equality mutation
Core/Commons/Extensions/StringExtensions.cs:67:16
     {
         if (string.IsNullOrEmpty(text) || (string.IsNullOrEmpty(startAt))) return text;
         int charLocation = text.LastIndexOf(startAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? string.Empty : text[(charLocation + startAt.Length)..];
+        return charLocation != IndexNotFound ? string.Empty : text[(charLocation + startAt.Length)..];
     }
 
killedBy: UnitTest.Core.Commons.TestCaseDisplayNameComplianceTest.SuccessfulToValidateIfMethodNameAndDisplayNameMatch; UnitTest.Core.Commons.TestCaseDisplayNameComplianceTest.SuccessfulToValidateIfMethodNameAndDisplayNameMatch

[Killed] Logical mutation
Core/Commons/Extensions/StringExtensions.cs:79:13
         */
     public static string AppendIfMissing(this string text, string suffix, bool ignoreCase = false)
     {
-        if (text == null || string.IsNullOrEmpty(suffix) || text.EndsWith(suffix, ignoreCase, CultureInfo.InvariantCulture))
+        if (text == null && string.IsNullOrEmpty(suffix) || text.EndsWith(suffix, ignoreCase, CultureInfo.InvariantCulture))
         {
             return text;
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToAppendSuffixIfMissing; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToAppendSuffixIfMissing

[Killed] Negate expression
Core/Commons/Extensions/StringExtensions.cs:79:13
         */
     public static string AppendIfMissing(this string text, string suffix, bool ignoreCase = false)
     {
-        if (text == null || string.IsNullOrEmpty(suffix) || text.EndsWith(suffix, ignoreCase, CultureInfo.InvariantCulture))
+        if (!(text == null || string.IsNullOrEmpty(suffix) || text.EndsWith(suffix, ignoreCase, CultureInfo.InvariantCulture)))
         {
             return text;
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToAppendSuffixIfMissing; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToAppendSuffixIfMissing; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToAppendSuffixIfMissing

[Killed] Block removal mutation
Core/Commons/Extensions/StringExtensions.cs:80:9
     public static string AppendIfMissing(this string text, string suffix, bool ignoreCase = false)
     {
         if (text == null || string.IsNullOrEmpty(suffix) || text.EndsWith(suffix, ignoreCase, CultureInfo.InvariantCulture))
-        {
-            return text;
-        }
+        {}
 
         return $"{text}{suffix}";
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToAppendSuffixIfMissing; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToAppendSuffixIfMissing; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToAppendSuffixIfMissing

[Killed] Equality mutation
Core/Commons/Extensions/StringExtensions.cs:97:13
      */
     public static string Truncate(this string text, int maxLength)
     {
-        if (maxLength < 0)
+        if (maxLength <= 0)
         {
             throw new ArgumentException("Max width must be greater than or equal to zero.");
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString

[Killed] Negate expression
Core/Commons/Extensions/StringExtensions.cs:97:13
      */
     public static string Truncate(this string text, int maxLength)
     {
-        if (maxLength < 0)
+        if (!(maxLength < 0))
         {
             throw new ArgumentException("Max width must be greater than or equal to zero.");
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString

[Killed] Statement mutation
Core/Commons/Extensions/StringExtensions.cs:99:13
     {
         if (maxLength < 0)
         {
-            throw new ArgumentException("Max width must be greater than or equal to zero.");
+            ;
         }
 
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.FailToTruncateString

[Killed] String mutation
Core/Commons/Extensions/StringExtensions.cs:99:41
     {
         if (maxLength < 0)
         {
-            throw new ArgumentException("Max width must be greater than or equal to zero.");
+            throw new ArgumentException("");
         }
 
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.FailToTruncateString

[Killed] Equality mutation
Core/Commons/Extensions/StringExtensions.cs:102:21
             throw new ArgumentException("Max width must be greater than or equal to zero.");
         }
 
-        if (text is null || text.Length <= maxLength)
+        if (text is not null || text.Length <= maxLength)
         {
             return text;
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString

[Killed] Negate expression
Core/Commons/Extensions/StringExtensions.cs:102:13
             throw new ArgumentException("Max width must be greater than or equal to zero.");
         }
 
-        if (text is null || text.Length <= maxLength)
+        if (!(text is null || text.Length <= maxLength))
         {
             return text;
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString

[Killed] Block removal mutation
Core/Commons/Extensions/StringExtensions.cs:103:9
         }
 
         if (text is null || text.Length <= maxLength)
-        {
-            return text;
-        }
+        {}
 
         return text[..maxLength];
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToTruncateString
