[Killed] Block removal mutation
querystring-composer-api-netcore/Core/Commons/GetDateTime.cs:8:5
 public sealed class GetDateTime : IGetDateTime
 {
     public DateTime Now()
-    {
-        return DateTime.Now;
-    }
+    {}
 
     public DateTime UtcNow()
killedBy: UnitTest.Core.Commons.GetDateTimeTest.SuccessfulToGetCurrentDateAndTime

[Killed] Block removal mutation
querystring-composer-api-netcore/Core/Commons/GetDateTime.cs:13:5
     }
 
     public DateTime UtcNow()
-    {
-        return DateTime.UtcNow;
-    }
+    {}
 }
killedBy: UnitTest.Core.Commons.GetDateTimeTest.SuccessfulToGetCurrentUtcDateAndTime
