[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/JsonSchemaValidator.cs:20:9
 
         IList<FieldError> fieldErrors = new List<FieldError>();
 
-        AddAllErrors(GetMissingFieldsErrors(jObject, jSchema), fieldErrors);
+        ;
         AddAllErrors(GetExtraFieldsErrors(jObject, jSchema), fieldErrors);
         AddAllErrors(GetWrongTypeFieldsErrors(jObject, jSchema), fieldErrors);
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/JsonSchemaValidator.cs:21:9
         IList<FieldError> fieldErrors = new List<FieldError>();
 
         AddAllErrors(GetMissingFieldsErrors(jObject, jSchema), fieldErrors);
-        AddAllErrors(GetExtraFieldsErrors(jObject, jSchema), fieldErrors);
+        ;
         AddAllErrors(GetWrongTypeFieldsErrors(jObject, jSchema), fieldErrors);
 
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/JsonSchemaValidator.cs:22:9
 
         AddAllErrors(GetMissingFieldsErrors(jObject, jSchema), fieldErrors);
         AddAllErrors(GetExtraFieldsErrors(jObject, jSchema), fieldErrors);
-        AddAllErrors(GetWrongTypeFieldsErrors(jObject, jSchema), fieldErrors);
+        ;
 
         return fieldErrors;
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToMatchFieldType

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/JsonSchemaValidator.cs:31:13
     {
         foreach (FieldError fieldError in CollectionsMarshal.AsSpan(sourceList))
         {
-            targetList.Add(fieldError);
+            ;
         }
     }
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema; UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToMatchFieldType

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
querystring-composer-api-netcore/Core/Commons/JsonSchemaValidator.cs:40:19
         return
         (
             from keyValuePair in jSchema.Properties
-            where !jObject.ContainsKey(keyValuePair.Key)
+            where jObject.ContainsKey(keyValuePair.Key)
             select new FieldError
             {
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema; UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToMatchFieldType; UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToValidateJsonAgainstTheSchema

[Killed] String mutation
querystring-composer-api-netcore/Core/Commons/JsonSchemaValidator.cs:44:32
             select new FieldError
             {
                 PropertyName = keyValuePair.Key,
-                ErrorMessage = "CommonJsonPropertyMissing"
+                ErrorMessage = ""
             }
         ).ToList();
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
querystring-composer-api-netcore/Core/Commons/JsonSchemaValidator.cs:53:19
     {
         return (
             from property in jObject.Properties()
-            where !jSchema.Properties.ContainsKey(property.Name)
+            where jSchema.Properties.ContainsKey(property.Name)
             select new FieldError
             {
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema; UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToMatchFieldType; UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToValidateJsonAgainstTheSchema

[Killed] Object initializer mutation
querystring-composer-api-netcore/Core/Commons/JsonSchemaValidator.cs:54:20
         return (
             from property in jObject.Properties()
             where !jSchema.Properties.ContainsKey(property.Name)
-            select new FieldError
-            {
-                PropertyName = property.Name,
-                AttemptedValue = property.Value.ToString(),
-                ErrorMessage = "CommonJsonPropertyInvalid"
-            }
+            select new FieldError
+{}
         ).ToList();
     }
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToValidateJsonAgainstTheSchema

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/JsonSchemaValidator.cs:67:9
     {
         IList<ValidationError> schemaErrors = new List<ValidationError>();
 
-        jObject.Validate(jSchema, (_, args) => schemaErrors.Add(args.ValidationError));
+        ;
 
         IList<FieldError> fieldErrors =
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToMatchFieldType

[Killed] String mutation
querystring-composer-api-netcore/Core/Commons/JsonSchemaValidator.cs:95:28
         {
             PropertyName = validationError.Path,
             AttemptedValue = attemptedValue,
-            ErrorMessage = "CommonJsonPropertyWrongType"
+            ErrorMessage = ""
         };
     }
killedBy: UnitTest.Core.Commons.JsonSchemaValidatorTest.SuccessfulToListFieldErrorsIfFailToMatchFieldType
