[Killed] Block removal mutation
Core/Commons/Models/Range.cs:18:5
     }
 
     public static Range<T> Of(T from, T to)
-    {
-        return new Range<T>(from, to);
-    }
+    {}
 
     [ExcludeFromCodeCoverage]
killedBy: UnitTest.Core.Commons.Models.RangeTests.ShouldReturnEqualRangesIfSameFromAndToValues; UnitTest.Core.Commons.Models.RangeTests.GetHashCode_ShouldReturnSameHashForEqualRanges

[Killed] Block removal mutation
Core/Commons/Models/Range.cs:52:5
     }
 
     public static bool operator ==(Range<T> left, Range<T> right)
-    {
-        return left.Equals(right);
-    }
+    {}
 
     public static bool operator !=(Range<T> left, Range<T> right)
killedBy: UnitTest.Core.Commons.Models.RangeTests.OperatorEquality_ShouldReturnCorrectEqualityResult; UnitTest.Core.Commons.Models.RangeTests.OperatorInequality_ShouldReturnCorrectInequalityResult

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Commons/Models/Range.cs:58:16
 
     public static bool operator !=(Range<T> left, Range<T> right)
     {
-        return !(left == right);
+        return (left == right);
     }
 }
killedBy: UnitTest.Core.Commons.Models.RangeTests.OperatorInequality_ShouldReturnCorrectInequalityResult

[Timeout] Equality mutation
Core/Commons/Models/Range.cs:58:18
 
     public static bool operator !=(Range<T> left, Range<T> right)
     {
-        return !(left == right);
+        return !(left != right);
     }
 }
