[Killed] Equality mutation
querystring-composer-api-netcore/Core/Commons/Optional.cs:19:25
 
     public static Optional<T> Of([AllowNull] T value)
     {
-        return value is null ? Empty() : new Optional<T>(value);
+        return value is not null ? Empty() : new Optional<T>(value);
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToGetValueIfOptionalContainsContent; UnitTest.Core.Commons.OptionalTest.SuccessToMapAnOptionalToAnotherOptionalOfDifferentInnerTypes

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/Optional.cs:24:13
 
     public T GetValue()
     {
-        if (HasValue()) return _value;
+        if (!(HasValue())) return _value;
         throw new InvalidOperationException("No value present");
     }
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/Optional.cs:25:9
     public T GetValue()
     {
         if (HasValue()) return _value;
-        throw new InvalidOperationException("No value present");
+        ;
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.FailToGetValueIfOptionalHasNoContent

[Killed] String mutation
querystring-composer-api-netcore/Core/Commons/Optional.cs:25:45
     public T GetValue()
     {
         if (HasValue()) return _value;
-        throw new InvalidOperationException("No value present");
+        throw new InvalidOperationException("");
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.FailToGetValueIfOptionalHasNoContent

[Killed] Equality mutation
querystring-composer-api-netcore/Core/Commons/Optional.cs:30:26
 
     public bool HasValue()
     {
-        return _value is not null;
+        return _value is null;
     }
 
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/Optional.cs:35:13
 
     public void HasValue(Action<T> method)
     {
-        if (HasValue()) method.Invoke(_value);
+        if (!(HasValue())) method.Invoke(_value);
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.FailToPerformAMethodWithParametersIfTheOptionalHasNoContent; UnitTest.Core.Commons.OptionalTest.SuccessfulToPerformAMethodWithParametersIfTheOptionalHasContent

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/Optional.cs:35:25
 
     public void HasValue(Action<T> method)
     {
-        if (HasValue()) method.Invoke(_value);
+        if (HasValue()) ;
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToPerformAMethodWithParametersIfTheOptionalHasContent

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/Optional.cs:40:13
 
     public void HasValue(Func<object> method)
     {
-        if (HasValue()) method.Invoke();
+        if (!(HasValue())) method.Invoke();
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToPerformAMethodIfTheOptionalHasContent

[Killed] Statement mutation
querystring-composer-api-netcore/Core/Commons/Optional.cs:40:25
 
     public void HasValue(Func<object> method)
     {
-        if (HasValue()) method.Invoke();
+        if (HasValue()) ;
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToPerformAMethodIfTheOptionalHasContent

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/Optional.cs:45:16
 
     public T OrElse(T other)
     {
-        return HasValue() ? _value : other;
+        return !(HasValue() ) ? _value : other;
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToGetValueIfOptionalContainsContentIgnoringAlternative; UnitTest.Core.Commons.OptionalTest.SuccessfulToReturnsAnAlternativeIfOptionalHasNoContent

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/Optional.cs:50:16
 
     public T OrElseGet(Func<T> method)
     {
-        return HasValue() ? _value : method.Invoke();
+        return !(HasValue() ) ? _value : method.Invoke();
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToGetValueIfOptionalContainsContentIgnoringAlternative; UnitTest.Core.Commons.OptionalTest.SuccessfulToReturnsAnAlternativeIfOptionalHasNoContentUsingLambda

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/Optional.cs:55:16
 
     public T OrElseThrow(Func<Exception> method)
     {
-        return HasValue() ? _value : throw method.Invoke();
+        return !(HasValue() ) ? _value : throw method.Invoke();
     }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
querystring-composer-api-netcore/Core/Commons/Optional.cs:60:16
 
     public Optional<TU> Map<TU>(Func<T, TU> method)
     {
-        return HasValue() ? new Optional<TU>(method.Invoke(_value)) : default;
+        return !(HasValue() ) ? new Optional<TU>(method.Invoke(_value)) : default;
     }
 }
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessToMapAnOptionalToAnotherOptionalOfDifferentInnerTypes; UnitTest.Core.Commons.OptionalTest.SuccessToMapAnEmptyOptionalToAnotherEmptyOptionalOfDifferentInnerTypes
