[Survived] Statement mutation
querystring-composer-api-netcore/Core/Commons/RandomNumberGenerator.cs:13:9
         using RandomNumberGenerator randomGenerator = RandomNumberGenerator.Create();
 
         byte[] randomBytes = new byte[4];
-        randomGenerator.GetBytes(randomBytes);
+        ;
 
         int randomNumber = BitConverter.ToInt32(randomBytes, 0) % 100 + 1;

[Survived] Arithmetic mutation
querystring-composer-api-netcore/Core/Commons/RandomNumberGenerator.cs:15:28
         byte[] randomBytes = new byte[4];
         randomGenerator.GetBytes(randomBytes);
 
-        int randomNumber = BitConverter.ToInt32(randomBytes, 0) % 100 + 1;
+        int randomNumber = BitConverter.ToInt32(randomBytes, 0) % 100 - 1;
 
         int scaledNumber = (int) Math.Floor((max - min + 1) * (randomNumber / (double) int.MaxValue)) + min;

[Survived] Arithmetic mutation
querystring-composer-api-netcore/Core/Commons/RandomNumberGenerator.cs:15:28
         byte[] randomBytes = new byte[4];
         randomGenerator.GetBytes(randomBytes);
 
-        int randomNumber = BitConverter.ToInt32(randomBytes, 0) % 100 + 1;
+        int randomNumber = BitConverter.ToInt32(randomBytes, 0) * 100 + 1;
 
         int scaledNumber = (int) Math.Floor((max - min + 1) * (randomNumber / (double) int.MaxValue)) + min;

[Survived] Arithmetic mutation
querystring-composer-api-netcore/Core/Commons/RandomNumberGenerator.cs:17:64
 
         int randomNumber = BitConverter.ToInt32(randomBytes, 0) % 100 + 1;
 
-        int scaledNumber = (int) Math.Floor((max - min + 1) * (randomNumber / (double) int.MaxValue)) + min;
+        int scaledNumber = (int) Math.Floor((max - min + 1) * (randomNumber * (double) int.MaxValue)) + min;
 
         return Math.Min(max, Math.Max(min, scaledNumber));

[Survived] Arithmetic mutation
querystring-composer-api-netcore/Core/Commons/RandomNumberGenerator.cs:17:46
 
         int randomNumber = BitConverter.ToInt32(randomBytes, 0) % 100 + 1;
 
-        int scaledNumber = (int) Math.Floor((max - min + 1) * (randomNumber / (double) int.MaxValue)) + min;
+        int scaledNumber = (int) Math.Floor((max + min + 1) * (randomNumber / (double) int.MaxValue)) + min;
 
         return Math.Min(max, Math.Max(min, scaledNumber));

[Killed] Linq method mutation (Max() to Min())
querystring-composer-api-netcore/Core/Commons/RandomNumberGenerator.cs:19:30
 
         int scaledNumber = (int) Math.Floor((max - min + 1) * (randomNumber / (double) int.MaxValue)) + min;
 
-        return Math.Min(max, Math.Max(min, scaledNumber));
+        return Math.Min(max, Math.Min(min, scaledNumber));
     }
 }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.FailToBuildQueryStringWhenQueryStructureHaveItemsAndEntriesButNoKeywords

[Survived] Linq method mutation (Min() to Max())
querystring-composer-api-netcore/Core/Commons/RandomNumberGenerator.cs:19:16
 
         int scaledNumber = (int) Math.Floor((max - min + 1) * (randomNumber / (double) int.MaxValue)) + min;
 
-        return Math.Min(max, Math.Max(min, scaledNumber));
+        return Math.Max(max, Math.Max(min, scaledNumber));
     }
 }
