[Killed] Statement mutation
Domains/Clients/Commands/RegisterClientCommand.cs:21:9
         Uid = uid;
         Name = name;
         Description = description;
-        Validator.ValidateAndThrow(this);
+        ;
     }
     
killedBy: UnitTest.Core.Domains.Clients.Commands.RegisterClientCommandTest.FailToRegisterClientWithNullParameters
