[Killed] Statement mutation
Domains/Clients/Commands/RegisterClientCommandValidator.cs:9:9
 {
     public RegisterClientCommandValidator()
     {
-        RuleFor(command => command.Uid)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationClientUidIsNullOrEmpty");
+        ;
 
         RuleFor(command => command.Name)
killedBy: UnitTest.Core.Domains.Clients.Commands.RegisterClientCommandTest.FailToRegisterClientWithNullParameters

[Killed] Statement mutation
Domains/Clients/Commands/RegisterClientCommandValidator.cs:14:9
             .NotEmpty()
             .WithMessage("ValidationClientUidIsNullOrEmpty");
 
-        RuleFor(command => command.Name)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationNameIsNullOrEmpty");
+        ;
 
         RuleFor(command => command.Description)
killedBy: UnitTest.Core.Domains.Clients.Commands.RegisterClientCommandTest.FailToRegisterClientWithNullParameters

[Killed] Statement mutation
Domains/Clients/Commands/RegisterClientCommandValidator.cs:19:9
             .NotEmpty()
             .WithMessage("ValidationNameIsNullOrEmpty");
 
-        RuleFor(command => command.Description)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationDescriptionIsNullOrEmpty");
+        ;
     }
 }
killedBy: UnitTest.Core.Domains.Clients.Commands.RegisterClientCommandTest.FailToRegisterClientWithNullParameters
