[Killed] Block removal mutation
Domains/Clients/UseCases/RegisterClientUseCase.cs:16:5
     private readonly IGetDateTime _getDateTime;
     
     public RegisterClientUseCase(IServiceResolver serviceResolver)
-    {
-        ArgumentValidator.CheckNull(serviceResolver, nameof(serviceResolver));
-        _registerClientGateway = serviceResolver.Resolve<IRegisterClientGateway>();
-        _getDateTime = serviceResolver.Resolve<IGetDateTime>();
-    }
+    {}
     
     public async Task<Client> ExecuteAsync(RegisterClientCommand command)
killedBy: UnitTest.Core.Domains.Clients.UseCases.RegisterClientUseCaseTest.SuccessToRegisterClient
