[Killed] Statement mutation
Domains/QueryStrings/Commands/BuildQueryStringCommand.cs:21:9
         ClientUid = clientUid;
         QueryName = queryName;
         SearchTerms = searchTerms;
-        Validator.ValidateAndThrow(this);
+        ;
     }
 
killedBy: UnitTest.Core.Domains.QueryStrings.Commands.BuildQueryStringCommandTest.FailToBuildQueryStringWhenParametersAreInvalid; UnitTest.Core.Domains.QueryStrings.Commands.BuildQueryStringCommandTest.FailToBuildQueryStringWhenParametersAreInvalid; UnitTest.Core.Domains.QueryStrings.Commands.BuildQueryStringCommandTest.FailToBuildQueryStringWhenParametersAreInvalid
