[Killed] Statement mutation
Domains/QueryStrings/Commands/BuildQueryStringCommandValidator.cs:9:9
 {
     public BuildQueryStringCommandValidator()
     {
-        RuleFor(command => command.ClientUid)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationClientUidIsNullOrEmpty");
+        ;
 
         RuleFor(command => command.QueryName)
killedBy: UnitTest.Core.Domains.QueryStrings.Commands.BuildQueryStringCommandTest.FailToBuildQueryStringWhenParametersAreInvalid; UnitTest.Core.Domains.QueryStrings.Commands.BuildQueryStringCommandTest.FailToBuildQueryStringWhenParametersAreInvalid

[Killed] Statement mutation
Domains/QueryStrings/Commands/BuildQueryStringCommandValidator.cs:14:9
             .NotEmpty()
             .WithMessage("ValidationClientUidIsNullOrEmpty");
 
-        RuleFor(command => command.QueryName)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationQueryNameIsNullOrEmpty");
+        ;
 
         RuleFor(command => command.SearchTerms)
killedBy: UnitTest.Core.Domains.QueryStrings.Commands.BuildQueryStringCommandTest.FailToBuildQueryStringWhenParametersAreInvalid; UnitTest.Core.Domains.QueryStrings.Commands.BuildQueryStringCommandTest.FailToBuildQueryStringWhenParametersAreInvalid

[Killed] Statement mutation
Domains/QueryStrings/Commands/BuildQueryStringCommandValidator.cs:19:9
             .NotEmpty()
             .WithMessage("ValidationQueryNameIsNullOrEmpty");
 
-        RuleFor(command => command.SearchTerms)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationSearchTermsIsNullOrEmpty");
+        ;
     }
 }
killedBy: UnitTest.Core.Domains.QueryStrings.Commands.BuildQueryStringCommandTest.FailToBuildQueryStringWhenParametersAreInvalid; UnitTest.Core.Domains.QueryStrings.Commands.BuildQueryStringCommandTest.FailToBuildQueryStringWhenParametersAreInvalid
