[Survived] String mutation
Domains/QueryStrings/Helpers/CharacterSubstitution.cs:10:64
 {
     private readonly Dictionary<string, double> _substitutions = new Dictionary<string, double>
     {
-        {"áaã", 0.5}, {"éê", 0.5}, {"íi", 0.5}, {"óoõ", 0.5}, {"úu", 0.5}, {"çc", 0.5},
+        {"áaã", 0.5}, {"éê", 0.5}, {"íi", 0.5}, {"óoõ", 0.5}, {"", 0.5}, {"çc", 0.5},
         {"âa", 0.5}, {"àa", 0.5}, {"èe", 0.5}, {"üu", 0.5}, {"ñn", 0.5}, {"äa", 0.5},
         {"ëe", 0.5}, {"öo", 0.5}, {"ßs", 0.5},

[Survived] String mutation
Domains/QueryStrings/Helpers/CharacterSubstitution.cs:10:37
 {
     private readonly Dictionary<string, double> _substitutions = new Dictionary<string, double>
     {
-        {"áaã", 0.5}, {"éê", 0.5}, {"íi", 0.5}, {"óoõ", 0.5}, {"úu", 0.5}, {"çc", 0.5},
+        {"áaã", 0.5}, {"éê", 0.5}, {"", 0.5}, {"óoõ", 0.5}, {"úu", 0.5}, {"çc", 0.5},
         {"âa", 0.5}, {"àa", 0.5}, {"èe", 0.5}, {"üu", 0.5}, {"ñn", 0.5}, {"äa", 0.5},
         {"ëe", 0.5}, {"öo", 0.5}, {"ßs", 0.5},

[Survived] String mutation
Domains/QueryStrings/Helpers/CharacterSubstitution.cs:11:10
     private readonly Dictionary<string, double> _substitutions = new Dictionary<string, double>
     {
         {"áaã", 0.5}, {"éê", 0.5}, {"íi", 0.5}, {"óoõ", 0.5}, {"úu", 0.5}, {"çc", 0.5},
-        {"âa", 0.5}, {"àa", 0.5}, {"èe", 0.5}, {"üu", 0.5}, {"ñn", 0.5}, {"äa", 0.5},
+        {"", 0.5}, {"àa", 0.5}, {"èe", 0.5}, {"üu", 0.5}, {"ñn", 0.5}, {"äa", 0.5},
         {"ëe", 0.5}, {"öo", 0.5}, {"ßs", 0.5},
     };

[Survived] String mutation
Domains/QueryStrings/Helpers/CharacterSubstitution.cs:11:36
     private readonly Dictionary<string, double> _substitutions = new Dictionary<string, double>
     {
         {"áaã", 0.5}, {"éê", 0.5}, {"íi", 0.5}, {"óoõ", 0.5}, {"úu", 0.5}, {"çc", 0.5},
-        {"âa", 0.5}, {"àa", 0.5}, {"èe", 0.5}, {"üu", 0.5}, {"ñn", 0.5}, {"äa", 0.5},
+        {"âa", 0.5}, {"àa", 0.5}, {"", 0.5}, {"üu", 0.5}, {"ñn", 0.5}, {"äa", 0.5},
         {"ëe", 0.5}, {"öo", 0.5}, {"ßs", 0.5},
     };

[Killed] Negate expression
Domains/QueryStrings/Helpers/CharacterSubstitution.cs:17:16
 
     public double Cost(char c1, char c2)
     {
-        return _substitutions.TryGetValue($"{c1}{c2}", out double substitution) ? substitution : 1.0;
+        return !(_substitutions.TryGetValue($"{c1}{c2}", out double substitution) ) ? substitution : 1.0;
     }
 }
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence
