[Killed] Equality mutation
Domains/QueryStrings/Helpers/GetSimilarityHelper.cs:16:13
         double distance = Levenshtein.Distance(word, term);
 
         // No changes needed. It means the words are equal
-        if (distance == 0) return 1;
+        if (distance != 0) return 1;
 
         // Get the maximum length between the two strings
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Linq method mutation (Max() to Min())
Domains/QueryStrings/Helpers/GetSimilarityHelper.cs:19:28
         if (distance == 0) return 1;
 
         // Get the maximum length between the two strings
-        double maxLength = Math.Max(word.Length, term.Length);
+        double maxLength = Math.Min(word.Length, term.Length);
 
         // Calculate similarity
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.GetSimilarityHelperTests.SuccessToGetSimilarity; UnitTest.Core.Domains.QueryStrings.Helpers.GetSimilarityHelperTests.SuccessToGetSimilarity; UnitTest.Core.Domains.QueryStrings.Helpers.GetSimilarityHelperTests.SuccessToGetSimilarity

[Killed] Arithmetic mutation
Domains/QueryStrings/Helpers/GetSimilarityHelper.cs:22:16
         double maxLength = Math.Max(word.Length, term.Length);
 
         // Calculate similarity
-        return 1.0 - distance / maxLength;
+        return 1.0 + distance / maxLength;
     }
 }
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.GetSimilarityHelperTests.SuccessToGetSimilarity; UnitTest.Core.Domains.QueryStrings.Helpers.GetSimilarityHelperTests.SuccessToGetSimilarity; UnitTest.Core.Domains.QueryStrings.Helpers.GetSimilarityHelperTests.SuccessToGetSimilarity

[Killed] Arithmetic mutation
Domains/QueryStrings/Helpers/GetSimilarityHelper.cs:22:22
         double maxLength = Math.Max(word.Length, term.Length);
 
         // Calculate similarity
-        return 1.0 - distance / maxLength;
+        return 1.0 - distance * maxLength;
     }
 }
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.GetSimilarityHelperTests.SuccessToGetSimilarity; UnitTest.Core.Domains.QueryStrings.Helpers.GetSimilarityHelperTests.SuccessToGetSimilarity; UnitTest.Core.Domains.QueryStrings.Helpers.GetSimilarityHelperTests.SuccessToGetSimilarity
