[Killed] Object initializer mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:7:81
 
 public static class NumberConverterHelper
 {
-    private static readonly Dictionary<string, long> WordToBasicNumberMapping = new Dictionary<string, long>
-    {
-        ["um"] = 1, ["dois"] = 2, ["três"] = 3, ["quatro"] = 4, ["cinco"] = 5, ["seis"] = 6, ["sete"] = 7, ["oito"] = 8, ["nove"] = 9, ["dez"] = 10,
-        ["onze"] = 11, ["doze"] = 12, ["treze"] = 13, ["catorze"] = 14, ["quinze"] = 15, ["dezesseis"] = 16, ["dezessete"] = 17, ["dezoito"] = 18, ["dezenove"] = 19,
-        ["vinte"] = 20, ["trinta"] = 30, ["quarenta"] = 40, ["cinquenta"] = 50, ["sessenta"] = 60, ["setenta"] = 70, ["oitenta"] = 80, ["noventa"] = 90,
-        ["cem"] = 100, ["cento"] = 100, ["duzentos"] = 200, ["trezentos"] = 300, ["quatrocentos"] = 400, ["quinhentos"] = 500, ["seiscentos"] = 600,
-        ["setecentos"] = 700, ["oitocentos"] = 800, ["novecentos"] = 900
-    };
+    private static readonly Dictionary<string, long> WordToBasicNumberMapping = new Dictionary<string, long>
+{};
 
     private static readonly Dictionary<string, long> WordToMultiplierMapping = new Dictionary<string, long>
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] String mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:9:109
 {
     private static readonly Dictionary<string, long> WordToBasicNumberMapping = new Dictionary<string, long>
     {
-        ["um"] = 1, ["dois"] = 2, ["três"] = 3, ["quatro"] = 4, ["cinco"] = 5, ["seis"] = 6, ["sete"] = 7, ["oito"] = 8, ["nove"] = 9, ["dez"] = 10,
+        ["um"] = 1, ["dois"] = 2, ["três"] = 3, ["quatro"] = 4, ["cinco"] = 5, ["seis"] = 6, ["sete"] = 7, [""] = 8, ["nove"] = 9, ["dez"] = 10,
         ["onze"] = 11, ["doze"] = 12, ["treze"] = 13, ["catorze"] = 14, ["quinze"] = 15, ["dezesseis"] = 16, ["dezessete"] = 17, ["dezoito"] = 18, ["dezenove"] = 19,
         ["vinte"] = 20, ["trinta"] = 30, ["quarenta"] = 40, ["cinquenta"] = 50, ["sessenta"] = 60, ["setenta"] = 70, ["oitenta"] = 80, ["noventa"] = 90,
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber

[Killed] String mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:9:10
 {
     private static readonly Dictionary<string, long> WordToBasicNumberMapping = new Dictionary<string, long>
     {
-        ["um"] = 1, ["dois"] = 2, ["três"] = 3, ["quatro"] = 4, ["cinco"] = 5, ["seis"] = 6, ["sete"] = 7, ["oito"] = 8, ["nove"] = 9, ["dez"] = 10,
+        [""] = 1, ["dois"] = 2, ["três"] = 3, ["quatro"] = 4, ["cinco"] = 5, ["seis"] = 6, ["sete"] = 7, ["oito"] = 8, ["nove"] = 9, ["dez"] = 10,
         ["onze"] = 11, ["doze"] = 12, ["treze"] = 13, ["catorze"] = 14, ["quinze"] = 15, ["dezesseis"] = 16, ["dezessete"] = 17, ["dezoito"] = 18, ["dezenove"] = 19,
         ["vinte"] = 20, ["trinta"] = 30, ["quarenta"] = 40, ["cinquenta"] = 50, ["sessenta"] = 60, ["setenta"] = 70, ["oitenta"] = 80, ["noventa"] = 90,
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber

[Survived] String mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:10:25
     private static readonly Dictionary<string, long> WordToBasicNumberMapping = new Dictionary<string, long>
     {
         ["um"] = 1, ["dois"] = 2, ["três"] = 3, ["quatro"] = 4, ["cinco"] = 5, ["seis"] = 6, ["sete"] = 7, ["oito"] = 8, ["nove"] = 9, ["dez"] = 10,
-        ["onze"] = 11, ["doze"] = 12, ["treze"] = 13, ["catorze"] = 14, ["quinze"] = 15, ["dezesseis"] = 16, ["dezessete"] = 17, ["dezoito"] = 18, ["dezenove"] = 19,
+        ["onze"] = 11, [""] = 12, ["treze"] = 13, ["catorze"] = 14, ["quinze"] = 15, ["dezesseis"] = 16, ["dezessete"] = 17, ["dezoito"] = 18, ["dezenove"] = 19,
         ["vinte"] = 20, ["trinta"] = 30, ["quarenta"] = 40, ["cinquenta"] = 50, ["sessenta"] = 60, ["setenta"] = 70, ["oitenta"] = 80, ["noventa"] = 90,
         ["cem"] = 100, ["cento"] = 100, ["duzentos"] = 200, ["trezentos"] = 300, ["quatrocentos"] = 400, ["quinhentos"] = 500, ["seiscentos"] = 600,

[Survived] String mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:10:40
     private static readonly Dictionary<string, long> WordToBasicNumberMapping = new Dictionary<string, long>
     {
         ["um"] = 1, ["dois"] = 2, ["três"] = 3, ["quatro"] = 4, ["cinco"] = 5, ["seis"] = 6, ["sete"] = 7, ["oito"] = 8, ["nove"] = 9, ["dez"] = 10,
-        ["onze"] = 11, ["doze"] = 12, ["treze"] = 13, ["catorze"] = 14, ["quinze"] = 15, ["dezesseis"] = 16, ["dezessete"] = 17, ["dezoito"] = 18, ["dezenove"] = 19,
+        ["onze"] = 11, ["doze"] = 12, [""] = 13, ["catorze"] = 14, ["quinze"] = 15, ["dezesseis"] = 16, ["dezessete"] = 17, ["dezoito"] = 18, ["dezenove"] = 19,
         ["vinte"] = 20, ["trinta"] = 30, ["quarenta"] = 40, ["cinquenta"] = 50, ["sessenta"] = 60, ["setenta"] = 70, ["oitenta"] = 80, ["noventa"] = 90,
         ["cem"] = 100, ["cento"] = 100, ["duzentos"] = 200, ["trezentos"] = 300, ["quatrocentos"] = 400, ["quinhentos"] = 500, ["seiscentos"] = 600,

[Killed] String mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:11:62
     {
         ["um"] = 1, ["dois"] = 2, ["três"] = 3, ["quatro"] = 4, ["cinco"] = 5, ["seis"] = 6, ["sete"] = 7, ["oito"] = 8, ["nove"] = 9, ["dez"] = 10,
         ["onze"] = 11, ["doze"] = 12, ["treze"] = 13, ["catorze"] = 14, ["quinze"] = 15, ["dezesseis"] = 16, ["dezessete"] = 17, ["dezoito"] = 18, ["dezenove"] = 19,
-        ["vinte"] = 20, ["trinta"] = 30, ["quarenta"] = 40, ["cinquenta"] = 50, ["sessenta"] = 60, ["setenta"] = 70, ["oitenta"] = 80, ["noventa"] = 90,
+        ["vinte"] = 20, ["trinta"] = 30, ["quarenta"] = 40, [""] = 50, ["sessenta"] = 60, ["setenta"] = 70, ["oitenta"] = 80, ["noventa"] = 90,
         ["cem"] = 100, ["cento"] = 100, ["duzentos"] = 200, ["trezentos"] = 300, ["quatrocentos"] = 400, ["quinhentos"] = 500, ["seiscentos"] = 600,
         ["setecentos"] = 700, ["oitocentos"] = 800, ["novecentos"] = 900
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] String mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:11:137
     {
         ["um"] = 1, ["dois"] = 2, ["três"] = 3, ["quatro"] = 4, ["cinco"] = 5, ["seis"] = 6, ["sete"] = 7, ["oito"] = 8, ["nove"] = 9, ["dez"] = 10,
         ["onze"] = 11, ["doze"] = 12, ["treze"] = 13, ["catorze"] = 14, ["quinze"] = 15, ["dezesseis"] = 16, ["dezessete"] = 17, ["dezoito"] = 18, ["dezenove"] = 19,
-        ["vinte"] = 20, ["trinta"] = 30, ["quarenta"] = 40, ["cinquenta"] = 50, ["sessenta"] = 60, ["setenta"] = 70, ["oitenta"] = 80, ["noventa"] = 90,
+        ["vinte"] = 20, ["trinta"] = 30, ["quarenta"] = 40, ["cinquenta"] = 50, ["sessenta"] = 60, ["setenta"] = 70, ["oitenta"] = 80, [""] = 90,
         ["cem"] = 100, ["cento"] = 100, ["duzentos"] = 200, ["trezentos"] = 300, ["quatrocentos"] = 400, ["quinhentos"] = 500, ["seiscentos"] = 600,
         ["setecentos"] = 700, ["oitocentos"] = 800, ["novecentos"] = 900

[Killed] String mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:12:25
         ["um"] = 1, ["dois"] = 2, ["três"] = 3, ["quatro"] = 4, ["cinco"] = 5, ["seis"] = 6, ["sete"] = 7, ["oito"] = 8, ["nove"] = 9, ["dez"] = 10,
         ["onze"] = 11, ["doze"] = 12, ["treze"] = 13, ["catorze"] = 14, ["quinze"] = 15, ["dezesseis"] = 16, ["dezessete"] = 17, ["dezoito"] = 18, ["dezenove"] = 19,
         ["vinte"] = 20, ["trinta"] = 30, ["quarenta"] = 40, ["cinquenta"] = 50, ["sessenta"] = 60, ["setenta"] = 70, ["oitenta"] = 80, ["noventa"] = 90,
-        ["cem"] = 100, ["cento"] = 100, ["duzentos"] = 200, ["trezentos"] = 300, ["quatrocentos"] = 400, ["quinhentos"] = 500, ["seiscentos"] = 600,
+        ["cem"] = 100, [""] = 100, ["duzentos"] = 200, ["trezentos"] = 300, ["quatrocentos"] = 400, ["quinhentos"] = 500, ["seiscentos"] = 600,
         ["setecentos"] = 700, ["oitocentos"] = 800, ["novecentos"] = 900
     };
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] String mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:18:61
 
     private static readonly Dictionary<string, long> WordToMultiplierMapping = new Dictionary<string, long>
     {
-        ["bilhão"] = 1000000000, ["bilhões"] = 1000000000, ["bi"] = 1000000000, 
+        ["bilhão"] = 1000000000, ["bilhões"] = 1000000000, [""] = 1000000000, 
         ["milhão"] = 1000000, ["milhões"] = 1000000, ["mi"] = 1000000,
         ["mil"] = 1000, ["k"] = 1000, ["milhar"] = 1000, ["milhares"] = 1000,
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber

[Killed] String mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:18:35
 
     private static readonly Dictionary<string, long> WordToMultiplierMapping = new Dictionary<string, long>
     {
-        ["bilhão"] = 1000000000, ["bilhões"] = 1000000000, ["bi"] = 1000000000, 
+        ["bilhão"] = 1000000000, [""] = 1000000000, ["bi"] = 1000000000, 
         ["milhão"] = 1000000, ["milhões"] = 1000000, ["mi"] = 1000000,
         ["mil"] = 1000, ["k"] = 1000, ["milhar"] = 1000, ["milhares"] = 1000,
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] String mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:19:10
     private static readonly Dictionary<string, long> WordToMultiplierMapping = new Dictionary<string, long>
     {
         ["bilhão"] = 1000000000, ["bilhões"] = 1000000000, ["bi"] = 1000000000, 
-        ["milhão"] = 1000000, ["milhões"] = 1000000, ["mi"] = 1000000,
+        [""] = 1000000, ["milhões"] = 1000000, ["mi"] = 1000000,
         ["mil"] = 1000, ["k"] = 1000, ["milhar"] = 1000, ["milhares"] = 1000,
     };
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] String mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:20:59
     {
         ["bilhão"] = 1000000000, ["bilhões"] = 1000000000, ["bi"] = 1000000000, 
         ["milhão"] = 1000000, ["milhões"] = 1000000, ["mi"] = 1000000,
-        ["mil"] = 1000, ["k"] = 1000, ["milhar"] = 1000, ["milhares"] = 1000,
+        ["mil"] = 1000, ["k"] = 1000, ["milhar"] = 1000, [""] = 1000,
     };
 
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber

[Killed] Negate expression
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:32:17
 
         foreach (string word in wordArray)
         {
-            if (IsBasicNumber(word, out long basicNumber))
+            if (!(IsBasicNumber(word, out long basicNumber)))
             {
                 currentValue += basicNumber;
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:34:17
         {
             if (IsBasicNumber(word, out long basicNumber))
             {
-                currentValue += basicNumber;
+                currentValue -= basicNumber;
                 continue;
             }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Statement mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:35:17
             if (IsBasicNumber(word, out long basicNumber))
             {
                 currentValue += basicNumber;
-                continue;
+                ;
             }
 

[Killed] Statement mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:38:51
                 continue;
             }
 
-            if (currentValue == 0 && word == "k") continue;
+            if (currentValue == 0 && word == "k") ;
                 
             if (IsMultiplier(word, out long multiplier))
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber

[Killed] Logical mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:38:17
                 continue;
             }
 
-            if (currentValue == 0 && word == "k") continue;
+            if (currentValue == 0 || word == "k") continue;
                 
             if (IsMultiplier(word, out long multiplier))
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber

[Killed] Negate expression
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:40:17
 
             if (currentValue == 0 && word == "k") continue;
                 
-            if (IsMultiplier(word, out long multiplier))
+            if (!(IsMultiplier(word, out long multiplier)))
             {
                 totalValue += (currentValue == 0 ? 1 : currentValue) * multiplier;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:42:32
                 
             if (IsMultiplier(word, out long multiplier))
             {
-                totalValue += (currentValue == 0 ? 1 : currentValue) * multiplier;
+                totalValue += (currentValue != 0 ? 1 : currentValue) * multiplier;
                 currentValue = 0;
                 continue;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Arithmetic mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:42:31
                 
             if (IsMultiplier(word, out long multiplier))
             {
-                totalValue += (currentValue == 0 ? 1 : currentValue) * multiplier;
+                totalValue += (currentValue == 0 ? 1 : currentValue) / multiplier;
                 currentValue = 0;
                 continue;
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber

[Survived] Statement mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:44:17
             {
                 totalValue += (currentValue == 0 ? 1 : currentValue) * multiplier;
                 currentValue = 0;
-                continue;
+                ;
             }
 

[Killed] Negate expression
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:47:17
                 continue;
             }
 
-            if (IsCompositeNumber(word, out long compositeValue))
+            if (!(IsCompositeNumber(word, out long compositeValue)))
             {
                 totalValue += compositeValue;
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:49:17
 
             if (IsCompositeNumber(word, out long compositeValue))
             {
-                totalValue += compositeValue;
+                totalValue -= compositeValue;
                 currentValue = 0;
                 continue;
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber

[Killed] Negate expression
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:54:17
                 continue;
             }
 
-            if (long.TryParse(word, out long numberValue))
+            if (!(long.TryParse(word, out long numberValue)))
             {
                 currentValue += numberValue;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:56:17
 
             if (long.TryParse(word, out long numberValue))
             {
-                currentValue += numberValue;
+                currentValue -= numberValue;
             }
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Arithmetic mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:60:16
             }
         }
 
-        return totalValue + currentValue;
+        return totalValue - currentValue;
     }
 
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Block removal mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:64:5
     }
 
     private static bool IsBasicNumber(string word, out long value)
-    {
-        return WordToBasicNumberMapping.TryGetValue(word, out value);
-    }
+    {}
 
     private static bool IsMultiplier(string word, out long value)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Block removal mutation
Domains/QueryStrings/Helpers/NumberConverterHelper.cs:69:5
     }
 
     private static bool IsMultiplier(string word, out long value)
-    {
-        return WordToMultiplierMapping.TryGetValue(word, out value);
-    }
+    {}
 
     private static bool IsCompositeNumber(string word, out long value)
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberConverterHelperTest.SuccessToConvertWordsToNumber
