[Survived] String mutation
Domains/QueryStrings/Helpers/NumberScale.cs:7:66
 
 public class NumberScale : Enumeration<NumberScale>
 {
-    public static readonly NumberScale None = new NumberScale(0, "None");
+    public static readonly NumberScale None = new NumberScale(0, "");
     public static readonly NumberScale Units = new NumberScale(1, "Units");
     public static readonly NumberScale Tens = new NumberScale(2, "Tens");

[Killed] String mutation
Domains/QueryStrings/Helpers/NumberScale.cs:8:67
 public class NumberScale : Enumeration<NumberScale>
 {
     public static readonly NumberScale None = new NumberScale(0, "None");
-    public static readonly NumberScale Units = new NumberScale(1, "Units");
+    public static readonly NumberScale Units = new NumberScale(1, "");
     public static readonly NumberScale Tens = new NumberScale(2, "Tens");
     public static readonly NumberScale Hundreds = new NumberScale(3, "Hundreds");
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberScaleTest.SuccessToGetScaleByNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberScaleTest.SuccessToGetScaleByNumber

[Killed] String mutation
Domains/QueryStrings/Helpers/NumberScale.cs:9:66
 {
     public static readonly NumberScale None = new NumberScale(0, "None");
     public static readonly NumberScale Units = new NumberScale(1, "Units");
-    public static readonly NumberScale Tens = new NumberScale(2, "Tens");
+    public static readonly NumberScale Tens = new NumberScale(2, "");
     public static readonly NumberScale Hundreds = new NumberScale(3, "Hundreds");
     public static readonly NumberScale Thousands = new NumberScale(4, "Thousands");
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberScaleTest.SuccessToGetScaleByNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberScaleTest.SuccessToGetScaleByNumber

[Killed] Equality mutation
Domains/QueryStrings/Helpers/NumberScale.cs:23:13
     {
         return number switch
         {
-            >= 1000000000 => Billions,
+            > 1000000000 => Billions,
             >= 1000000 => Millions,
             >= 1000 => Thousands,
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/NumberScale.cs:24:13
         return number switch
         {
             >= 1000000000 => Billions,
-            >= 1000000 => Millions,
+            > 1000000 => Millions,
             >= 1000 => Thousands,
             >= 100 => Hundreds,
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberScaleTest.SuccessToGetScaleByNumber

[Killed] Equality mutation
Domains/QueryStrings/Helpers/NumberScale.cs:25:13
         {
             >= 1000000000 => Billions,
             >= 1000000 => Millions,
-            >= 1000 => Thousands,
+            > 1000 => Thousands,
             >= 100 => Hundreds,
             >= 10 => Tens,
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberScaleTest.SuccessToGetScaleByNumber

[Killed] Equality mutation
Domains/QueryStrings/Helpers/NumberScale.cs:26:13
             >= 1000000000 => Billions,
             >= 1000000 => Millions,
             >= 1000 => Thousands,
-            >= 100 => Hundreds,
+            > 100 => Hundreds,
             >= 10 => Tens,
             _ => Units
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberScaleTest.SuccessToGetScaleByNumber

[Killed] Equality mutation
Domains/QueryStrings/Helpers/NumberScale.cs:27:13
             >= 1000000 => Millions,
             >= 1000 => Thousands,
             >= 100 => Hundreds,
-            >= 10 => Tens,
+            < 10 => Tens,
             _ => Units
         };
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberScaleTest.SuccessToGetScaleByNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberScaleTest.SuccessToGetScaleByNumber; UnitTest.Core.Domains.QueryStrings.Helpers.NumberScaleTest.SuccessToGetScaleByNumber

[Killed] Equality mutation
Domains/QueryStrings/Helpers/NumberScale.cs:27:13
             >= 1000000 => Millions,
             >= 1000 => Thousands,
             >= 100 => Hundreds,
-            >= 10 => Tens,
+            > 10 => Tens,
             _ => Units
         };
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.NumberScaleTest.SuccessToGetScaleByNumber
