[Killed] Block removal mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:22:5
     private static readonly List<long> ScaleSeparators = new List<long> {1000, 1000000, 1000000000};
 
     public static IList<WordInfo> Parse(IList<string> words, IList<string> nouns, IList<string> confirmationWords, IList<string> revocationWords)
-    {
-        IList<WordInfo> wordInfos = Classify(words, nouns, confirmationWords, revocationWords);
-
-        return Summarize(wordInfos, confirmationWords, revocationWords).ToArray();
-    }
+    {}
 
     private static IList<WordInfo> Classify(IList<string> words, IList<string> nouns, IList<string> confirmationWords, IList<string> revocationWords)
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Object initializer mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:34:29
 
         foreach (string current in words)
         {
-            WordInfo info = new WordInfo
-            {
-                Value = current
-            };
+            WordInfo info = new WordInfo
+{};
             
             if (int.TryParse(current, NumberStyles.Number, DefaultCultureInfo, out int result))
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:39:17
                 Value = current
             };
             
-            if (int.TryParse(current, NumberStyles.Number, DefaultCultureInfo, out int result))
+            if (!(int.TryParse(current, NumberStyles.Number, DefaultCultureInfo, out int result)))
             {
                 info.Type = WordInfoType.QuantitativeAdjective;
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:43:17
             {
                 info.Type = WordInfoType.QuantitativeAdjective;
                 info.Value = Convert.ToString(result, DefaultCultureInfo);
-                wordInfos.Add(info);
+                ;
                 continue;
             }
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:44:17
                 info.Type = WordInfoType.QuantitativeAdjective;
                 info.Value = Convert.ToString(result, DefaultCultureInfo);
                 wordInfos.Add(info);
-                continue;
+                ;
             }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:48:17
             }
 
             long number = NumberConverterHelper.ConvertWordsToNumber(current);
-            if (number > 0)
+            if (number >= 0)
             {
                 info.Type = WordInfoType.QuantitativeAdjective;
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:48:17
             }
 
             long number = NumberConverterHelper.ConvertWordsToNumber(current);
-            if (number > 0)
+            if (!(number > 0))
             {
                 info.Type = WordInfoType.QuantitativeAdjective;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:52:17
             {
                 info.Type = WordInfoType.QuantitativeAdjective;
                 info.Value = Convert.ToString(number, DefaultCultureInfo);
-                wordInfos.Add(info);
+                ;
                 continue;
             }
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:57:17
             }
 
             (double maxSimilarity, string mostSimilarWord) = GetMaxSimilarity(nouns, current);
-            if (maxSimilarity >= SimilarityLimit)
+            if (maxSimilarity < SimilarityLimit)
             {
                 info.Type = WordInfoType.Noun;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:57:17
             }
 
             (double maxSimilarity, string mostSimilarWord) = GetMaxSimilarity(nouns, current);
-            if (maxSimilarity >= SimilarityLimit)
+            if (!(maxSimilarity >= SimilarityLimit))
             {
                 info.Type = WordInfoType.Noun;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:61:17
             {
                 info.Type = WordInfoType.Noun;
                 info.Value = mostSimilarWord;
-                wordInfos.Add(info);
+                ;
                 continue;
             }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:66:17
             }
 
             (maxSimilarity, mostSimilarWord) = GetMaxSimilarity(confirmationWords, current);
-            if (maxSimilarity >= SimilarityLimit)
+            if (!(maxSimilarity >= SimilarityLimit))
             {
                 info.Type = WordInfoType.ConfirmationIndicator;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:66:17
             }
 
             (maxSimilarity, mostSimilarWord) = GetMaxSimilarity(confirmationWords, current);
-            if (maxSimilarity >= SimilarityLimit)
+            if (maxSimilarity < SimilarityLimit)
             {
                 info.Type = WordInfoType.ConfirmationIndicator;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:75:17
             }
 
             (maxSimilarity, mostSimilarWord) = GetMaxSimilarity(revocationWords, current);
-            if (maxSimilarity >= SimilarityLimit)
+            if (!(maxSimilarity >= SimilarityLimit))
             {
                 info.Type = WordInfoType.RevocationIndicator;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:75:17
             }
 
             (maxSimilarity, mostSimilarWord) = GetMaxSimilarity(revocationWords, current);
-            if (maxSimilarity >= SimilarityLimit)
+            if (maxSimilarity < SimilarityLimit)
             {
                 info.Type = WordInfoType.RevocationIndicator;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:84:13
             }
 
             info.Type = WordInfoType.Other;
-            wordInfos.Add(info);
+            ;
         }
 

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:98:17
         foreach (string word in words)
         {
             double similarity = GetSimilarityHelper.GetSimilarity(word, term);
-            if (similarity > maxSimilarity)
+            if (similarity < maxSimilarity)
             {
                 maxSimilarity = similarity;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:98:17
         foreach (string word in words)
         {
             double similarity = GetSimilarityHelper.GetSimilarity(word, term);
-            if (similarity > maxSimilarity)
+            if (!(similarity > maxSimilarity))
             {
                 maxSimilarity = similarity;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Block removal mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:99:13
         {
             double similarity = GetSimilarityHelper.GetSimilarity(word, term);
             if (similarity > maxSimilarity)
-            {
-                maxSimilarity = similarity;
-                mostSimilarWord = word;
-            }
+            {}
 
             if (maxSimilarity.CompareTo(1) == 0) break;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:104:17
                 mostSimilarWord = word;
             }
 
-            if (maxSimilarity.CompareTo(1) == 0) break;
+            if (maxSimilarity.CompareTo(1) != 0) break;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:104:50
                 mostSimilarWord = word;
             }
 
-            if (maxSimilarity.CompareTo(1) == 0) break;
+            if (maxSimilarity.CompareTo(1) == 0) ;
         }
 

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:113:9
     private static List<WordInfo> Summarize(IList<WordInfo> wordInfos, IList<string> confirmationWords, IList<string> revocationWords)
     {
         HashSet<string> indicators = new HashSet<string>(confirmationWords);
-        indicators.UnionWith(revocationWords);
+        ;
 
         List<WordInfo> summarize = new List<WordInfo>();
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:119:54
 
         State state = new State();
 
-        for (int index = 0; index < wordInfos.Count; index++)
+        for (int index = 0; index < wordInfos.Count; index--)
         {
             WordInfo wordInfo = wordInfos[index];
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:119:29
 
         State state = new State();
 
-        for (int index = 0; index < wordInfos.Count; index++)
+        for (int index = 0; index <= wordInfos.Count; index++)
         {
             WordInfo wordInfo = wordInfos[index];
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:123:17
         {
             WordInfo wordInfo = wordInfos[index];
 
-            if (wordInfo.Type != WordInfoType.QuantitativeAdjective)
+            if (wordInfo.Type == WordInfoType.QuantitativeAdjective)
             {
                 bool isPreposition = indicators.TryGetValue(wordInfo.Value, out string _);
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:126:17
             if (wordInfo.Type != WordInfoType.QuantitativeAdjective)
             {
                 bool isPreposition = indicators.TryGetValue(wordInfo.Value, out string _);
-                HandleOtherWordInfos(wordInfos, state, index, isPreposition, confirmationWords, summarize);
+                ;
                 continue;
             }
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:127:17
             {
                 bool isPreposition = indicators.TryGetValue(wordInfo.Value, out string _);
                 HandleOtherWordInfos(wordInfos, state, index, isPreposition, confirmationWords, summarize);
-                continue;
+                ;
             }
 
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:130:13
                 continue;
             }
 
-            HandleQuantitativeAdjective(wordInfos, state, index, confirmationWords, revocationWords, summarize);
+            ;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:133:28
             HandleQuantitativeAdjective(wordInfos, state, index, confirmationWords, revocationWords, summarize);
         }
 
-        state.TotalValue = state.TotalValue > 0 ? state.TotalValue : state.CurrentValue;
+        state.TotalValue = !(state.TotalValue > 0 ) ? state.TotalValue : state.CurrentValue;
 
         if (state.TotalValue <= 0) return summarize;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:133:28
             HandleQuantitativeAdjective(wordInfos, state, index, confirmationWords, revocationWords, summarize);
         }
 
-        state.TotalValue = state.TotalValue > 0 ? state.TotalValue : state.CurrentValue;
+        state.TotalValue = state.TotalValue < 0 ? state.TotalValue : state.CurrentValue;
 
         if (state.TotalValue <= 0) return summarize;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:135:13
 
         state.TotalValue = state.TotalValue > 0 ? state.TotalValue : state.CurrentValue;
 
-        if (state.TotalValue <= 0) return summarize;
+        if (state.TotalValue > 0) return summarize;
 
         AddQuantifiedNoun(summarize, confirmationWords, state.TotalValue, Anonymous);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:135:13
 
         state.TotalValue = state.TotalValue > 0 ? state.TotalValue : state.CurrentValue;
 
-        if (state.TotalValue <= 0) return summarize;
+        if (!(state.TotalValue <= 0)) return summarize;
 
         AddQuantifiedNoun(summarize, confirmationWords, state.TotalValue, Anonymous);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:137:9
 
         if (state.TotalValue <= 0) return summarize;
 
-        AddQuantifiedNoun(summarize, confirmationWords, state.TotalValue, Anonymous);
+        ;
 
         return summarize;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:146:24
     {
         WordInfo wordInfo = wordInfos[index];
 
-        bool hasNext = index <= wordInfos.Count - 2;
+        bool hasNext = index > wordInfos.Count - 2;
         bool runTheTotalizator = isPreposition || wordInfo.Type.Is(WordInfoType.Noun) || !hasNext ||
                                  wordInfos[index + 1].Type.IsNot(WordInfoType.QuantitativeAdjective);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Arithmetic mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:146:33
     {
         WordInfo wordInfo = wordInfos[index];
 
-        bool hasNext = index <= wordInfos.Count - 2;
+        bool hasNext = index <= wordInfos.Count + 2;
         bool runTheTotalizator = isPreposition || wordInfo.Type.Is(WordInfoType.Noun) || !hasNext ||
                                  wordInfos[index + 1].Type.IsNot(WordInfoType.QuantitativeAdjective);
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Logical mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:147:34
         WordInfo wordInfo = wordInfos[index];
 
         bool hasNext = index <= wordInfos.Count - 2;
-        bool runTheTotalizator = isPreposition || wordInfo.Type.Is(WordInfoType.Noun) || !hasNext ||
+        bool runTheTotalizator = isPreposition || wordInfo.Type.Is(WordInfoType.Noun) && !hasNext ||
                                  wordInfos[index + 1].Type.IsNot(WordInfoType.QuantitativeAdjective);
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Logical mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:147:34
         WordInfo wordInfo = wordInfos[index];
 
         bool hasNext = index <= wordInfos.Count - 2;
-        bool runTheTotalizator = isPreposition || wordInfo.Type.Is(WordInfoType.Noun) || !hasNext ||
-                                 wordInfos[index + 1].Type.IsNot(WordInfoType.QuantitativeAdjective);
+        bool runTheTotalizator = isPreposition || wordInfo.Type.Is(WordInfoType.Noun) || !hasNext &&
+                                 wordInfos[index + 1].Type.IsNot(WordInfoType.QuantitativeAdjective);
 
         if (!runTheTotalizator)
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Arithmetic mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:148:44
 
         bool hasNext = index <= wordInfos.Count - 2;
         bool runTheTotalizator = isPreposition || wordInfo.Type.Is(WordInfoType.Noun) || !hasNext ||
-                                 wordInfos[index + 1].Type.IsNot(WordInfoType.QuantitativeAdjective);
+                                 wordInfos[index - 1].Type.IsNot(WordInfoType.QuantitativeAdjective);
 
         if (!runTheTotalizator)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:150:13
         bool runTheTotalizator = isPreposition || wordInfo.Type.Is(WordInfoType.Noun) || !hasNext ||
                                  wordInfos[index + 1].Type.IsNot(WordInfoType.QuantitativeAdjective);
 
-        if (!runTheTotalizator)
+        if (runTheTotalizator)
         {
             if (wordInfo.Value != DefaultConjunction)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:152:17
 
         if (!runTheTotalizator)
         {
-            if (wordInfo.Value != DefaultConjunction)
+            if (wordInfo.Value == DefaultConjunction)
             {
                 summarize.Add(wordInfo);

[Survived] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:154:17
         {
             if (wordInfo.Value != DefaultConjunction)
             {
-                summarize.Add(wordInfo);
+                ;
             }
 

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:157:13
                 summarize.Add(wordInfo);
             }
 
-            return;
+            ;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:160:28
             return;
         }
 
-        state.TotalValue = state.TotalValue > 0 ? state.TotalValue : state.CurrentValue;
+        state.TotalValue = state.TotalValue >= 0 ? state.TotalValue : state.CurrentValue;
 
         if (state.TotalValue > 0)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:162:13
 
         state.TotalValue = state.TotalValue > 0 ? state.TotalValue : state.CurrentValue;
 
-        if (state.TotalValue > 0)
+        if (!(state.TotalValue > 0))
         {
             string noun = ComputeNoun(wordInfos, index);
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:162:13
 
         state.TotalValue = state.TotalValue > 0 ? state.TotalValue : state.CurrentValue;
 
-        if (state.TotalValue > 0)
+        if (state.TotalValue >= 0)
         {
             string noun = ComputeNoun(wordInfos, index);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:165:13
         if (state.TotalValue > 0)
         {
             string noun = ComputeNoun(wordInfos, index);
-            AddQuantifiedNoun(summarize, confirmationWords, state.TotalValue, noun);
+            ;
             ResetState(state);
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:166:13
         {
             string noun = ComputeNoun(wordInfos, index);
             AddQuantifiedNoun(summarize, confirmationWords, state.TotalValue, noun);
-            ResetState(state);
+            ;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:169:9
             ResetState(state);
         }
 
-        summarize.Add(wordInfo);
+        ;
     }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:180:13
         string value = wordInfo.Value;
         long number = Convert.ToInt64(value, DefaultCultureInfo);
 
-        if (!ScaleSeparators.Contains(number))
+        if (ScaleSeparators.Contains(number))
         {
             state.CurrentValue += number;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:182:13
 
         if (!ScaleSeparators.Contains(number))
         {
-            state.CurrentValue += number;
+            state.CurrentValue -= number;
             return;
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually
