[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:183:13
         if (!ScaleSeparators.Contains(number))
         {
             state.CurrentValue += number;
-            return;
+            ;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:186:13
             return;
         }
 
-        if (index == 0)
+        if (index != 0)
         {
             state.TotalValue += (state.CurrentValue == 0 ? 1 : state.CurrentValue) * number;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:188:34
 
         if (index == 0)
         {
-            state.TotalValue += (state.CurrentValue == 0 ? 1 : state.CurrentValue) * number;
+            state.TotalValue += (state.CurrentValue != 0 ? 1 : state.CurrentValue) * number;
             state.CurrentValue = 0;
             state.CurrentScale = NumberScale.GetScaleByNumber(state.TotalValue);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:188:13
 
         if (index == 0)
         {
-            state.TotalValue += (state.CurrentValue == 0 ? 1 : state.CurrentValue) * number;
+            state.TotalValue -= (state.CurrentValue == 0 ? 1 : state.CurrentValue) * number;
             state.CurrentValue = 0;
             state.CurrentScale = NumberScale.GetScaleByNumber(state.TotalValue);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:191:13
             state.TotalValue += (state.CurrentValue == 0 ? 1 : state.CurrentValue) * number;
             state.CurrentValue = 0;
             state.CurrentScale = NumberScale.GetScaleByNumber(state.TotalValue);
-            return;
+            ;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:194:30
             return;
         }
 
-        state.CurrentValue = state.CurrentValue == 0 ? number : state.CurrentValue * number;
+        state.CurrentValue = state.CurrentValue != 0 ? number : state.CurrentValue * number;
 
         NumberScale scale = NumberScale.GetScaleByNumber(state.CurrentValue);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Arithmetic mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:194:65
             return;
         }
 
-        state.CurrentValue = state.CurrentValue == 0 ? number : state.CurrentValue * number;
+        state.CurrentValue = state.CurrentValue == 0 ? number : state.CurrentValue / number;
 
         NumberScale scale = NumberScale.GetScaleByNumber(state.CurrentValue);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:198:13
 
         NumberScale scale = NumberScale.GetScaleByNumber(state.CurrentValue);
 
-        if (state.CurrentScale.Id != NumberScale.None.Id && scale.Id >= state.CurrentScale.Id)
+        if (state.CurrentScale.Id == NumberScale.None.Id && scale.Id >= state.CurrentScale.Id)
         {
             string noun = ComputeNoun(wordInfos, index);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:198:13
 
         NumberScale scale = NumberScale.GetScaleByNumber(state.CurrentValue);
 
-        if (state.CurrentScale.Id != NumberScale.None.Id && scale.Id >= state.CurrentScale.Id)
+        if (!(state.CurrentScale.Id != NumberScale.None.Id && scale.Id >= state.CurrentScale.Id))
         {
             string noun = ComputeNoun(wordInfos, index);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:202:13
         {
             string noun = ComputeNoun(wordInfos, index);
 
-            AddQuantifiedNoun(summarize, confirmationWords, state.TotalValue, noun);
+            ;
             AddIndicator(summarize, confirmationWords, revocationWords);
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:203:13
             string noun = ComputeNoun(wordInfos, index);
 
             AddQuantifiedNoun(summarize, confirmationWords, state.TotalValue, noun);
-            AddIndicator(summarize, confirmationWords, revocationWords);
+            ;
 
             state.TotalValue = state.CurrentValue;

[Survived] Statement mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:208:13
             state.TotalValue = state.CurrentValue;
             state.CurrentValue = 0;
             state.CurrentScale = scale;
-            return;
+            ;
         }
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:211:9
             return;
         }
 
-        state.TotalValue += state.CurrentValue;
+        state.TotalValue -= state.CurrentValue;
         state.CurrentValue = 0;
         state.CurrentScale = scale;
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Block removal mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:217:5
     }
 
     private static void ResetState(State state)
-    {
-        state.TotalValue = 0;
-        state.CurrentValue = 0;
-        state.CurrentScale = NumberScale.None;
-    }
+    {}
 
     private static string ComputeNoun(IList<WordInfo> wordInfos, int index)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:225:60
 
     private static string ComputeNoun(IList<WordInfo> wordInfos, int index)
     {
-        for (int zIndex = index; zIndex < wordInfos.Count; zIndex++)
+        for (int zIndex = index; zIndex < wordInfos.Count; zIndex--)
         {
             WordInfo wordInfo = wordInfos[zIndex];
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:225:34
 
     private static string ComputeNoun(IList<WordInfo> wordInfos, int index)
     {
-        for (int zIndex = index; zIndex < wordInfos.Count; zIndex++)
+        for (int zIndex = index; zIndex <= wordInfos.Count; zIndex++)
         {
             WordInfo wordInfo = wordInfos[zIndex];
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:228:17
         for (int zIndex = index; zIndex < wordInfos.Count; zIndex++)
         {
             WordInfo wordInfo = wordInfos[zIndex];
-            if (wordInfo.Type.Is(WordInfoType.Other) && wordInfo.Value != DefaultConjunction) return Anonymous;
+            if (!(wordInfo.Type.Is(WordInfoType.Other) && wordInfo.Value != DefaultConjunction)) return Anonymous;
             if (wordInfo.Type.Is(WordInfoType.Noun)) return wordInfo.Value;
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Logical mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:228:17
         for (int zIndex = index; zIndex < wordInfos.Count; zIndex++)
         {
             WordInfo wordInfo = wordInfos[zIndex];
-            if (wordInfo.Type.Is(WordInfoType.Other) && wordInfo.Value != DefaultConjunction) return Anonymous;
+            if (wordInfo.Type.Is(WordInfoType.Other) || wordInfo.Value != DefaultConjunction) return Anonymous;
             if (wordInfo.Type.Is(WordInfoType.Noun)) return wordInfo.Value;
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:229:17
         {
             WordInfo wordInfo = wordInfos[zIndex];
             if (wordInfo.Type.Is(WordInfoType.Other) && wordInfo.Value != DefaultConjunction) return Anonymous;
-            if (wordInfo.Type.Is(WordInfoType.Noun)) return wordInfo.Value;
+            if (!(wordInfo.Type.Is(WordInfoType.Noun))) return wordInfo.Value;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:239:13
     {
         Optional<WordInfo> optional = GetLastQuantifiedNoun(target);
 
-        if (optional.HasValue())
+        if (!(optional.HasValue()))
         {
             WordInfo wordInfo = optional.GetValue();
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:244:17
             WordInfo wordInfo = optional.GetValue();
             string value = wordInfo.Value.Split(' ')[1];
             double similarity = GetSimilarityHelper.GetSimilarity(value, noun);
-            if (similarity >= 0.51)
+            if (!(similarity >= 0.51))
             {
                 WordInfoType type = confirmationWords.Contains(DefaultIntervalPreposition)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:244:17
             WordInfo wordInfo = optional.GetValue();
             string value = wordInfo.Value.Split(' ')[1];
             double similarity = GetSimilarityHelper.GetSimilarity(value, noun);
-            if (similarity >= 0.51)
+            if (similarity < 0.51)
             {
                 WordInfoType type = confirmationWords.Contains(DefaultIntervalPreposition)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:246:37
             double similarity = GetSimilarityHelper.GetSimilarity(value, noun);
             if (similarity >= 0.51)
             {
-                WordInfoType type = confirmationWords.Contains(DefaultIntervalPreposition)
+                WordInfoType type = !(confirmationWords.Contains(DefaultIntervalPreposition)
+)
                     ? WordInfoType.ConfirmationIndicator
                     : WordInfoType.RevocationIndicator;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:267:13
 
     private static Optional<WordInfo> GetLastQuantifiedNoun(IList<WordInfo> wordInfos)
     {
-        if (wordInfos.Count == 0) return Optional<WordInfo>.Empty();
+        if (wordInfos.Count != 0) return Optional<WordInfo>.Empty();
 
         for (int i = wordInfos.Count - 1; i >= 0; i--)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Arithmetic mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:269:22
     {
         if (wordInfos.Count == 0) return Optional<WordInfo>.Empty();
 
-        for (int i = wordInfos.Count - 1; i >= 0; i--)
+        for (int i = wordInfos.Count + 1; i >= 0; i--)
         {
             WordInfo wordInfo = wordInfos[i];
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] PostDecrementExpression to PostIncrementExpression mutation
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:269:51
     {
         if (wordInfos.Count == 0) return Optional<WordInfo>.Empty();
 
-        for (int i = wordInfos.Count - 1; i >= 0; i--)
+        for (int i = wordInfos.Count - 1; i >= 0; i++)
         {
             WordInfo wordInfo = wordInfos[i];
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:272:17
         for (int i = wordInfos.Count - 1; i >= 0; i--)
         {
             WordInfo wordInfo = wordInfos[i];
-            if (wordInfo.Type.Is(WordInfoType.QuantifiedNoun)) return Optional<WordInfo>.Of(wordInfo);
+            if (!(wordInfo.Type.Is(WordInfoType.QuantifiedNoun))) return Optional<WordInfo>.Of(wordInfo);
             if (wordInfo.Type.Is(WordInfoType.RevocationIndicator)) return Optional<WordInfo>.Empty();
             if (wordInfo.Type.Is(WordInfoType.ConfirmationIndicator)) return Optional<WordInfo>.Empty();
killedBy: UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence; UnitTest.Core.Domains.QueryStrings.Helpers.SentenceParserHelperTest.SuccessfullyParsedSentence

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:273:17
         {
             WordInfo wordInfo = wordInfos[i];
             if (wordInfo.Type.Is(WordInfoType.QuantifiedNoun)) return Optional<WordInfo>.Of(wordInfo);
-            if (wordInfo.Type.Is(WordInfoType.RevocationIndicator)) return Optional<WordInfo>.Empty();
+            if (!(wordInfo.Type.Is(WordInfoType.RevocationIndicator))) return Optional<WordInfo>.Empty();
             if (wordInfo.Type.Is(WordInfoType.ConfirmationIndicator)) return Optional<WordInfo>.Empty();
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:274:17
             WordInfo wordInfo = wordInfos[i];
             if (wordInfo.Type.Is(WordInfoType.QuantifiedNoun)) return Optional<WordInfo>.Of(wordInfo);
             if (wordInfo.Type.Is(WordInfoType.RevocationIndicator)) return Optional<WordInfo>.Empty();
-            if (wordInfo.Type.Is(WordInfoType.ConfirmationIndicator)) return Optional<WordInfo>.Empty();
+            if (!(wordInfo.Type.Is(WordInfoType.ConfirmationIndicator))) return Optional<WordInfo>.Empty();
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:294:13
     private static WordInfoType GetWordInfoType(IList<string> confirmationWords, IList<string> revocationWords)
     {
         bool isConfirmation = confirmationWords.Contains(DefaultIntervalPreposition);
-        if (isConfirmation) return WordInfoType.ConfirmationIndicator;
+        if (!(isConfirmation)) return WordInfoType.ConfirmationIndicator;
 
         bool isRevocation = revocationWords.Contains(DefaultIntervalPreposition);

[Survived] Negate expression
Domains/QueryStrings/Helpers/SentenceParserHelper.cs:298:16
 
         bool isRevocation = revocationWords.Contains(DefaultIntervalPreposition);
 
-        return isRevocation ? WordInfoType.RevocationIndicator : WordInfoType.Other;
+        return !(isRevocation ) ? WordInfoType.RevocationIndicator : WordInfoType.Other;
     }
 
