[Survived] String mutation
Domains/QueryStrings/Models/WordInfoType.cs:18:85
     public static readonly WordInfoType RevocationIndicator = new WordInfoType(2, "Revocation Indicator");
 
     // Quantitative adjectives (e.g., "1", "two", "3", "four")
-    public static readonly WordInfoType QuantitativeAdjective = new WordInfoType(2, "Quantitative Adjective");
+    public static readonly WordInfoType QuantitativeAdjective = new WordInfoType(2, "");
     
     // Quantified Nouns (e.g., "at least 3 bedrooms", "minimum 4 toilets")

[Survived] String mutation
Domains/QueryStrings/Models/WordInfoType.cs:25:69
     public static readonly WordInfoType QuantifiedNoun = new WordInfoType(3, "Quantified Noun");
     
     // Any other word type not classified by the above categories
-    public static readonly WordInfoType Other = new WordInfoType(4, "Other");
+    public static readonly WordInfoType Other = new WordInfoType(4, "");
 
     private WordInfoType(int id, string name) : base(id, name)
