[Killed] Block removal mutation
Domains/QueryStrings/UseCases/BuildQueryStringUseCase.cs:20:5
     private readonly IGetDateTime _getDateTime;
 
     public BuildQueryStringUseCase(IServiceResolver serviceResolver)
-    {
-        ArgumentValidator.CheckNull(serviceResolver, nameof(serviceResolver));
-        _getQueryStructureByNameGateway = serviceResolver.Resolve<IGetQueryStructureByNameGateway>();
-        _buildQueryStringWithAiGateway = serviceResolver.Resolve<IBuildQueryStringWithAiGateway>();
-        _getDateTime = serviceResolver.Resolve<IGetDateTime>();
-    }
+    {}
 
     public async Task<Output> ExecuteAsync(BuildQueryStringCommand command)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/BuildQueryStringUseCase.cs:33:28
 
         int percentageRange = RandomNumberGeneratorInPercentageRange.Generate(1, 100);
         
-        bool shouldUseAi = queryStructure.AiSettings.UsagePercentage >= percentageRange;
+        bool shouldUseAi = queryStructure.AiSettings.UsagePercentage < percentageRange;
 
         if (shouldUseAi)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Equality mutation
Domains/QueryStrings/UseCases/BuildQueryStringUseCase.cs:33:28
 
         int percentageRange = RandomNumberGeneratorInPercentageRange.Generate(1, 100);
         
-        bool shouldUseAi = queryStructure.AiSettings.UsagePercentage >= percentageRange;
+        bool shouldUseAi = queryStructure.AiSettings.UsagePercentage > percentageRange;
 
         if (shouldUseAi)

[Killed] Negate expression
Domains/QueryStrings/UseCases/BuildQueryStringUseCase.cs:35:13
         
         bool shouldUseAi = queryStructure.AiSettings.UsagePercentage >= percentageRange;
 
-        if (shouldUseAi)
+        if (!(shouldUseAi))
         {
             Optional<string> optional = await _buildQueryStringWithAiGateway.ExecuteAsync(queryStructure, command.SearchTerms);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Boolean mutation
Domains/QueryStrings/UseCases/BuildQueryStringUseCase.cs:38:87
         if (shouldUseAi)
         {
             Optional<string> optional = await _buildQueryStringWithAiGateway.ExecuteAsync(queryStructure, command.SearchTerms);
-            if (optional.HasValue()) return BuildOutput(command, optional.GetValue(), true);
+            if (optional.HasValue()) return BuildOutput(command, optional.GetValue(), false);
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringWithAi

[Killed] Negate expression
Domains/QueryStrings/UseCases/BuildQueryStringUseCase.cs:38:17
         if (shouldUseAi)
         {
             Optional<string> optional = await _buildQueryStringWithAiGateway.ExecuteAsync(queryStructure, command.SearchTerms);
-            if (optional.HasValue()) return BuildOutput(command, optional.GetValue(), true);
+            if (!(optional.HasValue())) return BuildOutput(command, optional.GetValue(), true);
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Boolean mutation
Domains/QueryStrings/UseCases/BuildQueryStringUseCase.cs:43:50
 
         string queryString = await ManualQueryBuilderHelper.Build(queryStructure, command.SearchTerms);
 
-        return BuildOutput(command, queryString, false);
+        return BuildOutput(command, queryString, true);
     }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Object initializer mutation
Domains/QueryStrings/UseCases/BuildQueryStringUseCase.cs:55:16
 
     private Output BuildOutput(BuildQueryStringCommand command, string queryString, bool createdByAi)
     {
-        return new Output
-        {
-            ClientUid = command.ClientUid,
-            QueryName = command.QueryName,
-            SearchTerms = command.SearchTerms,
-            QueryString = queryString,
-            CreatedAt = _getDateTime.Now(),
-            CreatedByAi = createdByAi
-        };
+        return new Output
+{};
     }
 }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually
