[Survived] String mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:18:78
 {
     private const string Anonymous = "Anonymous";
 
-    private static readonly string[] Separators = {" ", ", ", ". ", "", "?", ";", "", "-", "(", ")", "[", "]", "{", "}", "\"", "\""};
+    private static readonly string[] Separators = {" ", ", ", ". ", "", "?", "", "", "-", "(", ")", "[", "]", "{", "}", "\"", "\""};
 
     [GeneratedRegex("\\s+")]

[Survived] String mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:18:57
 {
     private const string Anonymous = "Anonymous";
 
-    private static readonly string[] Separators = {" ", ", ", ". ", "", "?", ";", "", "-", "(", ")", "[", "]", "{", "}", "\"", "\""};
+    private static readonly string[] Separators = {" ", "", ". ", "", "?", ";", "", "-", "(", ")", "[", "]", "{", "}", "\"", "\""};
 
     [GeneratedRegex("\\s+")]

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:34:17
         foreach (Item item in queryStructure.Items)
         {
             string queryParameter = await BuildParameterForItem(item, allNouns, queryParameters, words);
-            if (string.IsNullOrEmpty(queryParameter)) continue;
+            if (!(string.IsNullOrEmpty(queryParameter))) continue;
             string key = queryParameter.Split('=')[0];
             queryParameters[key] = queryParameter;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:34:55
         foreach (Item item in queryStructure.Items)
         {
             string queryParameter = await BuildParameterForItem(item, allNouns, queryParameters, words);
-            if (string.IsNullOrEmpty(queryParameter)) continue;
+            if (string.IsNullOrEmpty(queryParameter)) ;
             string key = queryParameter.Split('=')[0];
             queryParameters[key] = queryParameter;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:39:16
             queryParameters[key] = queryParameter;
         }
 
-        return queryParameters.Count > 0 ? "?" + string.Join("&", queryParameters.Values) : string.Empty;
+        return queryParameters.Count < 0 ? "?" + string.Join("&", queryParameters.Values) : string.Empty;
     }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:39:16
             queryParameters[key] = queryParameter;
         }
 
-        return queryParameters.Count > 0 ? "?" + string.Join("&", queryParameters.Values) : string.Empty;
+        return !(queryParameters.Count > 0 ) ? "?" + string.Join("&", queryParameters.Values) : string.Empty;
     }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:47:16
         TextElementEnumerator textEnumerator = StringInfo.GetTextElementEnumerator(rawSearchTerms);
 
         StringBuilder stringBuilder = new StringBuilder();
-        while (textEnumerator.MoveNext())
+        while (!(textEnumerator.MoveNext()))
         {
             if (char.IsSurrogatePair(textEnumerator.GetTextElement(), 0))
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:49:17
         StringBuilder stringBuilder = new StringBuilder();
         while (textEnumerator.MoveNext())
         {
-            if (char.IsSurrogatePair(textEnumerator.GetTextElement(), 0))
+            if (!(char.IsSurrogatePair(textEnumerator.GetTextElement(), 0)))
             {
                 stringBuilder.Append($" {textEnumerator.GetTextElement()} ");
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:51:17
         {
             if (char.IsSurrogatePair(textEnumerator.GetTextElement(), 0))
             {
-                stringBuilder.Append($" {textEnumerator.GetTextElement()} ");
+                ;
                 continue;
             }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] String mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:51:38
         {
             if (char.IsSurrogatePair(textEnumerator.GetTextElement(), 0))
             {
-                stringBuilder.Append($" {textEnumerator.GetTextElement()} ");
+                stringBuilder.Append($"");
                 continue;
             }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:52:17
             if (char.IsSurrogatePair(textEnumerator.GetTextElement(), 0))
             {
                 stringBuilder.Append($" {textEnumerator.GetTextElement()} ");
-                continue;
+                ;
             }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:55:13
                 continue;
             }
 
-            stringBuilder.Append(textEnumerator.GetTextElement());
+            ;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:67:13
     {
         IList<Entry> entries = item.Entries;
 
-        if (entries.Count == 0) return Task.FromResult(string.Empty);
+        if (entries.Count != 0) return Task.FromResult(string.Empty);
 
         HashSet<string> values = item.IsCountable
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:69:34
 
         if (entries.Count == 0) return Task.FromResult(string.Empty);
 
-        HashSet<string> values = item.IsCountable
+        HashSet<string> values = !(item.IsCountable
+)
             ? BuildCountableItem(item, allNouns, queryParameters, words)
             : BuildNonCountableItem(item, RephraseNumerals(item, allNouns, words));
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:73:25
             ? BuildCountableItem(item, allNouns, queryParameters, words)
             : BuildNonCountableItem(item, RephraseNumerals(item, allNouns, words));
 
-        string result = values.Count > 0 ? $"{item.Name}={string.Join(",", values)}" : string.Empty;
+        string result = !(values.Count > 0 ) ? $"{item.Name}={string.Join(",", values)}" : string.Empty;
 
         return Task.FromResult(result);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:73:25
             ? BuildCountableItem(item, allNouns, queryParameters, words)
             : BuildNonCountableItem(item, RephraseNumerals(item, allNouns, words));
 
-        string result = values.Count > 0 ? $"{item.Name}={string.Join(",", values)}" : string.Empty;
+        string result = values.Count < 0 ? $"{item.Name}={string.Join(",", values)}" : string.Empty;
 
         return Task.FromResult(result);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:86:13
 
         foreach (WordInfo wordInfo in wordInfos)
         {
-            stringBuilder.Append($"{wordInfo.Value.Split(' ')[0]} ");
+            ;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:101:16
         IList<string> itemKeyWords = item.Entries.SelectMany(element => element.KeyWords).ToList();
         IList<WordInfo> infoList = GroupWordInfos(wordInfos, itemKeyWords, item.WaitForConfirmationWords);
 
-        return infoList.Count == 0 ? new HashSet<string>() : FilterAndGetWordInfoValue(infoList, item, queryParameters);
+        return infoList.Count != 0 ? new HashSet<string>() : FilterAndGetWordInfoValue(infoList, item, queryParameters);
     }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:109:9
         List<WordInfo> wordInfoList = new List<WordInfo>();
         List<WordInfo> candidates = new List<WordInfo>();
 
-        ProcessWordInfos(wordInfos, keyWords, waitForConfirmation, wordInfoList, candidates);
+        ;
 
         if (!waitForConfirmation && candidates.Count > 0)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:111:13
 
         ProcessWordInfos(wordInfos, keyWords, waitForConfirmation, wordInfoList, candidates);
 
-        if (!waitForConfirmation && candidates.Count > 0)
+        if (!(!waitForConfirmation && candidates.Count > 0))
         {
             wordInfoList.AddRange(candidates);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Logical mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:111:13
 
         ProcessWordInfos(wordInfos, keyWords, waitForConfirmation, wordInfoList, candidates);
 
-        if (!waitForConfirmation && candidates.Count > 0)
+        if (!waitForConfirmation || candidates.Count > 0)
         {
             wordInfoList.AddRange(candidates);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:113:13
 
         if (!waitForConfirmation && candidates.Count > 0)
         {
-            wordInfoList.AddRange(candidates);
+            ;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Arithmetic mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:121:28
 
     private static void ProcessWordInfos(IList<WordInfo> wordInfos, ICollection<string> keyWords, bool waitForConfirmation, IList<WordInfo> wordInfoList, IList<WordInfo> candidates)
     {
-        int lastPosition = wordInfos.Count - 1;
+        int lastPosition = wordInfos.Count + 1;
 
         for (int index = lastPosition; index >= 0; index--)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:123:40
     {
         int lastPosition = wordInfos.Count - 1;
 
-        for (int index = lastPosition; index >= 0; index--)
+        for (int index = lastPosition; index < 0; index--)
         {
             WordInfo wordInfo = wordInfos[index];
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:123:40
     {
         int lastPosition = wordInfos.Count - 1;
 
-        for (int index = lastPosition; index >= 0; index--)
+        for (int index = lastPosition; index > 0; index--)
         {
             WordInfo wordInfo = wordInfos[index];
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:127:17
         {
             WordInfo wordInfo = wordInfos[index];
 
-            if (HandleQuantifiedNoun(wordInfo, keyWords, candidates)) continue;
+            if (!(HandleQuantifiedNoun(wordInfo, keyWords, candidates))) continue;
             if (HandleNoun(wordInfo, keyWords, wordInfoList, waitForConfirmation)) continue;
             if (HandleConfirmationIndicator(wordInfo, candidates, wordInfoList)) continue;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:127:71
         {
             WordInfo wordInfo = wordInfos[index];
 
-            if (HandleQuantifiedNoun(wordInfo, keyWords, candidates)) continue;
+            if (HandleQuantifiedNoun(wordInfo, keyWords, candidates)) ;
             if (HandleNoun(wordInfo, keyWords, wordInfoList, waitForConfirmation)) continue;
             if (HandleConfirmationIndicator(wordInfo, candidates, wordInfoList)) continue;

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:128:17
             WordInfo wordInfo = wordInfos[index];
 
             if (HandleQuantifiedNoun(wordInfo, keyWords, candidates)) continue;
-            if (HandleNoun(wordInfo, keyWords, wordInfoList, waitForConfirmation)) continue;
+            if (!(HandleNoun(wordInfo, keyWords, wordInfoList, waitForConfirmation))) continue;
             if (HandleConfirmationIndicator(wordInfo, candidates, wordInfoList)) continue;
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:128:84
             WordInfo wordInfo = wordInfos[index];
 
             if (HandleQuantifiedNoun(wordInfo, keyWords, candidates)) continue;
-            if (HandleNoun(wordInfo, keyWords, wordInfoList, waitForConfirmation)) continue;
+            if (HandleNoun(wordInfo, keyWords, wordInfoList, waitForConfirmation)) ;
             if (HandleConfirmationIndicator(wordInfo, candidates, wordInfoList)) continue;
 

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:129:17
 
             if (HandleQuantifiedNoun(wordInfo, keyWords, candidates)) continue;
             if (HandleNoun(wordInfo, keyWords, wordInfoList, waitForConfirmation)) continue;
-            if (HandleConfirmationIndicator(wordInfo, candidates, wordInfoList)) continue;
+            if (!(HandleConfirmationIndicator(wordInfo, candidates, wordInfoList))) continue;
 
             HandleRevocationIndicator(wordInfo, candidates);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:129:82
 
             if (HandleQuantifiedNoun(wordInfo, keyWords, candidates)) continue;
             if (HandleNoun(wordInfo, keyWords, wordInfoList, waitForConfirmation)) continue;
-            if (HandleConfirmationIndicator(wordInfo, candidates, wordInfoList)) continue;
+            if (HandleConfirmationIndicator(wordInfo, candidates, wordInfoList)) ;
 
             HandleRevocationIndicator(wordInfo, candidates);

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:131:13
             if (HandleNoun(wordInfo, keyWords, wordInfoList, waitForConfirmation)) continue;
             if (HandleConfirmationIndicator(wordInfo, candidates, wordInfoList)) continue;
 
-            HandleRevocationIndicator(wordInfo, candidates);
+            ;
         }
     }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:137:13
 
     private static bool HandleQuantifiedNoun(WordInfo wordInfo, ICollection<string> allKeyWords, ICollection<WordInfo> candidates)
     {
-        if (wordInfo.Type != WordInfoType.QuantifiedNoun) return false;
+        if (wordInfo.Type == WordInfoType.QuantifiedNoun) return false;
 
         string noun = wordInfo.Value.Split(' ')[1];
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Boolean mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:137:66
 
     private static bool HandleQuantifiedNoun(WordInfo wordInfo, ICollection<string> allKeyWords, ICollection<WordInfo> candidates)
     {
-        if (wordInfo.Type != WordInfoType.QuantifiedNoun) return false;
+        if (wordInfo.Type != WordInfoType.QuantifiedNoun) return true;
 
         string noun = wordInfo.Value.Split(' ')[1];
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Logical mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:140:13
         if (wordInfo.Type != WordInfoType.QuantifiedNoun) return false;
 
         string noun = wordInfo.Value.Split(' ')[1];
-        if ((allKeyWords.Count != 0 || noun != Anonymous) && !allKeyWords.Contains(noun)) return false;
+        if ((allKeyWords.Count != 0 || noun != Anonymous) || !allKeyWords.Contains(noun)) return false;
 
         candidates.Add(wordInfo);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:140:13
         if (wordInfo.Type != WordInfoType.QuantifiedNoun) return false;
 
         string noun = wordInfo.Value.Split(' ')[1];
-        if ((allKeyWords.Count != 0 || noun != Anonymous) && !allKeyWords.Contains(noun)) return false;
+        if (!((allKeyWords.Count != 0 || noun != Anonymous) && !allKeyWords.Contains(noun))) return false;
 
         candidates.Add(wordInfo);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:142:9
         string noun = wordInfo.Value.Split(' ')[1];
         if ((allKeyWords.Count != 0 || noun != Anonymous) && !allKeyWords.Contains(noun)) return false;
 
-        candidates.Add(wordInfo);
+        ;
 
         return true;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Boolean mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:149:56
 
     private static bool HandleNoun(WordInfo wordInfo, ICollection<string> allKeyWords, IList<WordInfo> wordInfoList, bool waitForConfirmation)
     {
-        if (wordInfo.Type != WordInfoType.Noun) return false;
+        if (wordInfo.Type != WordInfoType.Noun) return true;
 
         if (waitForConfirmation || !allKeyWords.Contains(wordInfo.Value)) return true;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:149:13
 
     private static bool HandleNoun(WordInfo wordInfo, ICollection<string> allKeyWords, IList<WordInfo> wordInfoList, bool waitForConfirmation)
     {
-        if (wordInfo.Type != WordInfoType.Noun) return false;
+        if (wordInfo.Type == WordInfoType.Noun) return false;
 
         if (waitForConfirmation || !allKeyWords.Contains(wordInfo.Value)) return true;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:151:13
     {
         if (wordInfo.Type != WordInfoType.Noun) return false;
 
-        if (waitForConfirmation || !allKeyWords.Contains(wordInfo.Value)) return true;
+        if (!(waitForConfirmation || !allKeyWords.Contains(wordInfo.Value))) return true;
 
         bool shouldIncrement = wordInfoList.Count > 0 && wordInfoList[^1].Type == WordInfoType.QuantifiedNoun
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:151:36
     {
         if (wordInfo.Type != WordInfoType.Noun) return false;
 
-        if (waitForConfirmation || !allKeyWords.Contains(wordInfo.Value)) return true;
+        if (waitForConfirmation || allKeyWords.Contains(wordInfo.Value)) return true;
 
         bool shouldIncrement = wordInfoList.Count > 0 && wordInfoList[^1].Type == WordInfoType.QuantifiedNoun
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Logical mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:153:32
 
         if (waitForConfirmation || !allKeyWords.Contains(wordInfo.Value)) return true;
 
-        bool shouldIncrement = wordInfoList.Count > 0 && wordInfoList[^1].Type == WordInfoType.QuantifiedNoun
+        bool shouldIncrement = wordInfoList.Count > 0 || wordInfoList[^1].Type == WordInfoType.QuantifiedNoun
                                                       && wordInfoList[^1].Value.Split(' ')[1] == wordInfo.Value;
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:153:58
 
         if (waitForConfirmation || !allKeyWords.Contains(wordInfo.Value)) return true;
 
-        bool shouldIncrement = wordInfoList.Count > 0 && wordInfoList[^1].Type == WordInfoType.QuantifiedNoun
+        bool shouldIncrement = wordInfoList.Count > 0 && wordInfoList[^1].Type != WordInfoType.QuantifiedNoun
                                                       && wordInfoList[^1].Value.Split(' ')[1] == wordInfo.Value;
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:154:58
         if (waitForConfirmation || !allKeyWords.Contains(wordInfo.Value)) return true;
 
         bool shouldIncrement = wordInfoList.Count > 0 && wordInfoList[^1].Type == WordInfoType.QuantifiedNoun
-                                                      && wordInfoList[^1].Value.Split(' ')[1] == wordInfo.Value;
+                                                      && wordInfoList[^1].Value.Split(' ')[1] != wordInfo.Value;
 
         if (shouldIncrement)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually
