[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:156:13
         bool shouldIncrement = wordInfoList.Count > 0 && wordInfoList[^1].Type == WordInfoType.QuantifiedNoun
                                                       && wordInfoList[^1].Value.Split(' ')[1] == wordInfo.Value;
 
-        if (shouldIncrement)
+        if (!(shouldIncrement))
         {
             WordInfo previousWordInfo = wordInfoList[^1];
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Arithmetic mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:161:41
             WordInfo previousWordInfo = wordInfoList[^1];
             string numberAsString = previousWordInfo.Value.Split(' ')[0];
             long number = Convert.ToInt64(numberAsString);
-            previousWordInfo.Value = $"{number + 1} {wordInfo.Value}";
+            previousWordInfo.Value = $"{number - 1} {wordInfo.Value}";
             return true;
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] String mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:161:38
             WordInfo previousWordInfo = wordInfoList[^1];
             string numberAsString = previousWordInfo.Value.Split(' ')[0];
             long number = Convert.ToInt64(numberAsString);
-            previousWordInfo.Value = $"{number + 1} {wordInfo.Value}";
+            previousWordInfo.Value = $"";
             return true;
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Boolean mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:162:20
             string numberAsString = previousWordInfo.Value.Split(' ')[0];
             long number = Convert.ToInt64(numberAsString);
             previousWordInfo.Value = $"{number + 1} {wordInfo.Value}";
-            return true;
+            return false;
         }
 

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:168:9
         wordInfo.Type = WordInfoType.QuantifiedNoun;
         wordInfo.Value = $"1 {wordInfo.Value}";
 
-        wordInfoList.Add(wordInfo);
+        ;
 
         return true;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Boolean mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:175:73
 
     private static bool HandleConfirmationIndicator(WordInfo wordInfo, ICollection<WordInfo> candidates, ICollection<WordInfo> wordInfoList)
     {
-        if (wordInfo.Type != WordInfoType.ConfirmationIndicator) return false;
+        if (wordInfo.Type != WordInfoType.ConfirmationIndicator) return true;
 
         foreach (WordInfo candidate in candidates) wordInfoList.Add(candidate);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:175:13
 
     private static bool HandleConfirmationIndicator(WordInfo wordInfo, ICollection<WordInfo> candidates, ICollection<WordInfo> wordInfoList)
     {
-        if (wordInfo.Type != WordInfoType.ConfirmationIndicator) return false;
+        if (wordInfo.Type == WordInfoType.ConfirmationIndicator) return false;
 
         foreach (WordInfo candidate in candidates) wordInfoList.Add(candidate);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:177:52
     {
         if (wordInfo.Type != WordInfoType.ConfirmationIndicator) return false;
 
-        foreach (WordInfo candidate in candidates) wordInfoList.Add(candidate);
+        foreach (WordInfo candidate in candidates) ;
 
         candidates.Clear();
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:179:9
 
         foreach (WordInfo candidate in candidates) wordInfoList.Add(candidate);
 
-        candidates.Clear();
+        ;
 
         return true;

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:186:13
 
     private static void HandleRevocationIndicator(WordInfo wordInfo, ICollection<WordInfo> candidates)
     {
-        if (wordInfo.Type == WordInfoType.RevocationIndicator)
+        if (wordInfo.Type != WordInfoType.RevocationIndicator)
         {
             candidates.Clear();
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:188:13
     {
         if (wordInfo.Type == WordInfoType.RevocationIndicator)
         {
-            candidates.Clear();
+            ;
         }
     }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:197:9
         List<string> values = wordInfoList.Select(info => info.Value).ToList();
 
         // A garage for two cars is two garages.
-        values.Reverse();
+        ;
 
         foreach (string value in values)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:208:61
             foreach (Entry entry in entries)
             {
                 long number = NumberConverterHelper.ConvertWordsToNumber(numberAsString);
-                if (IsIncompatible(entry, queryParameters)) continue;
+                if (IsIncompatible(entry, queryParameters)) ;
 
                 return number != 0 ? new HashSet<string>(new[] {Convert.ToString(number)}) : new HashSet<string>();
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:208:21
             foreach (Entry entry in entries)
             {
                 long number = NumberConverterHelper.ConvertWordsToNumber(numberAsString);
-                if (IsIncompatible(entry, queryParameters)) continue;
+                if (!(IsIncompatible(entry, queryParameters))) continue;
 
                 return number != 0 ? new HashSet<string>(new[] {Convert.ToString(number)}) : new HashSet<string>();
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:210:24
                 long number = NumberConverterHelper.ConvertWordsToNumber(numberAsString);
                 if (IsIncompatible(entry, queryParameters)) continue;
 
-                return number != 0 ? new HashSet<string>(new[] {Convert.ToString(number)}) : new HashSet<string>();
+                return number == 0 ? new HashSet<string>(new[] {Convert.ToString(number)}) : new HashSet<string>();
             }
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Boolean mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:219:31
 
     private static bool IsIncompatible(Entry entry, IDictionary<string, string> queryParameters1)
     {
-        bool isIncompatible = false;
+        bool isIncompatible = true;
 
         foreach (KeyValuePair<string, string> parameter in queryParameters1)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:223:17
 
         foreach (KeyValuePair<string, string> parameter in queryParameters1)
         {
-            if (!entry.IncompatibleWith.TryGetValue(parameter.Key, out string incompatibleKeyValue)) continue;
+            if (entry.IncompatibleWith.TryGetValue(parameter.Key, out string incompatibleKeyValue)) continue;
             string parameterValue = parameter.Value.Split('=')[1];
             if (!string.Equals(parameterValue, incompatibleKeyValue, StringComparison.InvariantCultureIgnoreCase)) continue;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:223:102
 
         foreach (KeyValuePair<string, string> parameter in queryParameters1)
         {
-            if (!entry.IncompatibleWith.TryGetValue(parameter.Key, out string incompatibleKeyValue)) continue;
+            if (!entry.IncompatibleWith.TryGetValue(parameter.Key, out string incompatibleKeyValue)) ;
             string parameterValue = parameter.Value.Split('=')[1];
             if (!string.Equals(parameterValue, incompatibleKeyValue, StringComparison.InvariantCultureIgnoreCase)) continue;

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:225:116
         {
             if (!entry.IncompatibleWith.TryGetValue(parameter.Key, out string incompatibleKeyValue)) continue;
             string parameterValue = parameter.Value.Split('=')[1];
-            if (!string.Equals(parameterValue, incompatibleKeyValue, StringComparison.InvariantCultureIgnoreCase)) continue;
+            if (!string.Equals(parameterValue, incompatibleKeyValue, StringComparison.InvariantCultureIgnoreCase)) ;
             isIncompatible = true;
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:225:17
         {
             if (!entry.IncompatibleWith.TryGetValue(parameter.Key, out string incompatibleKeyValue)) continue;
             string parameterValue = parameter.Value.Split('=')[1];
-            if (!string.Equals(parameterValue, incompatibleKeyValue, StringComparison.InvariantCultureIgnoreCase)) continue;
+            if (string.Equals(parameterValue, incompatibleKeyValue, StringComparison.InvariantCultureIgnoreCase)) continue;
             isIncompatible = true;
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Boolean mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:226:30
             if (!entry.IncompatibleWith.TryGetValue(parameter.Key, out string incompatibleKeyValue)) continue;
             string parameterValue = parameter.Value.Split('=')[1];
             if (!string.Equals(parameterValue, incompatibleKeyValue, StringComparison.InvariantCultureIgnoreCase)) continue;
-            isIncompatible = true;
+            isIncompatible = false;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Block removal mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:233:5
     }
 
     private static HashSet<string> BuildNonCountableItem(Item item, IList<string> words)
-    {
-        return PickupMultipleEntryKeys(item.Entries, words);
-    }
+    {}
 
     private static HashSet<string> PickupMultipleEntryKeys(IList<Entry> entries, IList<string> words)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:247:21
             foreach (string word in words)
             {
                 double similarity = GetMaxSimilarity(entry.KeyWords, word);
-                if (similarity <= maxSimilarity) continue;
+                if (similarity > maxSimilarity) continue;
                 maxSimilarity = similarity;
             }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:247:21
             foreach (string word in words)
             {
                 double similarity = GetMaxSimilarity(entry.KeyWords, word);
-                if (similarity <= maxSimilarity) continue;
+                if (!(similarity <= maxSimilarity)) continue;
                 maxSimilarity = similarity;
             }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:251:13
                 maxSimilarity = similarity;
             }
 
-            entrySimilarity.Add(entry, (int) (maxSimilarity * 100));
+            ;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Arithmetic mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:251:47
                 maxSimilarity = similarity;
             }
 
-            entrySimilarity.Add(entry, (int) (maxSimilarity * 100));
+            entrySimilarity.Add(entry, (int) (maxSimilarity / 100));
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:254:91
             entrySimilarity.Add(entry, (int) (maxSimilarity * 100));
         }
 
-        Dictionary<Entry, int> topEntrySimilarity = entrySimilarity.Where(keyValuePair => keyValuePair.Value >= 75)
+        Dictionary<Entry, int> topEntrySimilarity = entrySimilarity.Where(keyValuePair => keyValuePair.Value < 75)
             .OrderByDescending(keyValuePair => keyValuePair.Value)
             .ToDictionary(keyValuePair => keyValuePair.Key, pair => pair.Value);
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:254:91
             entrySimilarity.Add(entry, (int) (maxSimilarity * 100));
         }
 
-        Dictionary<Entry, int> topEntrySimilarity = entrySimilarity.Where(keyValuePair => keyValuePair.Value >= 75)
+        Dictionary<Entry, int> topEntrySimilarity = entrySimilarity.Where(keyValuePair => keyValuePair.Value > 75)
             .OrderByDescending(keyValuePair => keyValuePair.Value)
             .ToDictionary(keyValuePair => keyValuePair.Key, pair => pair.Value);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:258:13
             .OrderByDescending(keyValuePair => keyValuePair.Value)
             .ToDictionary(keyValuePair => keyValuePair.Key, pair => pair.Value);
 
-        if (!topEntrySimilarity.Any()) return new HashSet<string>();
+        if (topEntrySimilarity.Any()) return new HashSet<string>();
 
         // Get all entries with the Immiscible attribute
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:265:13
             => keyValuePair.Key.Immiscible).ToList();
 
         // If all top similar entries are Immiscible, return the one with the highest similarity
-        if (immiscibleEntries.Count == topEntrySimilarity.Count)
+        if (immiscibleEntries.Count != topEntrySimilarity.Count)
         {
             Entry immiscibleEntry = immiscibleEntries[0].Key;
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Block removal mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:266:9
 
         // If all top similar entries are Immiscible, return the one with the highest similarity
         if (immiscibleEntries.Count == topEntrySimilarity.Count)
-        {
-            Entry immiscibleEntry = immiscibleEntries[0].Key;
-            return new HashSet<string>(new[] {immiscibleEntry.Key});
-        }
+        {}
 
         // If there are any Immiscible entries and there's more than one entry with high similarity, remove them

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:272:13
         }
 
         // If there are any Immiscible entries and there's more than one entry with high similarity, remove them
-        if (immiscibleEntries.Any() && topEntrySimilarity.Count > 1)
+        if (!(immiscibleEntries.Any() && topEntrySimilarity.Count > 1))
         {
             foreach (KeyValuePair<Entry, int> immiscibleEntry in immiscibleEntries)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:272:40
         }
 
         // If there are any Immiscible entries and there's more than one entry with high similarity, remove them
-        if (immiscibleEntries.Any() && topEntrySimilarity.Count > 1)
+        if (immiscibleEntries.Any() && topEntrySimilarity.Count < 1)
         {
             foreach (KeyValuePair<Entry, int> immiscibleEntry in immiscibleEntries)
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:276:17
         {
             foreach (KeyValuePair<Entry, int> immiscibleEntry in immiscibleEntries)
             {
-                topEntrySimilarity.Remove(immiscibleEntry.Key);
+                ;
             }
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:284:16
         Entry topEntry = topEntrySimilarity.First().Key;
 
         // If it's exclusive, return the key
-        return topEntry.Exclusive
+        return !(topEntry.Exclusive
+)
             ? new HashSet<string>(new[] {topEntry.Key})
             // Otherwise, return all keys with the similarity greater than 75%
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:297:17
         foreach (string word in words)
         {
             double similarity = GetSimilarityHelper.GetSimilarity(word, term);
-            if (similarity > maxSimilarity) maxSimilarity = similarity;
+            if (similarity < maxSimilarity) maxSimilarity = similarity;
             if (maxSimilarity.CompareTo(1) == 0) break;
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Negate expression
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:297:17
         foreach (string word in words)
         {
             double similarity = GetSimilarityHelper.GetSimilarity(word, term);
-            if (similarity > maxSimilarity) maxSimilarity = similarity;
+            if (!(similarity > maxSimilarity)) maxSimilarity = similarity;
             if (maxSimilarity.CompareTo(1) == 0) break;
         }
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Killed] Equality mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:298:17
         {
             double similarity = GetSimilarityHelper.GetSimilarity(word, term);
             if (similarity > maxSimilarity) maxSimilarity = similarity;
-            if (maxSimilarity.CompareTo(1) == 0) break;
+            if (maxSimilarity.CompareTo(1) != 0) break;
         }
 
killedBy: UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually; UnitTest.Core.Domains.QueryStrings.UseCases.BuildQueryStringUseCaseTest.SuccessToBuildQueryStringManually

[Survived] Statement mutation
Domains/QueryStrings/UseCases/ManualQueryBuilderHelper.cs:298:50
         {
             double similarity = GetSimilarityHelper.GetSimilarity(word, term);
             if (similarity > maxSimilarity) maxSimilarity = similarity;
-            if (maxSimilarity.CompareTo(1) == 0) break;
+            if (maxSimilarity.CompareTo(1) == 0) ;
         }
 
