[Killed] Statement mutation
Domains/QueryStructures/Commands/AiSettingsCommand.cs:27:9
         Temperature = temperature;
         MaxTokens = maxTokens;
         PromptTemplate = promptTemplate;
-        Validator.ValidateAndThrow(this);
+        ;
     }
     
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithInvalidUsagePercentage; UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithNullUsagePercentage; UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithNullApiKey
