[Killed] Statement mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:11:9
 {
     public AiSettingsCommandValidator()
     {
-        RuleFor(command => command.UsagePercentage)
-            .Cascade(CascadeMode.Stop)
-            .NotNull()
-            .WithMessage("ValidationUsagePercentageIsNullOrEmpty")
-            .Must(ArgumentChecker.IsPercentage)
-            .WithMessage("ValidationUsagePercentageIsNotPercentage");
+        ;
 
         RuleFor(command => command.ApiKey)
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithInvalidUsagePercentage; UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithNullUsagePercentage

[Killed] Statement mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:18:9
             .Must(ArgumentChecker.IsPercentage)
             .WithMessage("ValidationUsagePercentageIsNotPercentage");
 
-        RuleFor(command => command.ApiKey)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationApiKeyIsNullOrEmpty")
-            .When(IsAiApplicable());
+        ;
 
         RuleFor(command => command.Model)
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithNullApiKey

[Killed] String mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:21:26
         RuleFor(command => command.ApiKey)
             .Cascade(CascadeMode.Stop)
             .NotEmpty()
-            .WithMessage("ValidationApiKeyIsNullOrEmpty")
+            .WithMessage("")
             .When(IsAiApplicable());
 
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithInvalidUsagePercentage; UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithNullUsagePercentage; UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.SuccessToValidateAiSettingsWithValidParameters

[Survived] Statement mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:24:9
             .WithMessage("ValidationApiKeyIsNullOrEmpty")
             .When(IsAiApplicable());
 
-        RuleFor(command => command.Model)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationModelIsNullOrEmpty")
-            .When(IsAiApplicable());
+        ;
 
         RuleFor(command => command.Temperature)

[Killed] Statement mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:30:9
             .WithMessage("ValidationModelIsNullOrEmpty")
             .When(IsAiApplicable());
 
-        RuleFor(command => command.Temperature)
-            .Cascade(CascadeMode.Stop)
-            .NotNull()
-            .WithMessage("ValidationTemperatureIsNullOrEmpty")
-            .Must(ArgumentChecker.IsFloat)
-            .WithMessage("ValidationTemperatureIsNotFloat")
-            .When(IsAiApplicable());
+        ;
 
         RuleFor(command => command.MaxTokens)
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithNullApiKey

[Killed] String mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:33:26
         RuleFor(command => command.Temperature)
             .Cascade(CascadeMode.Stop)
             .NotNull()
-            .WithMessage("ValidationTemperatureIsNullOrEmpty")
+            .WithMessage("")
             .Must(ArgumentChecker.IsFloat)
             .WithMessage("ValidationTemperatureIsNotFloat")
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithInvalidUsagePercentage; UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithNullUsagePercentage; UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.SuccessToValidateAiSettingsWithValidParameters

[Survived] Statement mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:38:9
             .WithMessage("ValidationTemperatureIsNotFloat")
             .When(IsAiApplicable());
 
-        RuleFor(command => command.MaxTokens)
-            .Cascade(CascadeMode.Stop)
-            .NotNull()
-            .WithMessage("ValidationMaxTokensIsNullOrEmpty")
-            .Must(ArgumentChecker.IsInteger)
-            .WithMessage("ValidationMaxTokensIsNotInteger")
-            .Must(maxTokens => int.Parse(maxTokens) <= 4096)
-            .WithMessage("ValidationMaxTokensExceedsLimit")
-            .When(IsAiApplicable());
+        ;
 
         RuleFor(command => command.PromptTemplate)

[Killed] String mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:43:26
             .NotNull()
             .WithMessage("ValidationMaxTokensIsNullOrEmpty")
             .Must(ArgumentChecker.IsInteger)
-            .WithMessage("ValidationMaxTokensIsNotInteger")
+            .WithMessage("")
             .Must(maxTokens => int.Parse(maxTokens) <= 4096)
             .WithMessage("ValidationMaxTokensExceedsLimit")
killedBy: UnitTest.Core.Domains.QueryStructures.UseCases.RegisterQueryStructureUseCaseTest.SuccessToRegisterQueryStructure

[Killed] Equality mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:44:32
             .WithMessage("ValidationMaxTokensIsNullOrEmpty")
             .Must(ArgumentChecker.IsInteger)
             .WithMessage("ValidationMaxTokensIsNotInteger")
-            .Must(maxTokens => int.Parse(maxTokens) <= 4096)
+            .Must(maxTokens => int.Parse(maxTokens) > 4096)
             .WithMessage("ValidationMaxTokensExceedsLimit")
             .When(IsAiApplicable());
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.SuccessToValidateAiSettingsWithValidParameters

[Survived] Equality mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:44:32
             .WithMessage("ValidationMaxTokensIsNullOrEmpty")
             .Must(ArgumentChecker.IsInteger)
             .WithMessage("ValidationMaxTokensIsNotInteger")
-            .Must(maxTokens => int.Parse(maxTokens) <= 4096)
+            .Must(maxTokens => int.Parse(maxTokens) < 4096)
             .WithMessage("ValidationMaxTokensExceedsLimit")
             .When(IsAiApplicable());

[Killed] String mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:45:26
             .Must(ArgumentChecker.IsInteger)
             .WithMessage("ValidationMaxTokensIsNotInteger")
             .Must(maxTokens => int.Parse(maxTokens) <= 4096)
-            .WithMessage("ValidationMaxTokensExceedsLimit")
+            .WithMessage("")
             .When(IsAiApplicable());
 
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.RegisterQueryStructureCommandValidatorTest.SuccessToRegisterQueryStructureCommand; UnitTest.Core.Domains.QueryStructures.Commands.RegisterQueryStructureCommandValidatorTest.FailToRegisterQueryStructureWithNullParameters

[Survived] Statement mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:48:9
             .WithMessage("ValidationMaxTokensExceedsLimit")
             .When(IsAiApplicable());
 
-        RuleFor(command => command.PromptTemplate)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationPromptTemplateIsNullOrEmpty")
-            .When(IsAiApplicable());
+        ;
     }
 

[Killed] String mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:51:26
         RuleFor(command => command.PromptTemplate)
             .Cascade(CascadeMode.Stop)
             .NotEmpty()
-            .WithMessage("ValidationPromptTemplateIsNullOrEmpty")
+            .WithMessage("")
             .When(IsAiApplicable());
     }
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithInvalidUsagePercentage; UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithNullUsagePercentage; UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.SuccessToValidateAiSettingsWithValidParameters

[Killed] Negate expression
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:59:17
     {
         return command =>
         {
-            if (string.IsNullOrEmpty(command.UsagePercentage)) return false;
+            if (!(string.IsNullOrEmpty(command.UsagePercentage))) return false;
             return int.TryParse(command.UsagePercentage, out int usagePercentage) && usagePercentage > 0;
         };
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithNullApiKey

[Survived] Boolean mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:59:71
     {
         return command =>
         {
-            if (string.IsNullOrEmpty(command.UsagePercentage)) return false;
+            if (string.IsNullOrEmpty(command.UsagePercentage)) return true;
             return int.TryParse(command.UsagePercentage, out int usagePercentage) && usagePercentage > 0;
         };

[Killed] Equality mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:60:86
         return command =>
         {
             if (string.IsNullOrEmpty(command.UsagePercentage)) return false;
-            return int.TryParse(command.UsagePercentage, out int usagePercentage) && usagePercentage > 0;
+            return int.TryParse(command.UsagePercentage, out int usagePercentage) && usagePercentage < 0;
         };
     }
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.AiSettingsCommandValidatorTest.FailToValidateAiSettingsWithNullApiKey

[Survived] Logical mutation
Domains/QueryStructures/Commands/AiSettingsCommandValidator.cs:60:20
         return command =>
         {
             if (string.IsNullOrEmpty(command.UsagePercentage)) return false;
-            return int.TryParse(command.UsagePercentage, out int usagePercentage) && usagePercentage > 0;
+            return int.TryParse(command.UsagePercentage, out int usagePercentage) || usagePercentage > 0;
         };
     }
