[Killed] Statement mutation
Domains/QueryStructures/Commands/RegisterQueryStructureCommand.cs:23:9
         Name = name;
         Description = description;
         AiSettings = aiSettings;
-        Validator.ValidateAndThrow(this);
+        ;
     }
 
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.RegisterQueryStructureCommandValidatorTest.FailToRegisterQueryStructureWithNullParameters
