[Killed] String mutation
Domains/QueryStructures/Commands/RegisterQueryStructureCommandValidator.cs:19:26
         RuleFor(command => command.Name)
             .Cascade(CascadeMode.Stop)
             .NotEmpty()
-            .WithMessage("ValidationNameIsNullOrEmpty");
+            .WithMessage("");
 
         RuleFor(command => command.Description)
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.RegisterQueryStructureCommandValidatorTest.SuccessToRegisterQueryStructureCommand; UnitTest.Core.Domains.QueryStructures.Commands.RegisterQueryStructureCommandValidatorTest.FailToRegisterQueryStructureWithNullParameters

[Killed] Statement mutation
Domains/QueryStructures/Commands/RegisterQueryStructureCommandValidator.cs:26:9
             .NotEmpty()
             .WithMessage("ValidationDescriptionIsNullOrEmpty");
 
-        RuleFor(command => command.AiSettings)
-            .Cascade(CascadeMode.Stop)
-            .NotNull()
-            .WithMessage("ValidationAiSettingsIsNull")
-            .SetValidator(AiSettingsCommandValidator);
+        ;
     }
 }
killedBy: UnitTest.Core.Domains.QueryStructures.Commands.RegisterQueryStructureCommandValidatorTest.FailToRegisterQueryStructureWithNullParameters
