[Killed] Block removal mutation
Domains/QueryStructures/UseCases/RegisterQueryStructureUseCase.cs:17:5
     private readonly IGetDateTime _getDateTime;
 
     public RegisterQueryStructureUseCase(IServiceResolver serviceResolver)
-    {
-        ArgumentValidator.CheckNull(serviceResolver, nameof(serviceResolver));
-        _registerQueryStructureGateway = serviceResolver.Resolve<IRegisterQueryStructureGateway>();
-        _getDateTime = serviceResolver.Resolve<IGetDateTime>();
-    }
+    {}
 
     public async Task<QueryStructure> ExecuteAsync(RegisterQueryStructureCommand command)
killedBy: UnitTest.Core.Domains.ServiceResolverInjectionTest.FailToCreateAnInstanceIfServiceResolverIsNotSupplied

[Survived] String mutation
Domains/QueryStructures/UseCases/RegisterQueryStructureUseCase.cs:35:91
                 UsagePercentage = byte.Parse(command.AiSettings.UsagePercentage),
                 ApiKey = command.AiSettings.ApiKey,
                 Model = command.AiSettings.Model,
-                Temperature = float.Parse(command.AiSettings.Temperature, new CultureInfo("en-US")),
+                Temperature = float.Parse(command.AiSettings.Temperature, new CultureInfo("")),
                 MaxTokens = int.Parse(command.AiSettings.MaxTokens),
                 PromptTemplate = command.AiSettings.PromptTemplate
