[Killed] Equality mutation
querystring-composer-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:49:13
 
     private static void AddDirection(IList<string> sanitized, string value)
     {
-        if (sanitized.Count <= 0 || IsDirectionCommand(sanitized[^1])) return;
+        if (sanitized.Count < 0 || IsDirectionCommand(sanitized[^1])) return;
         sanitized[^1] = string.Concat(sanitized[^1], ":", value.ToUpper());
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Negate expression
querystring-composer-api-netcore/EntryPoint.WebApi/Commons/OrderByHelper.cs:49:13
 
     private static void AddDirection(IList<string> sanitized, string value)
     {
-        if (sanitized.Count <= 0 || IsDirectionCommand(sanitized[^1])) return;
+        if (!(sanitized.Count <= 0 || IsDirectionCommand(sanitized[^1]))) return;
         sanitized[^1] = string.Concat(sanitized[^1], ":", value.ToUpper());
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders
