[Killed] String mutation
querystring-composer-api-netcore/EntryPoint.WebApi/Commons/PageRequestHelper.cs:27:13
 
     private static Sort GetSort(string rawOrderBy)
     {
-        if (string.IsNullOrWhiteSpace(rawOrderBy)) return Sort.Unsorted;
+        if ((rawOrderBy!=null)) return Sort.Unsorted;
 
         string orderBy = BlankSpaces().Replace(rawOrderBy, "");
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort
