[Killed] Block removal mutation
Domains/QueryStrings/EntryPoints/BuildQueryStringApiMethod.cs:23:5
     private readonly IBuildQueryStringController _controller;
     
     public BuildQueryStringApiMethod(IBuildQueryStringController controller)
-    {
-        _controller = ArgumentValidator.CheckNull(controller, nameof(controller));
-    }
+    {}
     
     [SwaggerOperation(
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.QueryString.EntryPoints.BuildQueryStringApiMethodTest.PostBuildQueryString_ReturnHttpStatusCode200

[Killed] Block removal mutation
Domains/QueryStrings/EntryPoints/BuildQueryStringApiMethod.cs:38:5
     [ProducesResponseType(typeof(ResponseStatus), (int) HttpStatusCode.InternalServerError)]
     [HttpPost("{queryName}")]
     public async Task<IActionResult> BuildQueryString(BuildQueryStringRequest request)
-    {
-        return await _controller.ExecuteAsync(request);
-    }
+    {}
 }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.QueryString.EntryPoints.BuildQueryStringApiMethodTest.PostBuildQueryString_ReturnHttpStatusCode200
