[Killed] Block removal mutation
Domains/QueryStrings/EntryPoints/BuildQueryStringController.cs:22:5
     private readonly IBuildQueryStringUseCase _useCase;
 
     public BuildQueryStringController(IWebRequest webRequest, IBuildQueryStringUseCase useCase)
-    {
-        _webRequest = ArgumentValidator.CheckNull(webRequest, nameof(webRequest));
-        _useCase = ArgumentValidator.CheckNull(useCase, nameof(useCase));
-    }
+    {}
 
     public async Task<IActionResult> ExecuteAsync(BuildQueryStringRequest request)
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.QueryString.EntryPoints.BuildQueryStringApiMethodTest.PostBuildQueryString_ReturnHttpStatusCode200

[Killed] Block removal mutation
Domains/QueryStrings/EntryPoints/BuildQueryStringController.cs:28:5
     }
 
     public async Task<IActionResult> ExecuteAsync(BuildQueryStringRequest request)
-    {
-        BuildQueryStringCommand command = new BuildQueryStringCommand
-        (
-            clientUid: _webRequest.ClientUid,
-            queryName: request.QueryName,
-            searchTerms: request.Body.SearchTerms
-        );
-        Output output = await _useCase.ExecuteAsync(command);
-        OutputResponse response = OutputResponsePresenter.Map(output);
-        
-        return await ResponseBuilder.BuildResponse(HttpStatusCode.OK, response);
-    }
+    {}
 }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.QueryString.EntryPoints.BuildQueryStringApiMethodTest.PostBuildQueryString_ReturnHttpStatusCode200
