[NoCoverage] Object initializer mutation
Domains/QueryStrings/Presenters/OutputResponsePresenter.cs:10:16
 {
     public static OutputResponse Map(Output output)
     {
-        return new OutputResponse
-        {
-            ClientUid = output.ClientUid,
-            QueryName = output.QueryName,
-            SearchTerms = output.SearchTerms,
-            QueryString = output.QueryString,
-            CreatedByAi = output.CreatedByAi,
-            CreatedAt = output.CreatedAt.ToString("yyyy-MM-ddTHH:mm:ss.fff"),
-        };
+        return new OutputResponse
+{};
     }
 }

[NoCoverage] String mutation
Domains/QueryStrings/Presenters/OutputResponsePresenter.cs:17:51
             SearchTerms = output.SearchTerms,
             QueryString = output.QueryString,
             CreatedByAi = output.CreatedByAi,
-            CreatedAt = output.CreatedAt.ToString("yyyy-MM-ddTHH:mm:ss.fff"),
+            CreatedAt = output.CreatedAt.ToString(""),
         };
     }
