[Killed] Object initializer mutation
EntryPoint.WebApi/Commons/Controllers/ResponseBuilder.cs:11:37
 {
     public static Task<IActionResult> BuildResponse(HttpStatusCode httpStatusCode, object payload = null)
     {
-        ObjectResult objectResult = new ObjectResult(payload)
-        {
-            Formatters = [],
-            DeclaredType = payload?.GetType(),
-            StatusCode = (int) httpStatusCode
-        };
+        ObjectResult objectResult = new ObjectResult(payload)
+{};
 
         return Task.FromResult<IActionResult>(objectResult);
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.QueryString.EntryPoints.BuildQueryStringApiMethodTest.SuccessToBuildQueryString; IntegrationTest.EntryPoint.WebApi.Domains.QueryString.EntryPoints.BuildQueryStringApiMethodTest.FailToBuildQueryStringIfSearchTermsIsNotProvided; IntegrationTest.EntryPoint.WebApi.Domains.QueryString.EntryPoints.BuildQueryStringApiMethodTest.FailToBuildQueryStringIfUnexpectedErrorOccurs
