[Killed] Block removal mutation
EntryPoint.WebApi/Commons/Filters/AddCorrelationIdHeaderAttribute.cs:14:5
 public sealed class AddCorrelationIdHeaderAttribute : ResultFilterAttribute
 {
     public override void OnResultExecuting(ResultExecutingContext context)
-    {
-        context.HttpContext.Response.Headers[CorrelationIdHeaderReader.HeaderName] = GetCorrelationId(context);
-    }
+    {}
 
     private static string GetCorrelationId(ActionContext context)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToGenerateCorrelationIdIfItIsMissingFromRequestHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeadersEvenIfRequestDoesNotContainCorrelationId
