[Killed] Logical mutation
main/EntryPoint.WebApi/Commons/OrderByHelper.cs:55:16
 
     private static bool IsDirectionCommand(string value)
     {
-        return DescendingDirection.Equals(value, StringComparison.InvariantCultureIgnoreCase) ||
-               value.EndsWith($":{AscendingDirection}", StringComparison.InvariantCultureIgnoreCase) ||
+        return DescendingDirection.Equals(value, StringComparison.InvariantCultureIgnoreCase) &&
+               value.EndsWith($":{AscendingDirection}", StringComparison.InvariantCultureIgnoreCase) ||
                value.EndsWith($":{DescendingDirection}", StringComparison.InvariantCultureIgnoreCase);
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Logical mutation
main/EntryPoint.WebApi/Commons/OrderByHelper.cs:55:16
 
     private static bool IsDirectionCommand(string value)
     {
-        return DescendingDirection.Equals(value, StringComparison.InvariantCultureIgnoreCase) ||
-               value.EndsWith($":{AscendingDirection}", StringComparison.InvariantCultureIgnoreCase) ||
-               value.EndsWith($":{DescendingDirection}", StringComparison.InvariantCultureIgnoreCase);
+        return DescendingDirection.Equals(value, StringComparison.InvariantCultureIgnoreCase) ||
+               value.EndsWith($":{AscendingDirection}", StringComparison.InvariantCultureIgnoreCase) &&
+               value.EndsWith($":{DescendingDirection}", StringComparison.InvariantCultureIgnoreCase);
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] String mutation
main/EntryPoint.WebApi/Commons/OrderByHelper.cs:56:31
     private static bool IsDirectionCommand(string value)
     {
         return DescendingDirection.Equals(value, StringComparison.InvariantCultureIgnoreCase) ||
-               value.EndsWith($":{AscendingDirection}", StringComparison.InvariantCultureIgnoreCase) ||
+               value.EndsWith($"", StringComparison.InvariantCultureIgnoreCase) ||
                value.EndsWith($":{DescendingDirection}", StringComparison.InvariantCultureIgnoreCase);
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] String mutation
main/EntryPoint.WebApi/Commons/OrderByHelper.cs:57:31
     {
         return DescendingDirection.Equals(value, StringComparison.InvariantCultureIgnoreCase) ||
                value.EndsWith($":{AscendingDirection}", StringComparison.InvariantCultureIgnoreCase) ||
-               value.EndsWith($":{DescendingDirection}", StringComparison.InvariantCultureIgnoreCase);
+               value.EndsWith($"", StringComparison.InvariantCultureIgnoreCase);
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders
