[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
main/EntryPoint.WebApi/Commons/PageRequestHelper.cs:37:30
         [
             .. strings
                 .Select(it => it.SubstringBefore(DirectionSeparator))
-                .Where(it => !string.IsNullOrWhiteSpace(it))
+                .Where(it => string.IsNullOrWhiteSpace(it))
         ];
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort

[Killed] Conditional (true) mutation
main/EntryPoint.WebApi/Commons/PageRequestHelper.cs:40:16
                 .Where(it => !string.IsNullOrWhiteSpace(it))
         ];
 
-        return properties.Count == 0 ? Sort.Unsorted : Sort.By([.. properties.Select(property => GetOrder(property, orderBy))]);
+        return (true?Sort.Unsorted :Sort.By([.. properties.Select(property => GetOrder(property, orderBy))]));
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort

[Survived] Conditional (false) mutation
main/EntryPoint.WebApi/Commons/PageRequestHelper.cs:40:16
                 .Where(it => !string.IsNullOrWhiteSpace(it))
         ];
 
-        return properties.Count == 0 ? Sort.Unsorted : Sort.By([.. properties.Select(property => GetOrder(property, orderBy))]);
+        return (false?Sort.Unsorted :Sort.By([.. properties.Select(property => GetOrder(property, orderBy))]));
     }
 
