[Killed] Block removal mutation
Domains/QueryStrings/EntryPoints/BuildQueryStringController.cs:22:5
     private readonly IBuildQueryStringUseCase _useCase = ArgumentValidator.CheckNull(useCase, nameof(useCase));
 
     public async Task<IActionResult> ExecuteAsync(BuildQueryStringRequest request)
-    {
-        BuildQueryStringCommand command = new BuildQueryStringCommand
-        (
-            clientUid: _webRequest.ClientUid,
-            queryName: request.QueryName,
-            searchTerms: request.Body.SearchTerms
-        );
-        
-        Output output = await _useCase.ExecuteAsync(command);
-        OutputResponse response = OutputResponsePresenter.Map(output);
-        
-        return await ResponseBuilder.BuildResponse(HttpStatusCode.OK, response);
-    }
+    {}
 }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.QueryString.EntryPoints.BuildQueryStringApiMethodTest.SuccessToBuildQueryString; IntegrationTest.EntryPoint.WebApi.Domains.QueryString.EntryPoints.BuildQueryStringApiMethodTest.FailToBuildQueryStringIfSearchTermsIsNotProvided; IntegrationTest.EntryPoint.WebApi.Domains.QueryString.EntryPoints.BuildQueryStringApiMethodTest.FailToBuildQueryStringIfUnexpectedErrorOccurs
