[Killed] Object initializer mutation
Domains/QueryStrings/Presenters/OutputResponsePresenter.cs:10:16
 {
     public static OutputResponse Map(Output output)
     {
-        return new OutputResponse
-        {
-            ClientUid = output.ClientUid,
-            QueryName = output.QueryName,
-            SearchTerms = output.SearchTerms,
-            QueryString = output.QueryString,
-            CreatedByAi = output.CreatedByAi ? "Yes" : "No",
-            CreatedAt = output.CreatedAt.ToString("yyyy-MM-ddTHH:mm:ss.fff"),
-        };
+        return new OutputResponse
+{};
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.QueryString.EntryPoints.BuildQueryStringApiMethodTest.SuccessToBuildQueryString

[Killed] Conditional (true) mutation
Domains/QueryStrings/Presenters/OutputResponsePresenter.cs:16:27
             QueryName = output.QueryName,
             SearchTerms = output.SearchTerms,
             QueryString = output.QueryString,
-            CreatedByAi = output.CreatedByAi ? "Yes" : "No",
+            CreatedByAi = (true?"Yes" :"No"),
             CreatedAt = output.CreatedAt.ToString("yyyy-MM-ddTHH:mm:ss.fff"),
         };
killedBy: IntegrationTest.EntryPoint.WebApi.Domains.QueryString.EntryPoints.BuildQueryStringApiMethodTest.SuccessToBuildQueryString

[Survived] Conditional (false) mutation
Domains/QueryStrings/Presenters/OutputResponsePresenter.cs:16:27
             QueryName = output.QueryName,
             SearchTerms = output.SearchTerms,
             QueryString = output.QueryString,
-            CreatedByAi = output.CreatedByAi ? "Yes" : "No",
+            CreatedByAi = (false?"Yes" :"No"),
             CreatedAt = output.CreatedAt.ToString("yyyy-MM-ddTHH:mm:ss.fff"),
         };
