[Killed] Block removal mutation
Domains/QueryStrings/Providers/BuildQueryStringWithAiProvider.cs:22:5
     private readonly AsyncRetryPolicy _retryPolicy = Policy.Handle<Exception>().WaitAndRetryAsync(getRetryPolicy.Attempts, _ => TimeSpan.FromSeconds(getRetryPolicy.IntervalSeconds));
 
     public async Task<Optional<string>> ExecuteAsync(QueryStructure queryStructure, string searchTerm)
-    {
-        return await _retryPolicy.ExecuteAsync(async () => await GetCompletionAsync(queryStructure, searchTerm));
-    }
+    {}
 
     private async Task<Optional<string>> GetCompletionAsync(QueryStructure queryStructure, string searchTerm)
killedBy: Integration.Infra.HttpClient.Domains.QueryStrings.Providers.BuildQueryStringWithAiProviderTest.FailToBuildQueryStringWithAiProviderWhenAiResponseIsInvalid; Integration.Infra.HttpClient.Domains.QueryStrings.Providers.BuildQueryStringWithAiProviderTest.SuccessfulToBuildQueryStringWithAiProvider

[Survived] Linq method mutation (FirstOrDefault() to First())
Domains/QueryStrings/Providers/BuildQueryStringWithAiProvider.cs:38:55
         
         string apiKey = $"Bearer {queryStructure.AiSettings.ApiKey}";
         CompletionResponse completionResponse = await _openAiApiClient.GetCompletionAsync(apiKey, request);
-        string response = completionResponse?.Choices?.FirstOrDefault()?.Text?.SubstringAfter("?").Trim();
+        string response = completionResponse?.Choices?.First()?.Text?.SubstringAfter("?").Trim();
         
         return string.IsNullOrWhiteSpace(response) ? Optional<string>.Empty() : Optional<string>.Of($"?{response}");

[Killed] Conditional (true) mutation
Domains/QueryStrings/Providers/BuildQueryStringWithAiProvider.cs:40:16
         CompletionResponse completionResponse = await _openAiApiClient.GetCompletionAsync(apiKey, request);
         string response = completionResponse?.Choices?.FirstOrDefault()?.Text?.SubstringAfter("?").Trim();
         
-        return string.IsNullOrWhiteSpace(response) ? Optional<string>.Empty() : Optional<string>.Of($"?{response}");
+        return (true?Optional<string>.Empty() :Optional<string>.Of($"?{response}"));
     }
 
killedBy: Integration.Infra.HttpClient.Domains.QueryStrings.Providers.BuildQueryStringWithAiProviderTest.SuccessfulToBuildQueryStringWithAiProvider

[Killed] Conditional (false) mutation
Domains/QueryStrings/Providers/BuildQueryStringWithAiProvider.cs:40:16
         CompletionResponse completionResponse = await _openAiApiClient.GetCompletionAsync(apiKey, request);
         string response = completionResponse?.Choices?.FirstOrDefault()?.Text?.SubstringAfter("?").Trim();
         
-        return string.IsNullOrWhiteSpace(response) ? Optional<string>.Empty() : Optional<string>.Of($"?{response}");
+        return (false?Optional<string>.Empty() :Optional<string>.Of($"?{response}"));
     }
 
killedBy: Integration.Infra.HttpClient.Domains.QueryStrings.Providers.BuildQueryStringWithAiProviderTest.FailToBuildQueryStringWithAiProviderWhenAiResponseIsInvalid
