[Killed] Block removal mutation
Infra.MongoDB/Commons/Connection/ConnectionFactory.cs:15:5
     }
 
     public IMongoClient GetClient()
-    {
-        return new MongoClient(_connectionString);
-    }
+    {}
 
     public IMongoDatabase GetDatabase(string databaseName)
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.SuccessfulToRegisterClientWhenClientNotExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.SuccessfulToRegisterQueryStructureWhenQueryStructureNotExists
