[Killed] Negate expression
Infra.MongoDB/Commons/Extensions/MongoCollectionQueryByPageExtensions.cs:52:16
     private static long GetTotalOfElements(IReadOnlyList<AggregateFacetResults> aggregation)
     {
         AggregateFacetResult? aggregateFacetResult = aggregation[0].Facets.FirstOrDefault(element => element.Name == "count");
-        return aggregateFacetResult is not null && aggregateFacetResult.Output<AggregateCountResult>().Count != 0
+        return !(aggregateFacetResult is not null && aggregateFacetResult.Output<AggregateCountResult>().Count != 0
+)
             ? aggregateFacetResult.Output<AggregateCountResult>()[0].Count
             : 0;
killedBy: IntegrationTest.Infra.MongoDB.Commons.Extensions.QueryByPageExtensionsTest.SuccessfulToQueryByPage

[Killed] Equality mutation
Infra.MongoDB/Commons/Extensions/MongoCollectionQueryByPageExtensions.cs:52:52
     private static long GetTotalOfElements(IReadOnlyList<AggregateFacetResults> aggregation)
     {
         AggregateFacetResult? aggregateFacetResult = aggregation[0].Facets.FirstOrDefault(element => element.Name == "count");
-        return aggregateFacetResult is not null && aggregateFacetResult.Output<AggregateCountResult>().Count != 0
+        return aggregateFacetResult is not null && aggregateFacetResult.Output<AggregateCountResult>().Count == 0
             ? aggregateFacetResult.Output<AggregateCountResult>()[0].Count
             : 0;
killedBy: IntegrationTest.Infra.MongoDB.Commons.Extensions.QueryByPageExtensionsTest.SuccessfulToQueryByPage
