[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:46:9
     public static void AddGreaterOrEqualFilter<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, float value)
     {
         if (value == 0) return;
-        filterDefinitions.Add(Builders<T>.Filter.Gte(expression, value));
+        ;
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterHelperTest.SuccessfulToAddFilterIfValueIsNotNull

[Killed] Statement mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:52:9
     public static void AddLessOrEqualFilter<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, float value)
     {
         if (value == 0) return;
-        filterDefinitions.Add(Builders<T>.Filter.Lte(expression, value));
+        ;
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterHelperTest.SuccessfulToAddFilterIfValueIsNotNull

[Killed] Equality mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:57:13
 
     public static void AddInArrayFilter<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, List<string> values)
     {
-        if (values == null || values.Count == 0) return;
+        if (values != null || values.Count == 0) return;
         filterDefinitions.Add(Builders<T>.Filter.In(expression, values));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterHelperTest.SuccessfulToAddFilterIfValueIsNotNull

[Killed] Logical mutation
Infra.MongoDB/Commons/Helpers/FilterHelper.cs:57:13
 
     public static void AddInArrayFilter<T>(List<FilterDefinition<T>> filterDefinitions, Expression<Func<T, object>> expression, List<string> values)
     {
-        if (values == null || values.Count == 0) return;
+        if (values == null && values.Count == 0) return;
         filterDefinitions.Add(Builders<T>.Filter.In(expression, values));
     }
killedBy: IntegrationTest.Infra.MongoDB.Commons.FilterHelperTest.FailToAddFilterIfValueIsNotRelevant
