[Killed] Equality mutation
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:41:22
     private static bool CompareList<T>(IList<T> first, IList<T> second)
     {
         if (first is null && second is null) return true;
-        if (first is null || second is null) return false;
+        if (first is not null || second is null) return false;
 
         return !first.Except(second).Any() && !second.Except(first).Any();
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfCurrentValueIsNull; IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.FailToAddMultipleUpDefinitionsIfValueHasNotChanged

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Infra.MongoDB/Commons/Helpers/UpdateHelper.cs:43:47
         if (first is null && second is null) return true;
         if (first is null || second is null) return false;
 
-        return !first.Except(second).Any() && !second.Except(first).Any();
+        return !first.Except(second).Any() && second.Except(first).Any();
     }
 }
killedBy: IntegrationTest.Infra.MongoDB.Commons.UpdateDefinitionHelperTest.FailToAddMultipleUpDefinitionsIfValueHasNotChanged
