[Killed] Object initializer mutation
Domains/QueryStructures/Mappers/AiSettingsMapper.cs:23:16
 
     public static AiSettingsEntity ToEntity(this AiSettings model)
     {
-        return new AiSettingsEntity
-        {
-            UsagePercentage = model.UsagePercentage,
-            ApiKey = model.ApiKey,
-            Model = model.Model,
-            Temperature = model.Temperature,
-            MaxTokens = model.MaxTokens,
-            PromptTemplate = model.PromptTemplate
-        };
+        return new AiSettingsEntity
+{};
     }
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.SuccessfulToRegisterQueryStructureWhenQueryStructureNotExists
