[Killed] Object initializer mutation
Domains/QueryStructures/Mappers/ClientMapper.cs:10:16
 {
     public static Client ToModel(this ClientEntity entity)
     {
-        return new Client
-        {
-            Id = entity.Id,
-            Uid = entity.Uid,
-            Name = entity.Name,
-            Description = entity.Description,
-            CreatedAt = entity.CreatedAt.ToLocalTime(),
-            UpdatedAt = entity.UpdatedAt.ToLocalTime()
-        };
+        return new Client
+{};
     }
     
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.SuccessfulToRegisterClientWhenClientNotExists
