[Survived] Statement mutation
Domains/QueryStructures/Mappers/EntryMapper.cs:15:13
         IList<Entry> models = new List<Entry>(entities.Count);
         foreach (EntryEntity entity in entities)
         {
-            models.Add(entity.ToModel());
+            ;
         }
 

[Survived] Object initializer mutation
Domains/QueryStructures/Mappers/EntryMapper.cs:23:16
 
     private static Entry ToModel(this EntryEntity entity)
     {
-        return new Entry
-        {
-            Rank = entity.Rank,
-            Key = entity.Key,
-            Exclusive = entity.Exclusive,
-            Immiscible = entity.Immiscible,
-            KeyWords = entity.KeyWords.AsEmptyIfNull(),
-            IncompatibleWith = entity.IncompatibleWith.AsEmptyIfNull()
-        };
+        return new Entry
+{};
     }
     

[NoCoverage] Statement mutation
Domains/QueryStructures/Mappers/EntryMapper.cs:39:13
         IList<EntryEntity> entities = new List<EntryEntity>(models.Count);
         foreach (Entry model in models)
         {
-            entities.Add(model.ToEntity());
+            ;
         }
 
