[NoCoverage] Object initializer mutation
Domains/QueryStructures/Mappers/ItemMapper.cs:49:16
 
     private static ItemEntity ToEntity(this Item model)
     {
-        return new ItemEntity
-        {
-            Rank = model.Rank,
-            Name = model.Name,
-            Description = model.Description,
-            IsCountable = model.IsCountable,
-            WaitForConfirmationWords = model.WaitForConfirmationWords,
-            Entries = model.Entries.AsEmptyIfNull().ToEntity(),
-            ConfirmationWords = model.ConfirmationWords.AsEmptyIfNull(),
-            RevocationWords = model.RevocationWords.AsEmptyIfNull()
-        };
+        return new ItemEntity
+{};
     }
 }
