[Killed] Object initializer mutation
Domains/QueryStructures/Mappers/QueryStructureMapper.cs:11:16
 {
     public static QueryStructure ToModel(this QueryStructureEntity entity)
     {
-        return new QueryStructure
-        {
-            ClientUid = entity.ClientUid,
-            Name = entity.Name,
-            Description = entity.Description,
-            AiSettings = entity.AiSettings.ToModel(),
-            CreatedAt = entity.CreatedAt.ToLocalTime(),
-            UpdatedAt = entity.UpdatedAt.ToLocalTime(),
-            Items = entity.Items.AsEmptyIfNull().ToModel()
-        };
+        return new QueryStructure
+{};
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.SuccessfulToRegisterQueryStructureWhenQueryStructureNotExists
