[Killed] Block removal mutation
Domains/QueryStructures/Providers/GetQueryStructureByNameProvider.cs:22:5
     private readonly ObjectCache _cache = MemoryCache.Default;
 
     public GetQueryStructureByNameProvider(IRepository<QueryStructureEntity> clientRepository)
-    {
-        _clientRepository = ArgumentValidator.CheckNull(clientRepository, nameof(clientRepository));
-    }
+    {}
 
     public async Task<Core.Commons.Optional<QueryStructure>> ExecuteAsync(string clientUid, string name)
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists; IntegrationTest.Infra.MongoDB.Commons.Extensions.QueryByPageExtensionsTest.SuccessfulToQueryByPage

[Survived] Negate expression
Domains/QueryStructures/Providers/GetQueryStructureByNameProvider.cs:29:13
     public async Task<Core.Commons.Optional<QueryStructure>> ExecuteAsync(string clientUid, string name)
     {
         Core.Commons.Optional<QueryStructure> cached = await GetCachedResult(clientUid, name);
-        if (cached.HasValue()) return cached;
+        if (!(cached.HasValue())) return cached;
         
         FilterDefinition<QueryStructureEntity> filterDefinitions = GetFilterDefinition(clientUid, name);

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
Domains/QueryStructures/Providers/GetQueryStructureByNameProvider.cs:35:13
         Core.Commons.Optional<QueryStructureEntity> optionalEntity = await _clientRepository.FindOneAsync(filterDefinitions);
         Core.Commons.Optional<QueryStructure> optional = optionalEntity.Map(QueryStructureMapper.ToModel);
 
-        if (!optional.HasValue()) return optional;
+        if (optional.HasValue()) return optional;
         
         QueryStructure queryStructure = optional.GetValue();

[Survived] Statement mutation
Domains/QueryStructures/Providers/GetQueryStructureByNameProvider.cs:38:9
         if (!optional.HasValue()) return optional;
         
         QueryStructure queryStructure = optional.GetValue();
-        AddToCache(clientUid, name, queryStructure);
+        ;
 
         return optional;

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
Domains/QueryStructures/Providers/GetQueryStructureByNameProvider.cs:46:13
     private Task<Core.Commons.Optional<QueryStructure>> GetCachedResult(string clientUid, string name)
     {
         string cacheKey = GetCacheKey(clientUid, name);
-        if (!_cache.Contains(cacheKey)) return Task.FromResult(Core.Commons.Optional<QueryStructure>.Empty());
+        if (_cache.Contains(cacheKey)) return Task.FromResult(Core.Commons.Optional<QueryStructure>.Empty());
 
         QueryStructure queryStructure = (QueryStructure) _cache.Get(cacheKey);

[Survived] Object initializer mutation
Domains/QueryStructures/Providers/GetQueryStructureByNameProvider.cs:59:34
     private void AddToCache(string clientUid, string name, QueryStructure queryStructure)
     {
         string cacheKey = GetCacheKey(clientUid, name);
-        CacheItemPolicy policy = new CacheItemPolicy { AbsoluteExpiration = DateTimeOffset.Now.AddMinutes(60) };
+        CacheItemPolicy policy = new CacheItemPolicy {};
         _cache.Set(cacheKey, queryStructure, policy);
     }

[Survived] Statement mutation
Domains/QueryStructures/Providers/GetQueryStructureByNameProvider.cs:60:9
     {
         string cacheKey = GetCacheKey(clientUid, name);
         CacheItemPolicy policy = new CacheItemPolicy { AbsoluteExpiration = DateTimeOffset.Now.AddMinutes(60) };
-        _cache.Set(cacheKey, queryStructure, policy);
+        ;
     }
     

[Survived] Statement mutation
Domains/QueryStructures/Providers/GetQueryStructureByNameProvider.cs:67:9
     {
         IList<FilterDefinition<QueryStructureEntity>> filters = new List<FilterDefinition<QueryStructureEntity>>();
 
-        FilterHelper.AddEqualsFilter(filters, entity => entity.ClientUid, clientUid);
+        ;
         FilterHelper.AddEqualsFilter(filters, entity => entity.Name, name);
 

[Survived] Statement mutation
Domains/QueryStructures/Providers/GetQueryStructureByNameProvider.cs:68:9
         IList<FilterDefinition<QueryStructureEntity>> filters = new List<FilterDefinition<QueryStructureEntity>>();
 
         FilterHelper.AddEqualsFilter(filters, entity => entity.ClientUid, clientUid);
-        FilterHelper.AddEqualsFilter(filters, entity => entity.Name, name);
+        ;
 
         return filters.Count == 0 ? Builders<QueryStructureEntity>.Filter.Empty : Builders<QueryStructureEntity>.Filter.And(filters);

[Survived] Equality mutation
Domains/QueryStructures/Providers/GetQueryStructureByNameProvider.cs:70:16
         FilterHelper.AddEqualsFilter(filters, entity => entity.ClientUid, clientUid);
         FilterHelper.AddEqualsFilter(filters, entity => entity.Name, name);
 
-        return filters.Count == 0 ? Builders<QueryStructureEntity>.Filter.Empty : Builders<QueryStructureEntity>.Filter.And(filters);
+        return filters.Count != 0 ? Builders<QueryStructureEntity>.Filter.Empty : Builders<QueryStructureEntity>.Filter.And(filters);
     }
 }
