[Killed] Block removal mutation
Domains/QueryStructures/Providers/RegisterClientProvider.cs:20:5
     private readonly ISequenceRepository<ClientSequence> _sequenceRepository;
 
     public RegisterClientProvider(IRepository<ClientEntity> clientRepository, ISequenceRepository<ClientSequence> clientSequenceRepository)
-    {
-        _entityRepository = ArgumentValidator.CheckNull(clientRepository, nameof(clientRepository));
-        _sequenceRepository = ArgumentValidator.CheckNull(clientSequenceRepository, nameof(clientSequenceRepository));
-    }
+    {}
 
     public async Task<Client> ExecuteAsync(Client client)
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.SuccessfulToRegisterClientWhenClientNotExists; IntegrationTest.Infra.MongoDB.Commons.Extensions.QueryByPageExtensionsTest.SuccessfulToQueryByPage

[Survived] Statement mutation
Domains/QueryStructures/Providers/RegisterClientProvider.cs:28:9
     public async Task<Client> ExecuteAsync(Client client)
     {
         ClientEntity entity = client.ToEntity();
-        await IncrementId(entity);
+        ;
 
         return (await _entityRepository.SaveAsync(entity)).ToModel();

[Survived] Block removal mutation
Domains/QueryStructures/Providers/RegisterClientProvider.cs:34:5
     }
 
     private async Task IncrementId(Entity entity)
-    {
-        FilterDefinition<ClientSequence> filter = Builders<ClientSequence>.Filter.Eq(sequence => sequence.SequenceName, KeyField);
-        ISequence sequence = await _sequenceRepository.GetSequenceAndUpdate(filter);
-        entity.Id = sequence.SequenceValue;
-    }
+    {}
 }
 
