[Killed] Block removal mutation
Domains/QueryStructures/Providers/RegisterQueryStructureProvider.cs:20:5
     private readonly ISequenceRepository<QueryStructureSequence> _sequenceRepository;
 
     public RegisterQueryStructureProvider(IRepository<QueryStructureEntity> entityRepository, ISequenceRepository<QueryStructureSequence> sequenceRepository)
-    {
-        _entityRepository = ArgumentValidator.CheckNull(entityRepository, nameof(entityRepository));
-        _sequenceRepository = ArgumentValidator.CheckNull(sequenceRepository, nameof(sequenceRepository));
-    }
+    {}
 
     public async Task<QueryStructure> ExecuteAsync(QueryStructure queryStructure)
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.SuccessfulToRegisterClientWhenClientNotExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.SuccessfulToRegisterQueryStructureWhenQueryStructureNotExists

[Killed] Statement mutation
Domains/QueryStructures/Providers/RegisterQueryStructureProvider.cs:29:9
     {
         QueryStructureEntity entity = queryStructure.ToEntity();
 
-        await IncrementId(entity);
+        ;
 
         return (await _entityRepository.SaveAsync(entity)).ToModel();
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.SuccessfulToRegisterQueryStructureWhenQueryStructureNotExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.FailToRegisterQueryStructureWhenQueryStructureAlreadyExists

[Killed] Block removal mutation
Domains/QueryStructures/Providers/RegisterQueryStructureProvider.cs:35:5
     }
 
     private async Task IncrementId(Entity entity)
-    {
-        FilterDefinition<QueryStructureSequence> filterDefinition = Builders<QueryStructureSequence>.Filter.Eq(sequence => sequence.SequenceName, KeyField);
-        ISequence sequence = await _sequenceRepository.GetSequenceAndUpdate(filterDefinition);
-        entity.Id = sequence.SequenceValue;
-    }
+    {}
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.FailToRegisterQueryStructureWhenQueryStructureAlreadyExists
