[NoCoverage] Block removal mutation
Domains/QueryStructures/Providers/UpdateQueryStructureProvider.cs:20:5
     private readonly ISequenceRepository<QueryStructureSequence> _sequenceRepository;
 
     public UpdateQueryStructureProvider(IRepository<QueryStructureEntity> entityRepository, ISequenceRepository<QueryStructureSequence> sequenceRepository)
-    {
-        _entityRepository = ArgumentValidator.CheckNull(entityRepository, nameof(entityRepository));
-        _sequenceRepository = ArgumentValidator.CheckNull(sequenceRepository, nameof(sequenceRepository));
-    }
+    {}
 
     public async Task<QueryStructure> ExecuteAsync(QueryStructure queryStructure)

[NoCoverage] Statement mutation
Domains/QueryStructures/Providers/UpdateQueryStructureProvider.cs:31:9
         
         // TODO: Get the current entity from the database
 
-        await UpdateEntity(entity);
+        ;
 
         return (await _entityRepository.SaveAsync(entity)).ToModel();

[NoCoverage] Collection initializer mutation
Domains/QueryStructures/Providers/UpdateQueryStructureProvider.cs:44:75
             entity.Id
         );
 
-        IList<UpdateDefinition<QueryStructureEntity>> updateDefinitions = new List<UpdateDefinition<QueryStructureEntity>>
-        {
-            Builders<QueryStructureEntity>.Update.Set(queryStructureEntity => queryStructureEntity.UpdatedAt, entity.UpdatedAt),
-        };
+        IList<UpdateDefinition<QueryStructureEntity>> updateDefinitions = new List<UpdateDefinition<QueryStructureEntity>>
+{};
 
         AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.Name), entity.Name, entity.Name);

[NoCoverage] Statement mutation
Domains/QueryStructures/Providers/UpdateQueryStructureProvider.cs:49:9
             Builders<QueryStructureEntity>.Update.Set(queryStructureEntity => queryStructureEntity.UpdatedAt, entity.UpdatedAt),
         };
 
-        AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.Name), entity.Name, entity.Name);
+        ;
         AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.Description), entity.Description, entity.Description);
         AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.AiSettings), entity.AiSettings, entity.AiSettings);

[NoCoverage] Statement mutation
Domains/QueryStructures/Providers/UpdateQueryStructureProvider.cs:50:9
         };
 
         AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.Name), entity.Name, entity.Name);
-        AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.Description), entity.Description, entity.Description);
+        ;
         AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.AiSettings), entity.AiSettings, entity.AiSettings);
         AddUpDefinitionIfItemsHasChanged(ref updateDefinitions, nameof(entity.Items), entity.Items, entity.Items);

[NoCoverage] Statement mutation
Domains/QueryStructures/Providers/UpdateQueryStructureProvider.cs:51:9
 
         AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.Name), entity.Name, entity.Name);
         AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.Description), entity.Description, entity.Description);
-        AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.AiSettings), entity.AiSettings, entity.AiSettings);
+        ;
         AddUpDefinitionIfItemsHasChanged(ref updateDefinitions, nameof(entity.Items), entity.Items, entity.Items);
 

[NoCoverage] Statement mutation
Domains/QueryStructures/Providers/UpdateQueryStructureProvider.cs:52:9
         AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.Name), entity.Name, entity.Name);
         AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.Description), entity.Description, entity.Description);
         AddUpDefinitionIfValueHasChanged(ref updateDefinitions, nameof(entity.AiSettings), entity.AiSettings, entity.AiSettings);
-        AddUpDefinitionIfItemsHasChanged(ref updateDefinitions, nameof(entity.Items), entity.Items, entity.Items);
+        ;
 
         UpdateDefinition<QueryStructureEntity> update = Builders<QueryStructureEntity>.Update.Combine(updateDefinitions);

[NoCoverage] Statement mutation
Domains/QueryStructures/Providers/UpdateQueryStructureProvider.cs:58:9
             
         // TODO: Increment rank of items and entries
 
-        await _entityRepository.UpdateOneAsync(filter, update);
+        ;
     }
 }
