[Killed] Object initializer mutation
Domains/QueryStructures/Repository/ClientRepository.cs:22:49
         IndexKeysDefinition<ClientEntity> indexKeyName = Builders<ClientEntity>
             .IndexKeys.Ascending(document => document.Name);
 
-        CreateIndexOptions uniqueIndexOptions = new CreateIndexOptions
-            {Unique = true, Sparse = true, Background = false};
+        CreateIndexOptions uniqueIndexOptions = new CreateIndexOptions
+{};
 
         GetCollection().Indexes
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.SuccessfulToRegisterQueryStructureWhenQueryStructureNotExists; IntegrationTest.Infra.MongoDB.Commons.Extensions.QueryByPageExtensionsTest.SuccessfulToQueryByPage

[Killed] Boolean mutation
Domains/QueryStructures/Repository/ClientRepository.cs:23:23
             .IndexKeys.Ascending(document => document.Name);
 
         CreateIndexOptions uniqueIndexOptions = new CreateIndexOptions
-            {Unique = true, Sparse = true, Background = false};
+            {Unique = false, Sparse = true, Background = false};
 
         GetCollection().Indexes
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists

[Killed] Boolean mutation
Domains/QueryStructures/Repository/ClientRepository.cs:23:38
             .IndexKeys.Ascending(document => document.Name);
 
         CreateIndexOptions uniqueIndexOptions = new CreateIndexOptions
-            {Unique = true, Sparse = true, Background = false};
+            {Unique = true, Sparse = false, Background = false};
 
         GetCollection().Indexes
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists

[Killed] Statement mutation
Domains/QueryStructures/Repository/ClientRepository.cs:25:9
         CreateIndexOptions uniqueIndexOptions = new CreateIndexOptions
             {Unique = true, Sparse = true, Background = false};
 
-        GetCollection().Indexes
-            .CreateManyAsync(new[]
-            {
-                new CreateIndexModel<ClientEntity>(indexKeyId, uniqueIndexOptions),
-                new CreateIndexModel<ClientEntity>(indexKeyUid, uniqueIndexOptions),
-                new CreateIndexModel<ClientEntity>(indexKeyName, uniqueIndexOptions)
-            });
+        ;
     }
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists
