[Killed] Boolean mutation
Domains/QueryStructures/Repository/QueryStructureRepository.cs:29:39
             {Unique = true, Sparse = true, Background = false};
 
         CreateIndexOptions nonUniqueIndexOptions = new CreateIndexOptions
-            {Unique = false, Sparse = true, Background = false};
+            {Unique = false, Sparse = false, Background = false};
 
         GetCollection().Indexes
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists

[Killed] Boolean mutation
Domains/QueryStructures/Repository/QueryStructureRepository.cs:29:23
             {Unique = true, Sparse = true, Background = false};
 
         CreateIndexOptions nonUniqueIndexOptions = new CreateIndexOptions
-            {Unique = false, Sparse = true, Background = false};
+            {Unique = true, Sparse = true, Background = false};
 
         GetCollection().Indexes
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists

[Survived] Statement mutation
Domains/QueryStructures/Repository/QueryStructureRepository.cs:31:9
         CreateIndexOptions nonUniqueIndexOptions = new CreateIndexOptions
             {Unique = false, Sparse = true, Background = false};
 
-        GetCollection().Indexes
-            .CreateManyAsync(new[]
-            {
-                new CreateIndexModel<QueryStructureEntity>(indexKeyId, uniqueIndexOptions),
-                new CreateIndexModel<QueryStructureEntity>(indexKeyClientUid, nonUniqueIndexOptions),
-                new CreateIndexModel<QueryStructureEntity>(indexKeyNameAndClientUid, uniqueIndexOptions)
-            });
+        ;
     }
 }
