[Killed] Boolean mutation
Domains/QueryStructures/Repository/QueryStructureSequenceRepository.cs:22:57
             .IndexKeys.Ascending(sequence => sequence.SequenceName);
 
         CreateIndexOptions uniqueIndexOptions = new CreateIndexOptions
-            {Unique = true, Sparse = true, Background = false};
+            {Unique = true, Sparse = true, Background = true};
 
         _collection.Indexes.CreateManyAsync(new[]
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists

[Killed] Statement mutation
Domains/QueryStructures/Repository/QueryStructureSequenceRepository.cs:24:9
         CreateIndexOptions uniqueIndexOptions = new CreateIndexOptions
             {Unique = true, Sparse = true, Background = false};
 
-        _collection.Indexes.CreateManyAsync(new[]
-        {
-            new CreateIndexModel<QueryStructureSequence>(indexKeySequenceName, uniqueIndexOptions)
-        });
+        ;
     }
 
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists

[Killed] Boolean mutation
Domains/QueryStructures/Repository/QueryStructureSequenceRepository.cs:35:28
         FindOneAndUpdateOptions<QueryStructureSequence> findOneAndUpdateOptions =
             new FindOneAndUpdateOptions<QueryStructureSequence>
             {
-                IsUpsert = true,
+                IsUpsert = false,
                 ReturnDocument = ReturnDocument.After
             };
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.SuccessfulToRegisterQueryStructureWhenQueryStructureNotExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.FailToRegisterQueryStructureWhenQueryStructureAlreadyExists
