[Killed] Block removal mutation
Infra.MongoDB/Commons/Connection/ConnectionFactory.cs:9:5
 {
 
     public IMongoClient GetClient()
-    {
-        return new MongoClient(connectionString);
-    }
+    {}
 
     public IMongoDatabase GetDatabase(string databaseName)
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.SuccessfulToRegisterQueryStructureWhenQueryStructureNotExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.FailToRegisterQueryStructureWhenQueryStructureAlreadyExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterClientProviderTest.FailToRegisterClientWhenClientAlreadyExists
