[Survived] String mutation
Infra.MongoDB/Commons/Extensions/MongoCollectionQueryByPageExtensions.cs:24:80
                 PipelineStageDefinitionBuilder.Count<TDocument>()
             ]));
 
-        AggregateFacet<TDocument, TDocument> dataFacet = AggregateFacet.Create("content",
+        AggregateFacet<TDocument, TDocument> dataFacet = AggregateFacet.Create("",
             PipelineDefinition<TDocument, TDocument>.Create([
                 PipelineStageDefinitionBuilder.Sort(sortDefinition),
