[Survived] Conditional (true) mutation
Infra.MongoDB/Commons/Helpers/SortHelper.cs:15:34
         List<SortDefinition<T>> definitions =
         [
             .. orders
-                .Select(order => order.Direction == Direction.Asc
-                    ? Builders<T>.Sort.Ascending(order.Property)
-                    : Builders<T>.Sort.Descending(order.Property))
+                .Select(order => (true?Builders<T>.Sort.Ascending(order.Property)
+:Builders<T>.Sort.Descending(order.Property)))
         ];
 

[Survived] Equality mutation
Infra.MongoDB/Commons/Helpers/SortHelper.cs:15:34
         List<SortDefinition<T>> definitions =
         [
             .. orders
-                .Select(order => order.Direction == Direction.Asc
+                .Select(order => order.Direction != Direction.Asc
                     ? Builders<T>.Sort.Ascending(order.Property)
                     : Builders<T>.Sort.Descending(order.Property))
