[Survived] String mutation
Domains/QueryStructures/Providers/GetQueryStructureByNameProvider.cs:49:73
         return Task.FromResult(optional);
     }
     
-    private static string GetCacheKey(string clientUid, string name) => $"QueryStructure_{clientUid}_{name}";
+    private static string GetCacheKey(string clientUid, string name) => $"";
     
     private void AddToCache(string clientUid, string name, QueryStructure queryStructure)

[Survived] Conditional (false) mutation
Domains/QueryStructures/Providers/GetQueryStructureByNameProvider.cs:65:16
         FilterHelper.AddEqualsFilter(filters, entity => entity.ClientUid, clientUid);
         FilterHelper.AddEqualsFilter(filters, entity => entity.Name, name);
 
-        return filters.Count == 0 ? Builders<QueryStructureEntity>.Filter.Empty : Builders<QueryStructureEntity>.Filter.And(filters);
+        return (false?Builders<QueryStructureEntity>.Filter.Empty :Builders<QueryStructureEntity>.Filter.And(filters));
     }
 }
