[Killed] Statement mutation
Domains/QueryStructures/Repository/ClientRepository.cs:25:9
         CreateIndexOptions uniqueIndexOptions = new CreateIndexOptions
             {Unique = true, Sparse = true, Background = false};
 
-        GetCollection().Indexes
-            .CreateManyAsync([
-                new CreateIndexModel<ClientEntity>(indexKeyId, uniqueIndexOptions),
-                new CreateIndexModel<ClientEntity>(indexKeyUid, uniqueIndexOptions),
-                new CreateIndexModel<ClientEntity>(indexKeyName, uniqueIndexOptions)
-            ]);
+        ;
     }
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.SuccessfulToRegisterQueryStructureWhenQueryStructureNotExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.GetQueryStructureByNameProviderTest.SuccessfulToGetQueryStructureByClientUidAndName
