[Killed] Boolean mutation
Domains/QueryStructures/Repository/QueryStructureRepository.cs:29:58
             {Unique = true, Sparse = true, Background = false};
 
         CreateIndexOptions nonUniqueIndexOptions = new CreateIndexOptions
-            {Unique = false, Sparse = true, Background = false};
+            {Unique = false, Sparse = true, Background = true};
 
         GetCollection().Indexes
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.SuccessfulToRegisterQueryStructureWhenQueryStructureNotExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.RegisterQueryStructureProviderTest.FailToRegisterQueryStructureWhenQueryStructureAlreadyExists; IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.GetQueryStructureByNameProviderTest.SuccessfulToGetQueryStructureByClientUidAndName

[Killed] Statement mutation
Domains/QueryStructures/Repository/QueryStructureRepository.cs:31:9
         CreateIndexOptions nonUniqueIndexOptions = new CreateIndexOptions
             {Unique = false, Sparse = true, Background = false};
 
-        GetCollection().Indexes
-            .CreateManyAsync([
-                new CreateIndexModel<QueryStructureEntity>(indexKeyId, uniqueIndexOptions),
-                new CreateIndexModel<QueryStructureEntity>(indexKeyClientUid, nonUniqueIndexOptions),
-                new CreateIndexModel<QueryStructureEntity>(indexKeyNameAndClientUid, uniqueIndexOptions)
-            ]);
+        ;
     }
 }
killedBy: IntegrationTest.Infra.MongoDB.Domains.QueryStructures.Providers.GetQueryStructureByNameProviderTest.SuccessfulToGetQueryStructureByClientUidAndName
