[Survived] Statement mutation
Domains/QueryStructures/Repository/QueryStructureSequenceRepository.cs:24:9
         CreateIndexOptions uniqueIndexOptions = new CreateIndexOptions
             {Unique = true, Sparse = true, Background = false};
 
-        _collection.Indexes.CreateManyAsync([
-            new CreateIndexModel<QueryStructureSequence>(indexKeySequenceName, uniqueIndexOptions)
-        ]);
+        ;
     }
 
